{
    "movie_details": [
        {
            "movie_id": 11,
            "language": "en",
            "title": "Star Wars",
            "genre": [
                "Adventure",
                "Action",
                "Science Fiction"
            ],
            "description": "Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker and dashing captain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.",
            "poster": "/6FfCtAuVAW8XJjZ7eWeLibRLWTw.jpg",
            "director": 1,
            "release_date": "1977-05-25",
            "vote_average": 8.2
        },
        {
            "movie_id": 293660,
            "language": "en",
            "title": "Deadpool",
            "genre": [
                "Action",
                "Adventure",
                "Comedy"
            ],
            "description": "The origin story of former Special Forces operative turned mercenary Wade Wilson, who, after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.",
            "poster": "/fSRb7vyIP8rQpL0I47P3qUsEKX3.jpg",
            "director": 55252,
            "release_date": "2016-02-09",
            "vote_average": 7.612
        },
        {
            "movie_id": 475557,
            "language": "en",
            "title": "Joker",
            "genre": [
                "Crime",
                "Thriller",
                "Drama"
            ],
            "description": "During the 1980s, a failed stand-up comedian is driven insane and turns to a life of crime and chaos in Gotham City while becoming an infamous psychopathic crime figure.",
            "poster": "/udDclJoHjfjb8Ekgsd4FDteOkCU.jpg",
            "director": 57130,
            "release_date": "2019-10-01",
            "vote_average": 8.162
        },
        {
            "movie_id": 43074,
            "language": "en",
            "title": "Ghostbusters",
            "genre": [
                "Action",
                "Fantasy",
                "Comedy"
            ],
            "description": "Following a ghost invasion of Manhattan, paranormal enthusiasts Erin Gilbert and Abby Yates, nuclear engineer Jillian Holtzmann, and subway worker Patty Tolan band together to stop the otherworldly threat.",
            "poster": "/wJmWliwXIgZOCCVOcGRBhce7xPS.jpg",
            "director": 116805,
            "release_date": "2016-07-14",
            "vote_average": 5.358
        },
        {
            "movie_id": 263115,
            "language": "en",
            "title": "Logan",
            "genre": [
                "Action",
                "Drama",
                "Science Fiction"
            ],
            "description": "In the near future, a weary Logan cares for an ailing Professor X in a hideout on the Mexican border. But Logan's attempts to hide from the world and his legacy are upended when a young mutant arrives, pursued by dark forces.",
            "poster": "/fnbjcRDYn6YviCcePDnGdyAkYsB.jpg",
            "director": 366,
            "release_date": "2017-02-28",
            "vote_average": 7.8
        },
        {
            "movie_id": 299537,
            "language": "en",
            "title": "Captain Marvel",
            "genre": [
                "Action",
                "Adventure",
                "Science Fiction"
            ],
            "description": "The story follows Carol Danvers as she becomes one of the universe’s most powerful heroes when Earth is caught in the middle of a galactic war between two alien races. Set in the 1990s, Captain Marvel is an all-new adventure from a previously unseen period in the history of the Marvel Cinematic Universe.",
            "poster": "/AtsgWhDnHTq68L0lLsUrCnM7TjG.jpg",
            "director": 53068,
            "release_date": "2019-03-06",
            "vote_average": 6.824
        },
        {
            "movie_id": 320288,
            "language": "en",
            "title": "Dark Phoenix",
            "genre": [
                "Science Fiction",
                "Action",
                "Adventure"
            ],
            "description": "The X-Men face their most formidable and powerful foe when one of their own, Jean Grey, starts to spiral out of control. During a rescue mission in outer space, Jean is nearly killed when she's hit by a mysterious cosmic force. Once she returns home, this force not only makes her infinitely more powerful, but far more unstable. The X-Men must now band together to save her soul and battle aliens that want to use Grey's new abilities to rule the galaxy.",
            "poster": "/cCTJPelKGLhALq3r51A9uMonxKj.jpg",
            "director": 11092,
            "release_date": "2019-06-05",
            "vote_average": 5.976
        },
        {
            "movie_id": 577922,
            "language": "en",
            "title": "Tenet",
            "genre": [
                "Action",
                "Thriller",
                "Science Fiction"
            ],
            "description": "Armed with only one word - Tenet - and fighting for the survival of the entire world, the Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.",
            "poster": "/k68nPLbIST6NP96JmTxmZijEvCA.jpg",
            "director": 525,
            "release_date": "2020-08-22",
            "vote_average": 7.182
        },
        {
            "movie_id": 27205,
            "language": "en",
            "title": "Inception",
            "genre": [
                "Action",
                "Science Fiction",
                "Adventure"
            ],
            "description": "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.",
            "poster": "/oYuLEt3zVCKq57qu2F8dT7NIa6f.jpg",
            "director": 525,
            "release_date": "2010-07-15",
            "vote_average": 8.368
        },
        {
            "movie_id": 157336,
            "language": "en",
            "title": "Interstellar",
            "genre": [
                "Adventure",
                "Drama",
                "Science Fiction"
            ],
            "description": "The adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
            "poster": "/gEU2QniE6E77NI6lCU6MxlNBvIx.jpg",
            "director": 525,
            "release_date": "2014-11-05",
            "vote_average": 8.434
        },
        {
            "movie_id": 62,
            "language": "en",
            "title": "2001: A Space Odyssey",
            "genre": [
                "Science Fiction",
                "Mystery",
                "Adventure"
            ],
            "description": "Humanity finds a mysterious object buried beneath the lunar surface and sets off to find its origins with the help of HAL 9000, the world's most advanced super computer.",
            "poster": "/ve72VxNqjGM69Uky4WTo2bK6rfq.jpg",
            "director": 240,
            "release_date": "1968-04-02",
            "vote_average": 8.1
        },
        {
            "movie_id": 680,
            "language": "en",
            "title": "Pulp Fiction",
            "genre": [
                "Thriller",
                "Crime"
            ],
            "description": "A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.",
            "poster": "/d5iIlFn5s0ImszYzBPb8JPIfbXD.jpg",
            "director": 138,
            "release_date": "1994-09-10",
            "vote_average": 8.489
        },
        {
            "movie_id": 490132,
            "language": "en",
            "title": "Green Book",
            "genre": [
                "Drama",
                "History"
            ],
            "description": "Tony Lip, a bouncer in 1962, is hired to drive pianist Don Shirley on a tour through the Deep South in the days when African Americans, forced to find alternate accommodations and services due to segregation laws below the Mason-Dixon Line, relied on a guide called The Negro Motorist Green Book.",
            "poster": "/7BsvSuDQuoqhWmU2fL7W2GOcZHU.jpg",
            "director": 7396,
            "release_date": "2018-11-16",
            "vote_average": 8.244
        },
        {
            "movie_id": 141,
            "language": "en",
            "title": "Donnie Darko",
            "genre": [
                "Fantasy",
                "Drama",
                "Mystery"
            ],
            "description": "After narrowly escaping a bizarre accident, a troubled teenager is plagued by visions of a large bunny rabbit that manipulates him to commit a series of crimes.",
            "poster": "/fhQoQfejY1hUcwyuLgpBrYs6uFt.jpg",
            "director": 1577,
            "release_date": "2001-01-19",
            "vote_average": 7.8
        },
        {
            "movie_id": 383498,
            "language": "en",
            "title": "Deadpool 2",
            "genre": [
                "Action",
                "Comedy",
                "Adventure"
            ],
            "description": "Wisecracking mercenary Deadpool battles the evil and powerful Cable and other bad guys to save a boy's life.",
            "poster": "/to0spRl1CMDvyUbOnbb4fTk3VAd.jpg",
            "director": 40684,
            "release_date": "2018-05-10",
            "vote_average": 7.487
        },
        {
            "movie_id": 699280,
            "language": "en",
            "title": "Becoming",
            "genre": [
                "Documentary"
            ],
            "description": "Join former first lady Michelle Obama in an intimate documentary looking at her life, hopes and connection with others.",
            "poster": "/f0vo1yoEVlbpJ0Fkn0FgU7dTrO8.jpg",
            "director": 1484586,
            "release_date": "2020-05-06",
            "vote_average": 7.4
        },
        {
            "movie_id": 297802,
            "language": "en",
            "title": "Aquaman",
            "genre": [
                "Action",
                "Adventure",
                "Fantasy"
            ],
            "description": "Half-human, half-Atlantean Arthur Curry is taken on the journey of his lifetime to discover if he is worth of being a king.",
            "poster": "/zdw7Wf97vsQ0YnGomxDqfcEdUjX.jpg",
            "director": 2127,
            "release_date": "2018-12-07",
            "vote_average": 6.896
        },
        {
            "movie_id": 829,
            "language": "en",
            "title": "Chinatown",
            "genre": [
                "Crime",
                "Drama",
                "Mystery",
                "Thriller"
            ],
            "description": "Private eye Jake Gittes lives off of the murky moral climate of sunbaked, pre-World War II Southern California. Hired by a beautiful socialite to investigate her husband's extra-marital affair, Gittes is swept into a maelstrom of double dealings and deadly deceits, uncovering a web of personal and political scandals that come crashing together.",
            "poster": "/mQJz8J4naOA7RmCtypTPjgXZIMY.jpg",
            "director": 3556,
            "release_date": "1974-06-20",
            "vote_average": 7.915
        },
        {
            "movie_id": 807,
            "language": "en",
            "title": "Se7en",
            "genre": [
                "Crime",
                "Mystery",
                "Thriller"
            ],
            "description": "Two homicide detectives are on a desperate hunt for a serial killer whose crimes are based on the \"seven deadly sins\" in this dark and haunting film that takes viewers from the tortured remains of one victim to the next. The seasoned Det. Sommerset researches each sin in an effort to get inside the killer's mind, while his novice partner, Mills, scoffs at his efforts to unravel the case.",
            "poster": "/6yoghtyTpznpBik8EngEmJskVUO.jpg",
            "director": 7467,
            "release_date": "1995-09-22",
            "vote_average": 8.373
        },
        {
            "movie_id": 16281,
            "language": "en",
            "title": "Creepshow",
            "genre": [
                "Horror",
                "Comedy"
            ],
            "description": "Five tales in the style of classic '50s horror comics, involving a murdered man emerging from the grave, a meteor's ooze that makes everything grow, a snack for a crated creature, a scheming husband, and a malevolent millionaire with an insect phobia.",
            "poster": "/4SoyTCEpsgLjX6yAyMsx3AsAyRQ.jpg",
            "director": 14999,
            "release_date": "1982-11-10",
            "vote_average": 6.9
        }
    ],
    "persons": [
        {
            "id": 1,
            "name": "George Lucas",
            "image": "/WCSZzWdtPmdRxH9LUCVi2JPCSJ.jpg",
            "birth_date": "1944-05-14",
            "biography": "George Walton Lucas Jr. (born May 14, 1944) is an American filmmaker and entrepreneur. Lucas is known for creating the Star Wars and Indiana Jones franchises and founding Lucasfilm, LucasArts and Industrial Light & Magic. He served as chairman of Lucasfilm before selling it to The Walt Disney Company in 2012.\n\nAfter graduating from the University of Southern California in 1967, Lucas co-founded American Zoetrope with filmmaker Francis Ford Coppola. Lucas wrote and directed THX 1138 (1971), based on his earlier student short Electronic Labyrinth: THX 1138 4EB, which was a critical success but a financial failure. His next work as a writer-director was the film American Graffiti (1973), inspired by his youth in early 1960s Modesto, California, and produced through the newly founded Lucasfilm. The film was critically and commercially successful, and received five Academy Award nominations including Best Picture.\n\nLucas's next film, the epic space opera Star Wars (1977), had a troubled production but was a surprise hit, becoming the highest-grossing film at the time, winning six Academy Awards and sparking a cultural phenomenon. Lucas produced and co-wrote the sequels The Empire Strikes Back (1980) and Return of the Jedi (1983). With director Steven Spielberg, he created, produced and co-wrote the Indiana Jones films Raiders of the Lost Ark (1981), Temple of Doom (1984), The Last Crusade (1989) and Kingdom of the Crystal Skull (2008). He also produced and wrote a variety of films and television series through Lucasfilm between the 1970s and the 2010s.\n\nIn 1997, Lucas rereleased the Star Wars trilogy as part of a special edition featuring several alterations; home media versions with further changes were released in 2004 and 2011. He returned to directing with a Star Wars prequel trilogy comprising The Phantom Menace (1999), Attack of the Clones (2002), and Revenge of the Sith (2005). He last collaborated on the CGI-animated television series Star Wars: The Clone Wars (2008–2014, 2020), the war film Red Tails (2012), and the CGI film Strange Magic (2015).\n\nLucas is one of history's most financially successful filmmakers and has been nominated for four Academy Awards. His films are among the 100 highest-grossing movies at the North American box office, adjusted for ticket-price inflation. Lucas is considered a significant figure of the 20th-century New Hollywood movement.\n\nDescription above from the Wikipedia article George Lucas, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 2,
            "name": "Mark Hamill",
            "image": "/zMQ93JTLW8KxusKhOlHFZhih3YQ.jpg",
            "birth_date": "1951-09-25",
            "biography": "Mark Richard Hamill (born September 25, 1951) is an American actor, voice artist, producer, director, and writer. Hamill is best known for his role as Luke Skywalker in the original Star Wars trilogy and also well known for voice-acting characters such as the Joker in various animated series, animated films and video games, beginning with Batman: The Animated Series, the Skeleton king in Super Robot Monkey Team Hyperforce Go!, Fire Lord Ozai in Avatar: The Last Airbender, Master Eraqus in Kingdom Hearts: Birth by Sleep, Skips in Regular Show, and Senator Stampington on Metalocalypse."
        },
        {
            "id": 3,
            "name": "Harrison Ford",
            "image": "/ActhM39LTxgx3tnJv3s5nM6hGD1.jpg",
            "birth_date": "1942-07-13",
            "biography": "Legendary Hollywood Icon Harrison Ford was born on July 13, 1942 in Chicago, Illinois. His family history includes a strong lineage of actors, radio personalities, and models. Ford attended public high school in Park Ridge, Illinois where he was a member of the school Radio Station WMTH. Ford worked as the lead voice for sports reporting at WMTH for several years. Acting wasn’t a major interest to Ford until his junior year at Ripon College when he first took an acting class. Ford’s career started in 1964 when he travelled to California in search of a voice-over job. He never received that position, but instead signed a contract with Columbia Pictures where he earned $150 weekly to play small fill in roles in various films.\n\nThrough the ’60s Ford worked on several TV shows including Gunsmoke, Ironside, Kung Fu, and American Style. It wasn’t until 1967 that he received his first credited role in the Western film, A Time for Killing. Dissatisfied with the meager roles he was being offered, Ford took a hiatus from acting to work as a self-employed carpenter. This seemingly odd diversion turned out to be a blessing in disguise for Harrison’s acting career when he was soon hired by famous film producer George Lucas. This was a turning point in Ford’s life that led to him be casted in milestone roles such as Han Solo and Indiana Jones.\n\nSince his most famous roles in the original Star Wars trilogy and Raiders of the Lost Ark, Ford has appeared in over 40 films. Many criticize his late-career work, saying his performances have been lackluster, leading to commercially disappointing films. Ford has always worked hard to protect his off-screen private life, keeping details about his children and marriages quiet. He has a total of five children including one recent adoption with third and current wife Calista Flockhart. In addition to acting, Ford is passionate about environmental conservation, aviation, and archeology."
        },
        {
            "id": 4,
            "name": "Carrie Fisher",
            "image": "/awb4UqzT6meD3JiQlraIzAqcRtH.jpg",
            "birth_date": "1956-10-21",
            "biography": "Carrie Frances Fisher (October 21, 1956 - December 27, 2016) was an American actress, novelist, screenwriter, and lecturer. Daughter of the famous actors Debbie Reynolds and Eddie Fisher, she gained fame for her portrayal of Princess Leia Organa in the original Star Wars trilogy. Her novel Postcards from the Edge was also a bestseller, for which she wrote a screenplay to the film of the same name."
        },
        {
            "id": 5,
            "name": "Peter Cushing",
            "image": "/if5g03wn6uvHx7F6FxXHLebKc0q.jpg",
            "birth_date": "1913-05-26",
            "biography": "Peter Wilton Cushing, OBE  (26 May 1913 – 11 August 1994) was an English actor, known for his many appearances in Hammer Films, in which he played Baron Frankenstein and Dr. Van Helsing, amongst many other roles, often appearing opposite Christopher Lee, and occasionally Vincent Price. A familiar face on both sides of the Atlantic, his most famous roles outside of \"Hammer Horror\" include his many appearances as Sherlock Holmes, as Grand Moff Tarkin in Star Wars (1977) and as the mysterious Doctor Who in Doctor Who and the Daleks and Daleks - Invasion Earth 2150 AD in 1965 and 1966, two cinema films based on the television series Doctor Who.\n\nDescription above from the Wikipedia article Peter Cushing, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 12248,
            "name": "Alec Guinness",
            "image": "/gplGgl6XERpvYdluiwY8GlxSdpi.jpg",
            "birth_date": "1914-04-02",
            "biography": "Sir Alec Guinness, CH, CBE (April 2, 1914 – August 5, 2000) was an English actor. He was featured in several of the Ealing Comedies, including Kind Hearts and Coronets in which he played eight different characters. He later won the Academy Award for Best Actor for his role as Colonel Nicholson in The Bridge on the River Kwai. He is most well known for playing Obi-Wan Kenobi in the original Star Wars trilogy. He also played Prince Feisal in Lawrence of Arabia and George Smiley in the TV adaptation of Tinker, Tailor, Soldier, Spy."
        },
        {
            "id": 6,
            "name": "Anthony Daniels",
            "image": "/c876ZM5ObwYgXksrRWNNrL9KeZg.jpg",
            "birth_date": "1946-02-21",
            "biography": "Anthony Daniels (born February 21, 1946) is an English actor and mime artist, best known for playing C-3PO in 10 Star Wars films. He is the only actor to have either appeared in or been involved with all theatrical films in the series, and has been involved in many of their spin-offs, including television series, video games, and radio serials.\n\nDescription above from the Wikipedia article Anthony Daniels, licensed under CC-BY-SA, full list of contributors on Wikipedia.​"
        },
        {
            "id": 55252,
            "name": "Tim Miller",
            "image": "/dCyBYwhO76j5wA96HPb6k5xk2Le.jpg",
            "birth_date": "1964-10-10",
            "biography": "Timothy Miller is an American film director and visual effects artist. He made his feature-film directing debut with Deadpool. He was nominated for the Academy Award for Best Animated Short Film as co-story writer and executive producer of the short animated film Gopher Broke."
        },
        {
            "id": 10859,
            "name": "Ryan Reynolds",
            "image": "/so89QyuxAZY8IOpNTweCekhxsvO.jpg",
            "birth_date": "1976-10-23",
            "biography": "Ryan Rodney Reynolds (born October 23, 1976) is a Canadian actor and film producer. He began his career starring in the Canadian teen soap opera Hillside (1991–1993), and had minor roles before landing the lead role on the sitcom Two Guys and a Girl between 1998 and 2001. Reynolds then starred in a range of films, including comedies such as National Lampoon's Van Wilder (2002), Waiting... (2005), and The Proposal (2009). He also performed in dramatic roles in Buried (2010), Woman in Gold (2015), and Life (2017), starred in action films such as Blade: Trinity (2004), Green Lantern (2011), 6 Underground (2019) and Free Guy (2021), and provided voice acting in the animated features The Croods (2013), Turbo (2013), Pokémon: Detective Pikachu (2019) and The Croods: A New Age (2020).\n\nReynolds' biggest commercial success came with the superhero films Deadpool (2016) and Deadpool 2 (2018), in which he played the title character. The former set numerous records at the time of its release for an R-rated comedy and his performance earned him nominations at the Critics' Choice Movie Awards and the Golden Globe Awards."
        },
        {
            "id": 54882,
            "name": "Morena Baccarin",
            "image": "/kBSKKaOtsqIzZPhtEeHfCBmhWl9.jpg",
            "birth_date": "1979-06-02",
            "biography": "Morena Baccarin (born June 2, 1979) is a Brazilian-born American actress most widely known for roles in several American science fiction television shows: as Inara Serra in the series Firefly; as Adria in the series Stargate SG-1; and as Anna in the 2009 version of the series V.\n\nBaccarin was born in Rio de Janeiro, Brazil. Her mother is Brazilian stage and TV actress Vera Setta, and her father is Italian journalist Fernando Baccarin. When she was 7, Baccarin moved with her family to Greenwich Village, New York, as her father was transferred to Globo TV's headquarters in the United States, working as editor. Baccarin attended Public School 41 and New York City Lab School for Collaborative Studies, where she and Claire Danes were classmates. She later attended the Fiorello H. LaGuardia High School of Music & Art and Performing Arts before she entered the theater program at Juilliard. Baccarin landed her first movie role in the improvised fashion world comedy Perfume (2001)."
        },
        {
            "id": 1047649,
            "name": "Ed Skrein",
            "image": "/AaMTvZkroI8uo5JXQiJ5pSLEgSJ.jpg",
            "birth_date": "1983-03-29",
            "biography": "Skrein made his acting debut in Plan B's short film Michelle. Skrein got his first lead role in Plan B's Ill Manors. Skrein portrayed Daario Naharis in the third season of the television series Game of Thrones. However, in the fourth season of the series, he had been replaced by Dutch actor Michiel Huisman. Skrein states that \"behind the scenes politics\" had forced him to leave the show. In 2014, Skrein was cast in The Transporter: Refueled, replacing Jason Statham as the lead. Though the film was critically panned, his performance was praised. In 2016, Skrein played the lead villain, Ajax, in the blockbuster action film Deadpool.\n\nOn 23 October 2015 Skrein was cast in sci-fi thriller, Gateway 6, alongside Rhys Ifans, with Tanel Toom making his directorial debut. Filming will commence in Estonia in the spring of 2016. On 29 October 2015 Skrein was cast in psychological revenge thriller, In Darkness, alongside Natalie Dormer and Stacy Martin; principal photography will begin early 2016."
        },
        {
            "id": 51990,
            "name": "T.J. Miller",
            "image": "/rRrVvBxOkyYM5XdLXimShHR1Itn.jpg",
            "birth_date": "1981-06-04",
            "biography": "Todd Joseph \"T.J.\" Miller (born June 4, 1981) is an American actor and stand-up comedian.\n\nAfter college, Miller moved to Chicago and began to perform improv and stand-up comedy. He toured with The Second City for two years. In 2008, he was named one of Variety's \"10 Comics To Watch.\"\n\nHe portrayed Marmaduke Brooker in Carpoolers on ABC (2007–2008).\n\nIn 2008, he made his film acting debut in Cloverfield in which he only appeared onscreen for a few minutes, but his voice was heard in almost every scene as the person who videotaped most of the events depicted. In 2009, he played Cessna Jim in The Goods: Live Hard, Sell Hard and the grindcore musician Rory in Mike Judge's comedy Extract. In 2010, he co-starred in She's Out of My League as Stainer, played Brian the Concierge in Get Him to the Greek and had a supporting role in Unstoppable. From 2010 to 2014, he voiced Tuffnut Thorston in the first three How to Train Your Dragon films.\n\nIn 2010, he played Ranger Jones in the live-action animated film Yogi Bear, and he also played Dan in Gulliver's Travels. In 2011, he appeared in the film Our Idiot Brother and, in 2012, he had a cameo as administrative personnel for Rolling Stone in the musical film Rock of Ages.\n\nOn 12/13/2010, 10/28/2011, and 6/14/2012, he performed stand-up on Conan. On November 15, 2011, his stand-up special No Real Reason premiered on Comedy Central. In 2011, he hosted a special called Mash Up, which was picked up in 2012 for a full season by Comedy Central. He also appeared frequently as a member of the \"round table\" on Chelsea Lately.\n\nIn 2012, he voiced Robbie Valentino on the Disney channel cartoon Gravity Falls. He also voiced Gorburger, a giant blue monster talk show host, on The Gorburger Show, which originally aired on Funny or Die and YouTube for 2 seasons in 2012–13, then on Comedy Central for a 3rd season in 2017.  In 2013, he co-starred in the Fox TV series The Goodwin Games as Jimmy Goodwin. In 2014, he was in Transformers: Age of Extinction and he voiced the character of Fred in the superhero CGI film Big Hero 6. He voiced Augie in the 2015 animated film Hell and Back. In 2015, he was part of Funny or Die's Oddball Comedy and Curiosity Festival, a touring show which included Amy Schumer, Aziz Ansari, and other comics.\n\nFrom 2014 to 2017, he starred as Erlich Bachman in the HBO sitcom Silicon Valley for which he won the Critics' Choice Television Award for Best Supporting Actor in a Comedy Series in 2015. In 2016, he starred in the movie Search Party with Adam Pally and the movie Office Christmas Party.\n\nOn June 17, 2017, HBO premiered his hour-long stand-up special, T.J. Miller: Meticulously Ridiculous, which was filmed in Miller's native Denver at the end of his 2016 Meticulously Ridiculous Tour. In October 2017, Miller began his \"Touring In Perpetuity Tour\", a self described \"One Man Philosophy Circus.\"\n\nIn 2018, he played the role of I-R0K in the film Ready Player One, directed by Steven Spielberg. As a commercial actor, he voiced a talking ball of mucus in commercials for Mucinex and starred as Greg the Genie in a promo campaign for Slim Jim meat snacks.\n\nHe hosted a podcast with friend and fellow comedian Cash Levy, titled Cashing in With TJ Miller, which began airing in March 2012 on the Nerdist Network. He is also a frequent guest on Doug Benson's podcast Doug Loves Movies."
        },
        {
            "id": 78452,
            "name": "Gina Carano",
            "image": "/hLEVSHW8vkogPA99Hhf1siasqbQ.jpg",
            "birth_date": "1982-04-16",
            "biography": "Gina Joy Carano is an American actress, television personality, fitness model and a former mixed martial artist. Carano appeared as Crush, a Gladiator on American Gladiators. She has been referred to as the \"Face of Women's MMA.\" Carano was formerly the third best 145 lb (66 kg) female fighter in the world, according to the Unified Women's MMA Rankings. Carano starred in the 2012 action film, Haywire, and 2013 film Fast & Furious 6."
        },
        {
            "id": 122750,
            "name": "Leslie Uggams",
            "image": "/peLaqLcs3y2WY4TbrLOXQGt9I8S.jpg",
            "birth_date": "1943-05-25",
            "biography": "Leslie Marian Uggams (born May 25, 1943) is an American actress and singer.\n\nBeginning her career as a child in the early 1950s, Uggams is recognized for portraying Kizzy Reynolds in the television miniseries Roots (1977), earning Golden Globe and Emmy Award nominations for her performance. She had earlier been highly acclaimed for the Broadway musical Hallelujah, Baby!, winning a Theatre World Award in 1967 and the Tony Award for Best Actress in a Musical in 1968.\n\nLater in her career, Uggams received renewed notice with appearances alongside Ryan Reynolds as Blind Al in Deadpool (2016) & Deadpool 2 (2018) and in a recurring role on Empire."
        },
        {
            "id": 57130,
            "name": "Todd Phillips",
            "image": "/A6FPht87DiqXzp456WjakLi2AtP.jpg",
            "birth_date": "1970-12-20",
            "biography": "American screenwriter and film director Todd Phillips made his first while a junior at NYU and it went on to become one of the biggest grossing student films at the time, even getting a limited theatrical release.; the feature-length documentary “Hated: GG Allin and the Murder Junkies” He is best known for directing the comedy films Road Trip, Old School, The Hangover, and Due Date.\n\nPhillips directed and produced the highest grossing R-Rated Comedy of all time “The Hangover” (2009), Its worldwide gross currently stands at $480 million dollars. The film won the Golden Globe for Best Picture as well as Best Comedy at the 2009 Broadcast Film Critics’ Awards. "
        },
        {
            "id": 73421,
            "name": "Joaquin Phoenix",
            "image": "/ls72wfQl8AhRVFeBnotmnAdy3JR.jpg",
            "birth_date": "1974-10-28",
            "biography": "Joaquin Rafael Phoenix (born October 28, 1974) is an American actor, producer, and animal rights activist. Known for playing dark and unconventional characters in independent film, he is the recipient of various accolades, including an Academy Award, a British Academy Film Award, a Grammy Award, and two Golden Globe Awards. In 2020, he was ranked 12th on the list of the 25 Greatest Actors of the 21st Century by The New York Times.\n\nBorn in Puerto Rico and raised in Los Angeles and Florida, Phoenix began his career by appearing in television series in the early 1980s with his brother River. His first major film roles were in SpaceCamp (1986) and Parenthood (1989). During this period, he was credited as Leaf Phoenix, a name he gave himself. He took back his birth first name in the early 1990s and received critical acclaim for his supporting roles in the comedy-drama film To Die For (1995) and the period film Quills (2000). Phoenix received further critical acclaim and first Academy Award and Golden Globe Award nominations for Best Actor in a Supporting Role for his portrayal of the evil emperor Commodus in the historical drama film Gladiator (2000). He had success with the horror films Signs (2002) and The Village (2004), the historical drama Hotel Rwanda (2004) and won a Grammy, a Golden Globe and a nomination for the Academy Award for Best Actor for his portrayal of musician Johnny Cash in the biopic Walk the Line (2005). He continued to receive acclaim in two features with his frequent director James Gray; the action thriller We Own the Night (2007) and the romantic drama Two Lovers (2008), before taking a break from acting.\n\nIn the 2010s, Phoenix returned to acting to critical acclaim. He starred in the psychological drama The Master (2012), winning the Volpi Cup for Best Actor and earning his third Academy Award nomination. He received Golden Globe nominations for his roles in the romantic drama Her (2013) and the crime satire Inherent Vice (2014) and won the Cannes Film Festival Award for Best Actor for his performance in the psychological thriller You Were Never Really Here (2017). Phoenix achieved international stardom and won an Academy Award, a British Academy Film Award, a Screen Actors Guild Award and a second Golden Globe Award for his portrayal of the title character in Joker (2019).\n\nPhoenix is an animal rights activist. He has been vegan since the age of three and regularly supports charitable causes and has produced several documentaries on global meat consumption and its impact on the environment. He is in a relationship with actress Rooney Mara, with whom he has a son."
        },
        {
            "id": 380,
            "name": "Robert De Niro",
            "image": "/cT8htcckIuyI1Lqwt1CvD02ynTh.jpg",
            "birth_date": "1943-08-17",
            "biography": "Robert Anthony De Niro (born August 17, 1943) is an American actor. Known for his collaborations with Martin Scorsese, he is considered to be one of the best actors of his generation. De Niro is the recipient of various accolades, including two Academy Awards, a Golden Globe Award, the Cecil B. DeMille Award, and a Screen Actors Guild Life Achievement Award. In 2009, De Niro received the Kennedy Center Honor, and earned a Presidential Medal of Freedom from U.S. President Barack Obama in 2016.\n\nDe Niro studied acting at HB Studio, Stella Adler Conservatory, and Lee Strasberg's Actors Studio. His first collaboration with Scorsese was with the 1973 film Mean Streets. De Niro earned two Academy Awards, one for Best Supporting Actor for his role as Vito Corleone in Francis Ford Coppola's The Godfather Part II (1974) and the other for Best Actor portraying Jake LaMotta in Scorsese's drama Raging Bull (1980). His other Oscar-nominated roles were for Taxi Driver (1976), The Deer Hunter (1978), Awakenings (1990), Cape Fear (1991), and Silver Linings Playbook (2012).\n\nOther notable roles include in 1900 (1976), The King of Comedy (1982), Once Upon a Time in America (1984), Brazil (1985), The Mission (1986), Goodfellas (1990), This Boy's Life (1993), Mary Shelley’s Frankenstein (1994), Heat (1995), Casino (1995), Jackie Brown (1997), The Good Shepherd (2006), Joker (2019), and The Irishman (2019). He made his directorial film debut with A Bronx Tale (1993). His comedic roles include Midnight Run (1988), Wag the Dog (1997), Analyze This (1999), the Meet the Parents films (2000-2010), and The Intern (2015).\n\nAlso known for his television roles, De Niro portrayed Bernie Madoff in the HBO film The Wizard of Lies (2017), earning a Primetime Emmy Award for Outstanding Lead Actor in a Limited Series or Movie nomination. He received further Emmy Award nominations for producing the Netflix limited series When They See Us (2019), and for portraying Robert Mueller on Saturday Night Live.[1]\n\nDe Niro and producer Jane Rosenthal founded the film and television production company TriBeCa Productions in 1989, which has produced several films alongside his own. Also with Rosenthal, he founded the Tribeca Film Festival in 2002. Six of De Niro's films have been inducted into the United States National Film Registry by the Library of Congress as \"culturally, historically, or aesthetically significant\"."
        },
        {
            "id": 1545693,
            "name": "Zazie Beetz",
            "image": "/sgxzT54GnvgeMnOZgpQQx9csAdd.jpg",
            "birth_date": "1991-06-01",
            "biography": "Zazie Olivia Beetz (born June 1, 1991) is a German-American actress. She stars in the FX comedy-drama series Atlanta (2016–2022), for which she received a nomination for the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series. She also appeared in the Netflix anthology series Easy (2016–19) and voices Amber Bennett in Amazon's animated superhero action series Invincible.\n\nIn film, Beetz has appeared in the disaster film Geostorm (2017) and has played the Marvel Comics character Domino in the superhero film Deadpool 2 (2018) and Arthur Fleck/Joker's neighbor Sophie in the psychological thriller Joker (2019)."
        },
        {
            "id": 4432,
            "name": "Frances Conroy",
            "image": "/aJRQAkO24L6bH8qkkE5Iv1nA3gf.jpg",
            "birth_date": "1953-03-15",
            "biography": "Frances Conroy (born March 15, 1953) is an American actress. She is most widely known for playing the matriarch Ruth O'Connor Fisher Sibley on the HBO funeral drama series Six Feet Under, which earned her a Golden Globe in 2004."
        },
        {
            "id": 16841,
            "name": "Brett Cullen",
            "image": "/4P6TsRcnr9MRbXlCdHitulGM5LT.jpg",
            "birth_date": "1956-08-26",
            "biography": "Peter Brett Cullen (born August 26, 1956) is an American actor who has appeared in numerous motion pictures and television programs. Early in 2007, he was cast as the role of an estranged father to one of the American football players, Tim Riggins (played by actor Taylor Kitsch), in the NBC drama series Friday Night Lights.\n\nCullen was born in Houston, Texas, the son of Lucien Hugh Cullen, an oil industry executive, and Catherine Cullen. He graduated from Madison High School in Houston in 1974. Cullen graduated from the University of Houston, giving great credit to his highly acclaimed acting mentor and University of Houston professor, Cecil Pickett, who also mentored such Houston born actors as Dennis Quaid, Randy Quaid, & Brent Spiner among others. Cullen and Dennis Quaid's close friendship to this day dates back to the 1970s and it is Cullen who introduced Dennis Quaid to his current wife, Kimberly Buffington at a dinner in Austin, Texas.\n\nCullen played Dan Fixx in the 1980s CBS drama Falcon Crest for two seasons (1986–1988) and Marshal Sam Cain in the ABC western series The Young Riders for one season (1989–1990). In 1980, he appeared as the second Gideon Chisholm in the last nine episodes of the CBS western miniseries The Chisholms. In the four earlier episodes, the Gideon Chisholm role was played by Brian Kerwin. Cullen was the lead actor as Ned Logan in the short-lived Legacy, which lasted for just one season (1998–1999). On the series The West Wing Cullen played Ray Sullivan, a fictional governor of West Virginia and the Republican nominee for Vice President.\n\nHis guest appearances on TV include: The Incredible Hulk, Tales from the Crypt, MAS*H, V, Matlock, Star Trek: Deep Space Nine, Ally McBeal, Walker, Texas Ranger, Once and Again, Without a Trace, Cold Case, The Mountain, Monk, CSI: Miami, NCIS, Desperate Housewives, Pepper Dennis, Lost, Ghost Whisperer, Private Practice, Ugly Betty, and Friday Night Lights. In 2009, he had a recurring role in the ABC Family television series Make It or Break It.\n\nHe has played two real-life astronauts, Jack Lousma in Apollo 13 (Brett is the CapCom at the time of the explosion; at that shift Lousma was the CapCom in real life) and David Scott in the HBO mini-series From the Earth to the Moon.\n\nHis most recent appearance was in the role of Barton Blaze in the movie Ghost Rider. Other movie credits include Wyatt Earp (with Kevin Costner), Gambler V: Playing for Keeps (with Kenny Rogers and Bruce Boxleitner), Something to Talk About (with Julia Roberts and Dennis Quaid), The Replacements (with Gene Hackman), On Golden Pond (with Julie Andrews and Christopher Plummer), Nancy Drew, and Gridiron Gang. He also played Bob Cleary in the 1983 mini-series The Thorn Birds.\n\nCullen was recently cast in the up-coming femme comedy Monte Carlo alongside Selena Gomez, Andie MacDowell and Leighton Meester and is playing the role of Tom Eckert in the upcoming war film Red Dawn.\n\nOn February 8, 2011, Brett was named the official spokesman for Houston Works which helps Houston residents with job training and placement, scholarships, consulting, technical initiatives focusing on science, technology, engineering and mathematics and summer job programs along with Youth Summits.\n\n​From Wikipedia, the free encyclopedia"
        },
        {
            "id": 74242,
            "name": "Shea Whigham",
            "image": "/d3caK3l4UfbnzOxv95wLoFLZzMO.jpg",
            "birth_date": "1969-01-05",
            "biography": "Franklin Shea Whigham Jr. (born January 5, 1969) is an American actor. He portrayed Elias \"Eli\" Thompson in the HBO drama series Boardwalk Empire, and had notable supporting roles in films Kong: Skull Island, Death Note, Take Shelter, and the first season of True Detective, the third season of Fargo, and Joker. He appeared as Agent Michael Stasiak in Fast & Furious and Fast & Furious 6.  In 2020 he was cast as Pete Strickland on HBO's reimagining of Perry Mason, a role for which he received attention for his moustache."
        },
        {
            "id": 116805,
            "name": "Paul Feig",
            "image": "/lcD0BkGKWKynUwtPSEDLAsFdIJX.jpg",
            "birth_date": "1962-09-17",
            "biography": "Paul S. Feig is an American director, actor and author. Feig is known for playing Mr. Eugene Pool, Sabrina's science teacher, on the first season of Sabrina, the Teenage Witch. Feig also created the critically acclaimed show, Freaks and Geeks and has directed a several episodes of The Office and Arrested Development; plus select episodes of 30 Rock, Parks and Recreation, Mad Men and other television series. Feig has been nominated for two Emmy Awards for writing on Freaks and Geeks and three for directing on The Office. Feig directed the 2011 film Bridesmaids featuring Kristen Wiig."
        },
        {
            "id": 41091,
            "name": "Kristen Wiig",
            "image": "/N517EQh7j4mNl3BStMmjMN6hId.jpg",
            "birth_date": "1973-08-22",
            "biography": "Kristen Carroll Wiig (born August 22, 1973) is an American actress, voice actress, writer, producer, and comedian. She is known for her work as a cast member on Saturday Night Live from 2005 to 2012. She is a member of improvisational comedy troupe The Groundlings.\n\nShe had recurring roles on Arrested Development, The Spoils of Babylon, The Spoils Before Dying, and the series MacGruber (2021) on Paramount+. She's also appeared in television series including Flight of the Conchords, 30 Rock and Portlandia.\n\nShe's also appeared in several films including Knocked Up, The Brothers Solomon, Walk Hard: The Dewey Cox Story, Whip It, Extract, Date Night, Adventureland, MacGruber, Bridesmaids, All Good Things, Friends with Kids, Girl Most Likely, The Secret Life of Walter Mitty, The Skeleton Twins, The Martian, Ghostbusters (2016), Downsizing, Wonder Woman 1984, and Barb and Star Go to Vista Del Mar.\n\nShe is the voice of Ruffnut Thorston in the film series How to Train Your Dragon, Miss Hattie and Lucy Wilde in the film series Despicable Me, Lola Bunny in The Looney Tunes Show, and Jenny Hart in Bless the Harts."
        },
        {
            "id": 55536,
            "name": "Melissa McCarthy",
            "image": "/yl0qva0O4u92fvtItakdvKmKrW9.jpg",
            "birth_date": "1970-08-26",
            "biography": "Melissa Ann McCarthy (born August 26, 1970) is an American actress, comedian, producer, writer, and fashion designer. She is the recipient of numerous accolades, including two Primetime Emmy Awards, and nominations for two Academy Awards and two Golden Globe Awards. McCarthy was named by Time as one of the 100 most influential people in the world in 2016, and she has been featured multiple times in annual rankings of the highest-paid actresses in the world. In 2020, The New York Times ranked her #22 in its list of the 25 Greatest Actors of the 21st Century.\n\nMcCarthy began appearing in television and film in the late 1990s and first gained recognition for her role as Sookie St. James on the television series Gilmore Girls (2000–2007). She played Dena on the ABC sitcom Samantha Who? (2007–2009) before starring as Molly Flynn on the CBS sitcom Mike & Molly (2010–2016), for which she received the Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series in 2011. McCarthy's appearances as a host on Saturday Night Live led to a win for the Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series in 2017.\n\nMcCarthy gained critical acclaim for her performance in the comedy film Bridesmaids (2011), receiving a nomination for the Academy Award for Best Supporting Actress. She went on to star in several commercially successful comedies, including Identity Thief (2013), The Heat (2013), Tammy (2014), St. Vincent (2014), Spy (2015), and The Boss (2016). In 2018, McCarthy received critical acclaim for her portrayal of writer Lee Israel in the biographical film Can You Ever Forgive Me? (2018), earning a nomination for the Academy Award for Best Actress.\n\nMcCarthy and her husband Ben Falcone are the founders of the production company On the Day Productions, under which they have collaborated on several comedy films. In 2015, she launched her own clothing line for plus-sized women, named Melissa McCarthy Seven7, and she received a motion picture star on the Hollywood Walk of Fame."
        },
        {
            "id": 1240487,
            "name": "Kate McKinnon",
            "image": "/2cNetzianFcxPQbyOQnkAIkKUZE.jpg",
            "birth_date": "1984-01-06",
            "biography": "Kate McKinnon Berthold (born January 6, 1984) is an American actress, comedian, impressionist, and writer. She was a cast member on the NBC sketch comedy series Saturday Night Live from 2012 to 2022, where she became known for her character work and celebrity impressions. For her work on the series, she was nominated for ten Primetime Emmy Awards, including one for Outstanding Original Music and Lyrics and nine for Outstanding Supporting Actress in a Comedy Series, winning in 2016 and 2017.\n\nMcKinnon starred in the Logo sketch comedy series The Big Gay Sketch Show (2007–2010), voiced lead roles in the PBS Kids animated series Nature Cat (2015–present) and the Netflix animated series The Magic School Bus Rides Again (2017–2021), and portrayed Carole Baskin in the Peacock miniseries Joe vs. Carole (2022).\n\nMcKinnon has also appeared in numerous films, such as Balls Out (2014), Ghostbusters (2016), Office Christmas Party (2016), Rough Night (2017), The Spy Who Dumped Me (2018), Yesterday (2019), Bombshell (2019), DC League of Super-Pets (2022), and Barbie (2023).\n\nDescription above from the Wikipedia article Kate McKinnon, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 168452,
            "name": "Leslie Jones",
            "image": "/1rBpNNijHRg4Ha3PxlpOjcbPVeN.jpg",
            "birth_date": "1967-09-07",
            "biography": "Annette 'Leslie' Jones (born September 7, 1967) is an American stand-up comedian, actress, writer, singer, and game show host. She was a cast member and writer for the NBC sketch comedy series Saturday Night Live from 2014 to 2019. In 2017 and 2018, she was nominated for a Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series for her work on Saturday Night Live.\n\nIn 2010, her one-hour comedy special, Problem Child, was broadcast on Showtime, and in 2020, she had another special, Time Machine. She starred as Patty Tolan in Ghostbusters (2016) and Mary Junson in Coming 2 America."
        },
        {
            "id": 74568,
            "name": "Chris Hemsworth",
            "image": "/sHXk9abohi7eZxgB5naYNYAuepG.jpg",
            "birth_date": "1983-08-11",
            "biography": "Chris Hemsworth (born 11 August 1983) is an Australian actor. He is best known for his roles as Kim Hyde in the Australian TV series Home and Away (2004) and as Thor in the Marvel Cinematic Universe films Thor (2011), The Avengers (2012), Thor: The Dark World (2013), Avengers: Age of Ultron (2015), Thor: Ragnarok (2017), Avengers: Infinity War (2018), Avengers: Endgame (2019), and Thor: Love and Thunder (2022). He has also appeared in the science fiction action film Star Trek (2009), the thriller adventure A Perfect Getaway (2009), the horror comedy The Cabin in the Woods (2012), the dark fantasy action film Snow White and the Huntsman (2012), the war film Red Dawn (2012) and the biographical sports drama film Rush (2013).\n\nDescription above from the Wikipedia article Chris Hemsworth, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 1267216,
            "name": "Neil Casey",
            "image": "/xuoT9GT77FZCmvNxKZTlEYIkkuz.jpg",
            "birth_date": "1981-07-28",
            "biography": "Neil Casey (born July 28, 1981) is an American actor, writer, and comedian. He served as a writer on Saturday Night Live from 2012 to 2013 and Inside Amy Schumer in 2014, receiving Primetime Emmy Award nominations for Outstanding Writing for a Variety Series for both shows. As an actor, he was a series regular on the comedies Other Space (2015) and Making History (2017). Casey also appeared in the 2016 reboot of Ghostbusters."
        },
        {
            "id": 366,
            "name": "James Mangold",
            "image": "/pk0GDjn99crNwR4qgCCEokDYd71.jpg",
            "birth_date": "1963-12-16",
            "biography": "James Allen Mangold (born December 16, 1963) is an American film director, producer and screenwriter. Noted for his versatility in tackling a range of genres, Mangold made his debut as a film director with Heavy (1995), and is best known for the films Cop Land (1997), Girl, Interrupted (1999), Identity (2003), Walk the Line (2005), 3:10 to Yuma (2007), and two films in the X-Men franchise with The Wolverine (2013) and Logan (2017), the latter of which earned him a nomination for the Academy Award for Best Adapted Screenplay. He then directed the sports drama film Ford v Ferrari (2019), which earned him a nomination for the Academy Award for Best Picture, and directed and co-wrote Indiana Jones and the Dial of Destiny (2023), the fifth and final installment in the Indiana Jones series."
        },
        {
            "id": 6968,
            "name": "Hugh Jackman",
            "image": "/4Xujtewxqt6aU0Y81tsS9gkjizk.jpg",
            "birth_date": "1968-10-12",
            "biography": "Hugh Michael Jackman (born 12 October 1968) is an Australian actor. Beginning in theatre and television, he landed his breakthrough role as Wolverine / Logan in the X-Men film series (2000–2017), a tenure that earned him the Guinness World Record for \"longest career as a live-action Marvel superhero\". Jackman has received a Grammy Award, a Primetime Emmy Award, and two Tony Awards. During his career, Jackman has headlined films in various genres, including the romantic comedy Kate & Leopold (2001), the action-horror Van Helsing (2004), the drama The Prestige (2006), the period romance Australia (2008), the epic musical Les Misérables (2012), the thriller Prisoners (2013), the musical The Greatest Showman (2017), the political drama The Front Runner (2018), and the crime thriller Bad Education (2019). For his role as Jean Valjean in Les Misérables, Jackman was nominated for the Academy Award for Best Actor and won the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy, and for The Greatest Showman, he received a Grammy Award for Best Soundtrack Album. He also provided voice roles in the animated films Flushed Away (2006), Rise of the Guardians (2012), and Missing Link (2019). Jackman is also known for his early theatre roles in Oklahoma! in 1998 and Carousel in 2002. On Broadway, Jackman won the 2004 Tony Award for Best Actor in a Musical for his role in The Boy from Oz. In 2021 he returned to the theatre as Harold Hill in the Broadway revival of The Music Man. A four-time host of the Tony Awards, he won an Emmy Award for hosting the 2005 ceremony. He also hosted the 81st Academy Awards in 2009. Jackman was appointed a Companion of the Order of Australia in the 2019 Queen's Birthday Honours for services to performing arts and to the global community."
        },
        {
            "id": 1464650,
            "name": "Dafne Keen",
            "image": "/vohccdHmJHNZX9UIcRlmZ4Qwkj.jpg",
            "birth_date": "2005-01-04",
            "biography": "Dafne María Keen Fernández (born 4 January 2005) is a British-Spanish actress. She made her debut starring as Ana \"Ani\" Cruz Oliver on the television series The Refugees from 2014 to 2015, before her breakthrough starring as Laura in the 2017 superhero film Logan, in which she received widespread critical acclaim for her acting. She received several awards, including an Empire Award for Best Newcomer, and nominations for a Critics' Choice Award and a Saturn Award. In 2019, she began starring as Lyra Belacqua in the television series His Dark Materials, for which she was nominated for a BAFTA Cymru."
        },
        {
            "id": 2387,
            "name": "Patrick Stewart",
            "image": "/3yExCGqCMfSOVVHdEYTJhXaTtFZ.jpg",
            "birth_date": "1940-07-13",
            "biography": "An English film, television and stage actor. He has had a distinguished career in theatre and television for around half a century. He is most widely known for his television and film roles, as Captain Jean-Luc Picard in Star Trek: The Next Generation and as Professor Charles Xavier in the X-Men films. Stewart was born in Mirfield near Dewsbury in the West Riding of Yorkshire, England, the son of Gladys, a weaver and textile worker, and Alfred Stewart, a Regimental Sergeant Major in the British Army who served with the King's Own Yorkshire Light Infantry and previously worked as a general labourer and as a postman. Stewart and his first wife, Sheila Falconer, have two children: Daniel Freedom and Sophie Alexandra. Stewart and Falconer divorced in 1990. In 1997, he became engaged to Wendy Neuss, one of the producers of Star Trek: The Next Generation, and they married on 25 August 2000, divorcing three years later. Four months prior to his divorce from Neuss, Stewart played opposite actress Lisa Dillon in a production of The Master Builder. The two dated for four years, but are no longer together. He is now seeing Sunny Ozell; at 31, she is younger than his daughter. \"I just don't meet women of my age,\" he explains. Stewart has been a prolific actor in performances by the Royal Shakespeare Company, appearing in over 60 productions."
        },
        {
            "id": 65421,
            "name": "Elizabeth Rodriguez",
            "image": "/oHmuDi1zl92wiups2IPfMeBp3a2.jpg",
            "birth_date": "1980-12-27",
            "biography": "Elizabeth Rodriguez is an American actress, best known for her role as Aleida Diaz in the Netflix comedy-drama series Orange Is the New Black.\n\nAfter graduation from Lehman College, Rodriguez studied for two years under acclaimed acting teacher Maggie Flanigan at William Esper Studios in NYC. While still at the studio, she began working professionally with appearances in feature films including Fresh, Dead Presidents, and I Think I Do, as well as in TV shows such as Law & Order, and recurring roles on both OZ and New York Undercover.\n\nRodriguez has since appeared in numerous shows, including a recurring role as Aleida Diaz on the Netflix Original series Orange Is The New Black. Other TV credits include roles as series regulars on both NBC's Prime Suspect, opposite Maria Bello, and ABC's All My Children, in addition to recurring roles on The Shield and ER. Other credits include Six Feet Under, FlashForward, Cold Case, Just Shoot Me, NYPD Blue and Law & Order: SVU.\n\nHer made-for-TV movies include Inflammable and The Eddie Matos Story, written by Oscar nominated writer Jose Rivera. Some of her feature films include Return to Paradise, Four Lane Highway, Acts of Worship, Blow, All Things Fall Apart, Pound Of Flesh, Tonight at Noon, A Line in the Sand, Jack Goes Boating directed by Philip Seymour Hoffman, and Michael Mann's Miami Vice, opposite Colin Farrell and Jamie Foxx, Tio Papi, Glass Chin, and Animal Rescue with Tom Hardy and James Gandolfini.\n\nIn addition to her work on screen, Rodriguez remains extremely active in the theater. She has starred in Beauty of the Father (Manhattan Theatre Club), The Last Days of Judas Iscariot (NY's Public Theater), Roger and Vanessa (Actors' Gang), Den of Thieves (Black Dahlia), Robbers (American Place Theater), A View From 151st Street (NY's Public Theater) and Unconditional (NY's Public Theater). Rodriguez is a longtime member of NY's acclaimed Labyrinth Theater Company."
        },
        {
            "id": 467645,
            "name": "Boyd Holbrook",
            "image": "/fQkDOLXx15ekg9LP5Qhlikqq0wp.jpg",
            "birth_date": "1981-09-01",
            "biography": "Robert Boyd Holbrook (born September 1, 1981) is an American actor. He has starred in the Netflix series Narcos (2015–2016) as DEA agent Steve Murphy and The Sandman (2022–) as the Corinthian, as well as in the History miniseries Hatfields & McCoys as \"Cap\" Hatfield. He starred as Billy in The Skeleton Twins (2014), Peter Kristo in A Walk Among the Tombstones (2014), Donald Pierce in Logan (2017), Quinn McKenna in The Predator (2018), Thomas Lockhart in In the Shadow of the Moon (2019), Ty Shaw in Vengeance (2022), and Klaber in the adventure film Indiana Jones and the Dial of Destiny (2023)."
        },
        {
            "id": 39189,
            "name": "Stephen Merchant",
            "image": "/6WM2rK6390Nwk398syJbGcPvRct.jpg",
            "birth_date": "1974-11-24",
            "biography": "Stephen Merchant is a British writer, director, radio presenter, stand-up comedian, and actor, best known for his work on The Office, Extras, and The Ricky Gervais Show."
        },
        {
            "id": 53068,
            "name": "Ryan Fleck",
            "image": "/28EMTivPGStNxDivgUP8PSpOrof.jpg",
            "birth_date": "1976-09-20",
            "biography": "Ryan K. Fleck (born September 20, 1976) is an American film director, cinematographer, editor, and screenwriter best known for directing and writing the 2006 film Half Nelson and the 2008 film Sugar. He is known for his collaborations with fellow filmmaker Anna Boden.\n\nDescription above from the Wikipedia article Ryan Fleck, licensed under CC-BY-SA, full list of contributors on Wikipedia.​"
        },
        {
            "id": 60073,
            "name": "Brie Larson",
            "image": "/nOoqQouupZaaa959wLZR01n2xmW.jpg",
            "birth_date": "1989-10-01",
            "biography": "Brie Larson (born Brianne Sidonie Desaulniers; October 1, 1989), is an American actress and filmmaker. She's best known for her role as Carol Danvers / Captain Marvel in Captain Marvel (2019) and reprise her role in other MCU films and series. She's also known for her roles as Elizabeth Zott in the miniseries Lessons in Chemistry (which she also executive produced), Tess in Fast X, Eva Ansley in Just Mercy, Jeannette Walls in The Glass Castle, Mason Weaver in Kong: Skull Island, Joy \"Ma\" Newsome in Room, Kim Townsend in Trainwreck, Amy Phillips in The Gambler, Monica Martello in Don Jon, Cassidy Roy in The Spectacular Now, Molly Tracey in 21 Jump Street, Helen in Rampart, Envy Adams in Scott Pilgrim vs. the World, Kate Gregson on Showtime's United States of Tara, Beatrice \"The Bear\" Leep in Hoot, and Emily Stewart on WB's sitcom Raising Dad.\n\nShe appeared as a regular in the 2001 sitcom Raising Dad and briefly dabbled with a music career, releasing the album Finally Out of P.E. in 2005. She played supporting roles in the comedy films 13 Going on 30 (2004), Hoot (2006), Scott Pilgrim vs. the World (2010), and 21 Jump Street (2012), and appeared as a sardonic teenager in the television series United States of Tara (2009–2011).\n\nHer breakthrough came with a leading role in the acclaimed independent drama Short Term 12 (2013), and she continued to take on supporting parts in the romance The Spectacular Now (2013) and the comedy Trainwreck (2015). For playing a kidnapping victim in the drama Room (2015), she won the Academy Award for Best Actress.\n\nThe 2017 adventure film Kong: Skull Island marked her first big-budget release, followed by Free Fire, The Glass Castle, Unicorn Store, and Basmati Blues, the same year. She then starred as Carol Danvers / Captain Marvel in the 2019 Marvel Cinematic Universe superhero film Captain Marvel. She reprised her role in other MCU films including Avengers: Endgame, Shang-Chi and the Legend of the Ten Rings, Avengers: Quantum Encounter, and The Marvels, as well as in the series Ms. Marvel. She then starred in and executive produced the comedy-drama Apple TV+ miniseries Lessons in Chemistry (2023). She also starred in Fast X (2023).\n\nShe has co-written and co-directed two short films, and made her feature film directorial debut with the independent comedy-drama Unicorn Store (2017). For producing the virtual reality series The Messy Truth VR Experience (2020), she won a Primetime Emmy Award."
        },
        {
            "id": 2231,
            "name": "Samuel L. Jackson",
            "image": "/nCJJ3NVksYNxIzEHcyC1XziwPVj.jpg",
            "birth_date": "1948-12-21",
            "biography": "Samuel Leroy Jackson (born December 21, 1948) is an American actor and producer. One of the most widely recognized actors of his generation, the films in which he has appeared have collectively grossed over $27 billion worldwide, making him the second highest-grossing actor of all time. The Academy of Motion Picture Arts and Sciences gave him an Academy Honorary Award in 2022 as \"A cultural icon whose dynamic work has resonated across genres and generations and audiences worldwide\".\n\nJackson started his career on stage making his professional theatre debut in Mother Courage and her Children in 1980 at The Public Theatre. From 1981 to 1983 he originated the role of Private Louis Henderson in A Soldier's Play Off-Broadway. He also originated the role of Boy Willie in August Wilson's The Piano Lesson in 1987 at the Yale Repertory Theatre. He returned to the play in the 2022 Broadway revival playing Doaker Charles. Jackson early film roles include Coming to America (1988), Goodfellas (1990), Patriot Games (1992), Juice (1992), True Romance (1993), and Jurassic Park (1993), Menace II Society (1993), and Fresh (1994). His collaborations with Spike Lee led to greater prominence with films such as School Daze (1988), Do the Right Thing (1989), Mo' Better Blues (1990), Jungle Fever (1991), Oldboy (2013), and Chi-Raq (2015).\n\nJackson's breakout role was in Quentin Tarantino's Pulp Fiction (1994) which earned him a BAFTA Award win and a nomination for the Academy Award for Best Supporting Actor. He further collaborated with Tarantino, acting in Jackie Brown (1997), Django Unchained (2012), and The Hateful Eight (2015). He's known for having appeared in a number of big-budget films, including Die Hard with a Vengeance (1995), A Time to Kill (1996), The Long Kiss Goodnight (1996), The Negotiator (1997), Deep Blue Sea (1999), Unbreakable (2000), Shaft (2000) and its reboot (2019), XXX (2002), S.W.A.T. (2003), Coach Carter (2005), Snakes on a Plane (2006), Kingsman: The Secret Service (2014), Kong: Skull Island (2017), and Glass (2019).\n\nHe also gained widespread recognition as the Jedi Mace Windu in the Star Wars prequel trilogy (1999–2005), later voicing the role in the animated film Star Wars: The Clone Wars (2008) and the video game Lego Star Wars: The Clone Wars (2011). With his permission, his likeness was used for the Ultimate version of the Marvel Comics character Nick Fury; he subsequently played Fury in 11 Marvel Cinematic Universe films, beginning with a cameo appearance in Iron Man (2008), as well as guest-starring in the television series Agents of S.H.I.E.L.D. He will reprise this role in the upcoming Disney+ series Secret Invasion, which is set to premiere on June 21, 2023. Jackson has provided his voice for several animated films, documentaries, television series, and video games, including Lucius Best / Frozone in the Pixar films The Incredibles (2004) and Incredibles 2 (2018)."
        },
        {
            "id": 77335,
            "name": "Ben Mendelsohn",
            "image": "/pA9mu9D2IolVA0v2Yo0tJm6uUyI.jpg",
            "birth_date": "1969-04-03",
            "biography": "Paul Benjamin Mendelsohn (born April 3, 1969) is an Australian actor. He first rose to prominence in Australia for his breakout role in The Year My Voice Broke (1987) and since then he has had roles in films such as Animal Kingdom (2010), The Dark Knight Rises (2012), Starred Up (2013), Mississippi Grind (2015), Rogue One (2016), Darkest Hour (2017) and Steven Spielberg's Ready Player One (2018). In 2017, he joined the Marvel Cinematic Universe as Talos in Captain Marvel (2019) and Spider-Man: Far From Home (2019). He reprised his role as Talos in the Disney+ series Secret Invasion (2023) for 4 episodes.\n\nMendelsohn starred in the Netflix original series Bloodline (2015–2017), for which he won the Primetime Emmy Award for Outstanding Supporting Actor in a Drama Series in 2016. In 2020, Mendelsohn starred in the HBO crime miniseries The Outsider."
        },
        {
            "id": 9642,
            "name": "Jude Law",
            "image": "/6E8ixknAt2RD6ZmdZVNY8w6oRqJ.jpg",
            "birth_date": "1972-12-29",
            "biography": "David Jude Heyworth Law (born December 29, 1972) is an English actor. He has received multiple awards including a BAFTA Film Award as well as nominations for two Academy Awards and two Tony Awards. In 2007, he received an Honorary César and was named a knight of the Order of Arts and Letters by the French government.\n\nBorn and raised in London, Law started acting in theatre. After finding small roles in feature films, Law gained recognition for his role in Anthony Minghella's The Talented Mr. Ripley (1999), for which he won the BAFTA Award for Best Actor in a Supporting Role and was nominated for an Academy Award. He found further critical and commercial success in Enemy at the Gates (2001), Steven Spielberg's A.I. Artificial Intelligence (2001) and Sam Mendes' Road to Perdition (2002). He continued to gain praise for starring in the war film Cold Mountain (2003), the drama Closer (2004), and the romantic comedy The Holiday (2006), gaining Academy Award and BAFTA nominations for the first of these.\n\nLaw played Dr. Watson in Sherlock Holmes (2009) and Sherlock Holmes: A Game of Shadows (2011), a younger Albus Dumbledore in Fantastic Beasts: The Crimes of Grindelwald (2018), and Yon-Rogg in Captain Marvel (2019); all of which rank among his highest-grossing releases. His other notable roles were in Contagion (2011), Hugo (2011), Side Effects (2013), The Grand Budapest Hotel (2014), and Spy (2015); and the television series The Young Pope (2016) and The New Pope (2020).\n\nLaw has also had an accomplished career on stage, performing in several West End and Broadway productions such as Les Parents terribles in 1994, Hamlet in 2010, and Anna Christie in 2011. He received Tony Award nominations for the first and second of these.\n\nLaw's Riff Raff Entertainment, founded with business partner Ben Jackson, inked a first-look deal for both feature films and television production with New Republic Pictures on April 13, 2021."
        },
        {
            "id": 516,
            "name": "Annette Bening",
            "image": "/sBiiRwAVXd0FCRZ87m0I89qGBvy.jpg",
            "birth_date": "1958-05-29",
            "biography": "Annette Carol Bening (born May 29, 1958) is an American actress. In a career spanning more than four decades, she has received many accolades, including a BAFTA Award and two Golden Globes as well as nominations for a Primetime Emmy Award, two Tony Awards, and five Academy Awards.\n\nBening began her career on stage with the Colorado Shakespeare Festival company in 1980, and played Lady Macbeth in 1984 at the American Conservatory Theater. She made her Broadway debut in the Tina Howe play Coastal Disturbances (1987) for which she received a nomination for the Tony Award for Best Featured Actress in a Play. She played the title role in a Geffen Playhouse production of Hedda Gabler (1999). She returned to Broadway in the revival of Arthur Miller's All My Sons (2019) earning another Tony nomination for Best Actress in a Play.\n\nBening won the BAFTA Award for Best Actress in a Leading Role for playing a materialistic wife in American Beauty (1999), and received nominations for five Academy Awards for her roles in The Grifters (1990), American Beauty, Being Julia (2004), The Kids Are All Right (2010), and Nyad (2023). She was nominated for a Primetime Emmy Award for playing the title role in the television film Mrs. Harris (2005). Her other notable films include Postcards from the Edge (1990), Bugsy (1991), Richard III (1995), The American President (1995), 20th Century Women (2016), Film Stars Don't Die in Liverpool (2017), The Seagull (2018), The Report (2019), Captain Marvel (2019), and Death on the Nile (2022).\n\nDescription above from the Wikipedia article Annette Bening, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 938,
            "name": "Djimon Hounsou",
            "image": "/8BpM0SSdRJdMMl3vRqrk2LUICxH.jpg",
            "birth_date": "1964-04-24",
            "biography": "Djimon Gaston Hounsou (born April 24, 1964) is a Beninese-American actor and model. He began his career appearing in music videos, made his film debut in Without You I'm Nothing and earned widespread recognition for his role as Cinqué in the Steven Spielberg film Amistad. As an actor, Hounsou has been nominated for two Academy Awards.\n\nHounsou became a naturalized American citizen in 2007. He was reluctant to renounce his Beninese citizenship and therefore opted to become a dual citizen of both Benin and the United States, effectively rendering him a Beninese-American.\n\nDjimon Hounsou was born in Cotonou, Benin, in 1964, to lbertine and Pierre Hounsou. He immigrated to Lyon in France at the age of thirteen with his brother, Edmond. In 1987, he became a model and established a career in Paris. He moved to the U.S. in 1990. One year before obtaining his college degree, he dropped out of school.\n\nIn 1989, he appeared in a music video of Straight Up by Paula Abdul. Hounsou's film debut was in the 1990 Sandra Bernhard film Without You I’m Nothing, and he has had television roles on Beverly Hills, 90210 and ER and a guest starring role on Alias, but received a larger role in the science fiction film Stargate. His first on-screen appearance was in the 1990 Janet Jackson video “Love Will Never Do (Without You).” He also starred in a 2002 Gap commercial directed by Peter Lindbergh, dancing to a rendition of John Lee Hooker's \"Boom Boom\" by Arrested Development's Baba Oje.\n\nHe received wide critical acclaim and a Golden Globe Award nomination for his role as Cinqué in the 1997 Steven Spielberg film Amistad. He gained further notice as Juba, in the 2000 film Gladiator. He was nominated for the Academy Award for Best Supporting Actor, for In America, in 2004, becoming the fourth African male to be nominated for an Oscar (along with Basil Rathbone, Cecil Kellaway and Omar Sharif). In 2006, he won the National Board of Review Award for Best Supporting Actor for his performance in Blood Diamond; he received Broadcast Film Critics Association, Screen Actors Guild Award, and Academy Award nominations for this performance.\n\nIn 2007, Hounsou began dating model/CEO of Baby Phat, Kimora Lee Simmons. In 2008 Hounsou and Simmons visited Hounsou's family and while there, the two participated in a traditional commitment ceremony. On May 30, 2009, Simmons gave birth to their son, Kenzo Lee Hounsou, reportedly named because Kenzo means 3 (Kimora's third child)."
        },
        {
            "id": 11092,
            "name": "Simon Kinberg",
            "image": "/3xvTvkIaKfU276cpajiAoGjvaaO.jpg",
            "birth_date": "1973-08-02",
            "biography": "Simon David Kinberg (born August 2, 1973) is a British-born American filmmaker. He wrote or produced a number of films in the 20th Century Fox X-Men film franchise,and has also written such films as Mr. & Mrs. Smith and Sherlock Holmes. He has served as a producer on others including Cinderella and The Martian, the latter which was nominated for the Academy Award for Best Picture. His production company Genre Films had a first-look deal with 20th Century Fox. Kinberg made his directorial debut in the 2019 X-Men film Dark Phoenix from a script he also wrote."
        },
        {
            "id": 1001657,
            "name": "Sophie Turner",
            "image": "/8ur4aHFakVCinWk0cvrGO8qAUhv.jpg",
            "birth_date": "1996-02-21",
            "biography": "Sophie Belinda Jonas (née Turner; born 21 February 1996) is an English actress. She made her acting debut as Sansa Stark on the HBO epic fantasy television series Game of Thrones (2011–2019), for which she received a Primetime Emmy Award nomination for the Outstanding Supporting Actress in a Drama Series in 2019.\n\nTurner appeared in the television film The Thirteenth Tale (2013) and made her feature film debut in Another Me (2013). She appeared in the action comedy Barely Lethal (2015) and portrayed a young Jean Grey / Phoenix in the X-Men film series (2016–2019)."
        },
        {
            "id": 5530,
            "name": "James McAvoy",
            "image": "/vB6qYlFXgONGVwwxWXE4gf0F8SQ.jpg",
            "birth_date": "1979-04-21",
            "biography": "James McAvoy (born 21 April 1979) is a Scottish actor. He made his acting debut as a teen in The Near Room (1995) and appeared mostly on television until 2003, when his feature film career began. His notable television work includes the thriller State of Play, science fiction miniseries Frank Herbert's Children of Dune and the channel 4s BAFTA award-winning series Shameless (British TV series)\n\nHe has performed in several West End productions and has received four nominations for the Laurence Olivier Award for Best Actor, and has also done voice work for animated films including Gnomeo & Juliet, its sequel Sherlock Gnomes, and Arthur Christmas.\n\nIn 2003, McAvoy appeared in a lead role in Bollywood Queen, then in another lead role as Rory in Inside I'm Dancing in 2004. This was followed by a supporting role, as the faun Mr. Tumnus, in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005). His performance in Kevin Macdonald's drama The Last King of Scotland (2006) garnered him several award nominations, including the BAFTA Award for Best Supporting Actor. The critically acclaimed romantic drama war film Atonement (2007) earned him a Golden Globe Award nomination and his second BAFTA nomination. He later appeared as a newly trained assassin in the action thriller Wanted (2008).\n\nIn 2011, McAvoy portrayed Professor Charles Xavier in the superhero film X-Men: First Class, a role he reprised in X-Men: Days of Future Past (2014), X-Men: Apocalypse (2016), Deadpool 2 (2018), and Dark Phoenix (2019). McAvoy starred in the crime comedy-drama film Filth (2013), for which he won Best Actor in the British Independent Film Awards. In 2016, he portrayed Kevin Wendell Crumb, a man with 23 alternate personalities, in M. Night Shyamalan's Split, for which he received critical acclaim, and later reprised the role for the sequel Glass (2019). Since 2019, he has portrayed Lord Asriel Belacqua in the BBC/HBO fantasy series His Dark Materials."
        },
        {
            "id": 3292,
            "name": "Nicholas Hoult",
            "image": "/laeAYQVBV9U3DkJ1B4Cn1XhpT8P.jpg",
            "birth_date": "1989-12-07",
            "biography": "Nicholas Caradoc Hoult (born December 7, 1989) is an English actor. His body of work includes supporting work in big-budget mainstream productions and starring roles in independent projects in both the American and the British film industries. He has been nominated for awards such as a British Academy Film Award, a Golden Globe Award, and a Screen Actors Guild Award.\n\nBorn and raised in Wokingham, Berkshire, Hoult was drawn to acting from a young age and appeared in local theatre productions as a child. He made his screen debut at age seven in the 1996 film Intimate Relations, and appeared in several television programmes between 1998 and 2001. Hoult's breakthrough role came when he played Marcus Brewer in the 2002 comedy-drama film About a Boy, for which he was nominated for the Critics' Choice Movie Award for Best Young Performer. He achieved wider recognition and praise for his performance as Tony Stonem in the E4 teen comedy-drama series Skins (2007–2008). His transition to adult roles began with the 2009 drama film A Single Man, for which he earned a BAFTA Rising Star Award nomination, and the fantasy film Clash of the Titans (2010). He was cast as the mutant Hank McCoy in Matthew Vaughn's 2011 superhero film X-Men: First Class, a role he reprised in later instalments of the series.\n\nIn 2013, Hoult played the lead title role in the fantasy adaptation Jack the Giant Slayer and starred as a zombie in romantic comedy Warm Bodies. Following a supporting role in Mad Max: Fury Road (2015), Hoult starred in a number of independent films before portraying various real-life figures such as Robert Harley, Earl of Oxford in the historical black comedy The Favourite (2018), writer J. R. R. Tolkien in Tolkien (2019), and Peter III in the Hulu comedy-drama series The Great (2020–present). In 2021, he starred in the survival thriller Those Who Wish Me Dead."
        },
        {
            "id": 1034681,
            "name": "Tye Sheridan",
            "image": "/A2QZhszh0o9lDygHE3mphhgyVxI.jpg",
            "birth_date": "1996-11-11",
            "biography": "Tye Kayle Sheridan (born November 11, 1996) is an American actor and producer. He is best known for playing the young Scott Summers / Cyclops in the reboot X-Men film series (2016–2019), as well as Wade Watts in Ready Player One (2018) and Ben Goudy in Scouts Guide to the Zombie Apocalypse (2015). Sheridan made his feature film debut in Terrence Malick's experimental drama film The Tree of Life (2011) and had his first leading role in Jeff Nichols's film Mud (2012). He also co-starred in David Gordon Green's drama Joe (2013) and the period thriller The Stanford Prison Experiment (2015). In 2020 he co-founded AI production tools company Wonder Dynamics with visual effects artist Nikola Todorovic."
        },
        {
            "id": 17288,
            "name": "Michael Fassbender",
            "image": "/xvbnUiB2ZBR3QIt595OzNy657Vw.jpg",
            "birth_date": "1977-04-02",
            "biography": "Michael Fassbender (born 2 April 1977) is an Irish actor. He is the recipient of various accolades, including a Screen Actors Guild Award, a Critics' Choice Movie Award, and nominations for two Academy Awards, four British Academy Film Awards and three Golden Globe Awards.\n\nBorn in Heidelberg and raised in Killarney, Fassbender made his feature film debut as a Spartan warrior in the fantasy war epic 300 (2006). His earlier roles included various stage productions, as well as starring roles on television such as in the HBO miniseries Band of Brothers (2001) and the Sky One fantasy drama Hex (2004–05). He first came to prominence for his role as IRA volunteer Bobby Sands in Hunger (2008), for which he won a British Independent Film Award. Subsequent roles include the independent film Fish Tank (2009), as a Royal Marines lieutenant in Inglourious Basterds (2009), as Edward Rochester in the 2011 film adaptation of Jane Eyre, as Carl Jung in A Dangerous Method (2011), as the sentient android, David 8, in Ridley Scott's Prometheus (2012) and its sequel, Alien: Covenant (2017), and in the musical comedy drama Frank (2014) as an eccentric musician loosely inspired by Frank Sidebottom.\n\nThe actor’s former girlfriend, Sunawin “Leasi” Andrews, says she was the victim of domestic abuse at the hands of Fassbender in 2009. Andrews filed a restraining order in March 2010, requesting Fassbender stay at least 100 yards away from her and her two children. She also sought $24,000 to pay for medical bills that were the result of the injuries she says she suffered after Fassbender abused her on multiple occasions.\n\nOne instance of abuse allegedly occurred after Fassbender and Andrews were having dinner with friends at a restaurant. The court filings say Fassbender became angry with Andrews after one of her ex-boyfriends came over to their table to say hello. The actor’s anger carried over to the car ride home.\n\n“I went to the hospital and had a twisted left ankle, blown out left knee cap and a bursted ovarian cyst,” Andrews’ filing reads. “Lots of internal bleeding.”\n\nA second instance of abuse reportedly occurred at a July 2009 film festival. Fassbender had been partying late and came back to his hotel room with a friend and the two tried to get into bed with Andrews. She says she ended up checking into another room so she could avoid the two men. The next morning Andrews found Fassbender “sleeping in urine” and when she tried to wake him up, he allegedly threw her over a chair and broke her nose."
        },
        {
            "id": 1253199,
            "name": "Alexandra Shipp",
            "image": "/98AfO5NSqWnlhIxjSg08gGYdxUG.jpg",
            "birth_date": "1991-07-16",
            "biography": "Alexandra Ruth Shipp (born July 16, 1991) is an American actress and singer who rose to prominence for portraying singer Aaliyah in the Lifetime television film Aaliyah: The Princess of R&B (2014) and Kimberly Woodruff in the Oscar-nominated film Straight Outta Compton (2015).\n\nShipp is best known for playing Storm in the X-Men franchise, starting with X-Men: Apocalypse, Abby Suso in the 2018 romantic comedy Love, Simon, and Susan Wilson in Lin-Manuel Miranda's musical drama Tick, Tick... Boom!."
        },
        {
            "id": 525,
            "name": "Christopher Nolan",
            "image": "/xuAIuYSmsUzKlUMBFGVZaWsY3DZ.jpg",
            "birth_date": "1970-07-30",
            "biography": "Christopher Edward Nolan, CBE (born 30 July 1970) is a British-American film director, screenwriter, and producer. He was born in Westminster, London, England and holds both British and American citizenship due to his American mother. He is known for writing and directing critically acclaimed films such as Memento (2000), The Prestige (2006), The Dark Knight Trilogy (2005-12), Inception (2010), Interstellar (2014) and Dunkirk (2017). Nolan is the founder of the production company Syncopy Films. He often collaborates with his wife, producer Emma Thomas, and his brother, screenwriter Jonathan Nolan."
        },
        {
            "id": 1117313,
            "name": "John David Washington",
            "image": "/qoOp8XvZ4v7B0C9ZmtoRCl9CDSO.jpg",
            "birth_date": "1984-07-28",
            "biography": "John David Washington (born July 28, 1984) is an American actor and former American football running back. He shifted to an acting career like his father, Denzel Washington and mother, Pauletta Washington. In 2015, he started with the HBO comedy series Ballers and his role in BlacKkKlansman (2018) brought him a Golden Globe nomination for Best Actor. After seeing Washington's work in BlacKkKlansman, well-renowned director Christopher Nolan hand-picked him to anchor his thriller film Tenet (2020). Since then, Washington has also starred in Malcolm & Marie (2021), Amsterdam (2022) and The Creator (2023)."
        },
        {
            "id": 11288,
            "name": "Robert Pattinson",
            "image": "/3qZ09UE7lN6AtorfXFRYpEtSY93.jpg",
            "birth_date": "1986-05-13",
            "biography": "Robert Douglas Thomas Pattinson (born 13 May 1986) is an English actor. Noted for his versatile roles in both big-budget and independent films, Pattinson has been ranked among the world's highest-paid actors. After starting to act in a London theatre club at age 15, Pattinson began his film career by playing Cedric Diggory in the fantasy film Harry Potter and the Goblet of Fire (2005). He gained worldwide recognition for portraying Edward Cullen in The Twilight Saga film series (2008–2012), which grossed over $3.3 billion worldwide. After starring in the romantic dramas Remember Me (2010) and Water for Elephants (2011), Pattinson received critical acclaim for his performances in independent films from auteur directors. He starred in David Cronenberg's thriller Cosmopolis (2012), David Michôd's dystopian western The Rover (2014), James Gray's adventure drama The Lost City of Z (2016), the Safdie Brothers' crime drama Good Time (2017), Claire Denis' science-fiction drama High Life (2018), and Robert Eggers' psychological horror film The Lighthouse (2019). He returned to mainstream films with a leading role in Christopher Nolan's spy film Tenet (2020), and starred as the DC Comics superhero Batman in Matt Reeves' film The Batman (2022)."
        },
        {
            "id": 1133349,
            "name": "Elizabeth Debicki",
            "image": "/ljHfp4MKl5quPmf98gGHBNdO9Vd.jpg",
            "birth_date": "1990-08-24",
            "biography": "Elizabeth Debicki (born 24 August 1990) is an Australian actress. After making her feature film debut in A Few Best Men (2011), she appeared in The Great Gatsby (2013) as Jordan Baker. Other roles are in the limited series The Night Manager (2016) and Widows (2018)."
        },
        {
            "id": 11181,
            "name": "Kenneth Branagh",
            "image": "/AbCqqFxNi5w3nDUFdQt0DGMFh5H.jpg",
            "birth_date": "1960-12-10",
            "biography": "Sir Kenneth Charles Branagh (born 10 December 1960) is a British actor and filmmaker. Branagh trained at the Royal Academy of Dramatic Art in London; in 2015 he succeeded Richard Attenborough as its president. He has been nominated for five Academy Awards and five Golden Globe Awards. He has won three BAFTAs and two Emmy Awards. He was appointed a Knight Bachelor in the 2012 Birthday Honours and knighted on 9 November 2012.  He was made a Freeman of his native city of Belfast in January 2018. In 2020, he was listed at number 20 on The Irish Times list of Ireland's greatest film actors.\n\nBranagh has both directed and starred in several film adaptations of William Shakespeare's plays, including Henry V (1989), Much Ado About Nothing (1993), Othello (1995), Hamlet (1996), Love's Labour's Lost (2000), and As You Like It (2006). He was nominated for Academy Awards for Best Actor and Best Director for Henry V and for Best Adapted Screenplay for Hamlet.\n\nHe has also starred in the television series Fortunes of War (1987), Shackleton (2002), and Wallander (2008–2016) and in the films Celebrity (1998), Wild Wild West (1999), The Road to El Dorado (2000), as SS leader Reinhard Heydrich in Conspiracy (2001), Harry Potter and the Chamber of Secrets (2002), Warm Springs (2005), as Major General Henning von Tresckow in Valkyrie (2008), The Boat That Rocked (2009), and as Sir Laurence Olivier in My Week with Marilyn (2011), Dunkirk (2017), and Tenet (2020). He won an International Emmy Award for Wallander and a Primetime Emmy Award for Conspiracy, and was nominated for the Academy Award for Best Supporting Actor for My Week with Marilyn.\n\nBranagh directed and starred in the romantic thriller Dead Again (1991), the horror film Mary Shelley's Frankenstein (1994), and the action thriller Jack Ryan: Shadow Recruit (2014). He directed and starred as Hercule Poirot in the mystery drama adaptations of Agatha Christie's Murder on the Orient Express (2017) and Death on the Nile (2022). He also directed such films as Swan Song (1992), which earned an Academy Award nomination for Best Live Action Short Film, The Magic Flute (2006), Sleuth (2007), the Marvel superhero film Thor (2011), and the live-action adaptation of Disney's Cinderella (2015),\n\nHe narrated numerous documentary series, including Cold War (1998), Walking with Dinosaurs (1999), The Ballad of Big Al (2001), Walking with Beasts (2001), Walking with Monsters (2005), and World War 1 in Colour (2005)."
        },
        {
            "id": 78921,
            "name": "Dimple Kapadia",
            "image": "/iqGELKRFsN6YkbzvgFl3q0c6Emv.jpg",
            "birth_date": "1957-06-08",
            "biography": "Dimple Kapadia (born 8 June 1957) is an Indian film actress who predominantly appears in Hindi films. She was launched by Raj Kapoor at age 16, playing the title role in his teen romance Bobby (1973). In that same year she married Indian actor Rajesh Khanna and retired from acting. Kapadia returned to the film industry in 1984, following her separation from Khanna. One of her films of that period was the drama Saagar (1985). Both Bobby and Saagar won her the Filmfare Award for Best Actress. She went on to establish herself as one of the leading actresses of Hindi cinema in the 1980s.\n\nInitially recognized as a national sex symbol, Kapadia was keen to avoid being stereotyped and expand her range of acting roles. She subsequently took on more serious parts in a range of film genres, from mainstream to parallel cinema, and received acclaim for her performances in such films as Kaash (1987), Drishti (1990), Lekin... (1990), and Rudaali (1993), which earned her a National Film Award for Best Actress and a Filmfare Critics Award for Best Actress. She followed with supporting roles in Gardish (1993) and Krantiveer (1994), the latter of which garnered her a fourth Filmfare Award.\n\nKapadia continued working infrequently through the 1990s and the 2000s. She played a minor part in Dil Chahta Hai (2001) and was noted for her portrayal of the title role in the American production Leela (2002). Some of her later film credits include leading roles in Hum Kaun Hai? (2004), Pyaar Mein Twist (2005), Phir Kabhi (2008) and Tum Milo Toh Sahi (2010), and supporting roles in Being Cyrus (2005), Luck by Chance (2009), Dabangg (2010), Cocktail (2012) and Finding Fanny (2014). Kapadia is the mother of Twinkle Khanna and Rinke Khanna, both former actresses."
        },
        {
            "id": 1227717,
            "name": "Himesh Patel",
            "image": "/fC6diZ0i3Epot9dRl7b2SSegf4L.jpg",
            "birth_date": "1990-10-30",
            "biography": "Himesh Patel was born on October 13, 1990 in Huntingdon, Cambridgeshire, England as Himesh Jitendra Patel. He is an actor and writer, known for EastEnders: E20 (2010), My Pure Land (2017) and EastEnders (1985)."
        },
        {
            "id": 525,
            "name": "Christopher Nolan",
            "image": "/xuAIuYSmsUzKlUMBFGVZaWsY3DZ.jpg",
            "birth_date": "1970-07-30",
            "biography": "Christopher Edward Nolan, CBE (born 30 July 1970) is a British-American film director, screenwriter, and producer. He was born in Westminster, London, England and holds both British and American citizenship due to his American mother. He is known for writing and directing critically acclaimed films such as Memento (2000), The Prestige (2006), The Dark Knight Trilogy (2005-12), Inception (2010), Interstellar (2014) and Dunkirk (2017). Nolan is the founder of the production company Syncopy Films. He often collaborates with his wife, producer Emma Thomas, and his brother, screenwriter Jonathan Nolan."
        },
        {
            "id": 6193,
            "name": "Leonardo DiCaprio",
            "image": "/wo2hJpn04vbtmh0B9utCFdsQhxM.jpg",
            "birth_date": "1974-11-11",
            "biography": "Leonardo Wilhelm DiCaprio (born November 11, 1974) is an American actor and film producer. Known for his work in biopics and period films, DiCaprio is the recipient of numerous accolades, including an Academy Award, a British Academy Film Award, and three Golden Globe Awards. As of 2019, his films have grossed over $7.2 billion worldwide, and he has been placed eight times in annual rankings of the world's highest-paid actors.\n\nBorn in Los Angeles, DiCaprio began his career in the late 1980s by appearing in television commercials. In the early 1990s, he had recurring roles in various television shows, such as the sitcom Parenthood, and had his first major film part as author Tobias Wolff in This Boy's Life (1993). At age 19, he received critical acclaim and his first Academy Award and Golden Globe Award nominations for his performance as a developmentally disabled boy in What's Eating Gilbert Grape (1993). He achieved international stardom with the star-crossed romances Romeo + Juliet (1996) and Titanic (1997).\n\nAfter the latter became the highest-grossing film at the time, he reduced his workload for a few years. In an attempt to shed his image of a romantic hero, DiCaprio sought roles in other genres, including crime drama in Catch Me If You Can (2002) and Gangs of New York (2002); the latter marked the first of his many successful collaborations with director Martin Scorsese. DiCaprio portrayed Howard Hughes in The Aviator (2004) and received acclaim for his performances in the political thriller Blood Diamond (2006), the crime drama The Departed (2006), and the romantic drama Revolutionary Road (2008).\n\nIn the following decade, DiCaprio starred in several high-profile directors' projects, including the science fiction thriller Inception (2010), the western Django Unchained (2012), the biopic The Wolf of Wall Street (2013), the survival drama The Revenant (2015), for which he won an Academy Award and a BAFTA Award for Best Actor in a Leading Role, and the comedy-drama Once Upon a Time in Hollywood (2019), all of which were critical and commercial successes.\n\nDiCaprio is the founder of Appian Way Productions, a production company that has produced some of his films and the documentary series Greensburg (2008–2010), and the Leonardo DiCaprio Foundation, a nonprofit organization devoted to promoting environmental awareness. He regularly supports charitable causes and has produced several documentaries on the environment. In 2005, he was named a Commander of the Ordre des Arts et des Lettres for his contributions to the arts, and in 2016, he appeared in Time magazine's 100 most influential people in the world."
        },
        {
            "id": 24045,
            "name": "Joseph Gordon-Levitt",
            "image": "/z2FA8js799xqtfiFjBTicFYdfk.jpg",
            "birth_date": "1981-02-17",
            "biography": "Joseph Leonard Gordon-Levitt (born February 17, 1981) is an American actor and filmmaker. He has received various accolades, including nominations for the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy for his leading performances in 500 Days of Summer (2009) and 50/50 (2011). He is the founder of the online media platform HitRecord whose projects such as HitRecord on TV (2014–15) and Create Together (2020) won him two Primetime Emmy Awards in the category of Outstanding Interactive Program.\n\nBorn in Los Angeles to a Jewish family, Gordon-Levitt began his acting career as a child, appearing in the films A River Runs Through It (1992), Holy Matrimony (1994), and Angels in the Outfield (1994), which earned him a Young Artist Award and a Saturn Award nomination. He played the role of Tommy Solomon in the TV series 3rd Rock from the Sun (1996–2001) for which he received three nominations at the Screen Actors Guild Awards. He had a supporting role in 10 Things I Hate About You (1999) and voiced Jim Hawkins in the Disney animated Treasure Planet (2002) before taking a break from acting to study at Columbia University, but dropped out in 2004 to resume his acting career.\n\nSince returning to acting, Gordon-Levitt has starred in Manic (2001), Mysterious Skin (2004), Brick (2005), The Lookout (2007), The Brothers Bloom (2008), Miracle at St. Anna (2008), G.I. Joe: The Rise of Cobra (2009), Inception (2010), Hesher (2010), Premium Rush (2012), The Dark Knight Rises (2012), Looper (2012), and Lincoln (2012). He portrayed Philippe Petit in the Robert Zemeckis-directed film The Walk (2015) and whistleblower Edward Snowden in the Oliver Stone film Snowden (2016). In 2020, he starred in the legal drama The Trial of the Chicago 7, for which he won the Critics' Choice Movie Award for Best Acting Ensemble and the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture.\n\nIn 2013, he wrote and directed Don Jon, a comedy-drama film that was released to critical acclaim, earning him an Independent Spirit Award nomination for Best First Screenplay. He previously directed and edited two short films, both of which were released in 2010: Morgan M. Morgansen's Date with Destiny and Morgan and Destiny's Eleventeenth Date: The Zeppelin Zoo. In 2021, he wrote, directed and starred in a comedy drama series Mr. Corman on Apple TV+."
        },
        {
            "id": 3899,
            "name": "Ken Watanabe",
            "image": "/w2t30L5Cmr34myAaUobLoSgsLfS.jpg",
            "birth_date": "1959-10-21",
            "biography": "Ken Watanabe (born October 21, 1959) is a Japanese stage, film, and television actor. To English-speaking audiences he is known for playing tragic hero characters, such as General Tadamichi Kuribayashi in Letters from Iwo Jima and Lord Katsumoto Moritsugu in The Last Samurai, for which he was nominated for the Academy Award for Best Supporting Actor. Among other awards, he has won the Japan Academy Prize for Best Actor twice, in 2007 for Memories of Tomorrow and in 2010 for Shizumanu Taiyō. He is also known for his roles in director Christopher Nolan's Hollywood blockbusters Batman Begins and Inception."
        },
        {
            "id": 2524,
            "name": "Tom Hardy",
            "image": "/d81K0RH8UX7tZj49tZaQhZ9ewH.jpg",
            "birth_date": "1977-09-15",
            "biography": "Edward Thomas Hardy CBE (born 15 September 1977) is an English actor, producer, writer and former model. After studying acting at the Drama Centre London, he made his film debut in Ridley Scott's Black Hawk Down (2001). He has since been nominated for the Academy Award for Best Supporting Actor, two Critics' Choice Movie Awards and two British Academy Film Awards, receiving the 2011 BAFTA Rising Star Award.\n\nHardy has also appeared in films such as Star Trek: Nemesis (2002), RocknRolla (2008), Bronson (2008), Warrior (2011), Tinker Tailor Soldier Spy (2011), Lawless (2012), This Means War (2012), Locke (2013), The Drop (2014), and The Revenant (2015), for which he received a nomination for an Academy Award. In 2015, he portrayed \"Mad\" Max Rockatansky in Mad Max: Fury Road and both Kray twins in Legend. He has appeared in three Christopher Nolan films: Inception (2010) as Eames, The Dark Knight Rises (2012) as Bane, and Dunkirk (2017) as an RAF fighter-pilot. He starred as both Eddie Brock and Venom in the 2018 anti-hero film Venom and its sequel Venom: Let There Be Carnage (2021).\n\nHardy's television roles include the HBO war drama mini-series Band of Brothers (2001), the BBC historical drama mini-series The Virgin Queen (2005), Bill Sikes in the BBC's mini-series Oliver Twist (2007), Heathcliff in ITV's Wuthering Heights (2009), the Sky 1 drama series The Take (2009), and as Alfie Solomons in the BBC historical crime drama series Peaky Blinders (2014–present). He created, co-produced, and took the lead in the eight-part historical fiction series Taboo (2017) on BBC One and FX. In 2020, he also contributed narration work to the Amazon docuseries All or Nothing: Tottenham Hotspur.\n\nHardy has performed on both British and American stages. He was nominated for the Laurence Olivier Award for Most Promising Newcomer for his role as Skank in the production of In Arabia We'd All Be Kings (2003), and was awarded the 2003 Evening Standard Theatre Award for Outstanding Newcomer for his performances in both In Arabia We'd All Be Kings and Blood, in which he played Luca. He starred in the production of The Man of Mode (2007) and received positive reviews for his role in the play The Long Red Road (2010). Hardy is active in charity work and is an ambassador for the Prince's Trust. He was appointed a CBE in the 2018 Birthday Honours for services to drama.\n\nDescription above from the Wikipedia article Tom Hardy, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 27578,
            "name": "Elliot Page",
            "image": "/eCeFgzS8dYHnMfWQT0oQitCrsSz.jpg",
            "birth_date": "1987-02-21",
            "biography": "Elliot Page (born February 21, 1987) is a Canadian actor and producer.\n\nHe first became known for his role in the series Pit Pony (1997–2000), for which he won a Young Artist Award, and for his recurring roles in Trailer Park Boys (2002) and ReGenesis (2004). He then received recognition for his role in the film Hard Candy (2005) and won the Austin Film Critics Association's Award for Best Actress. Page had his breakthrough with the title role in Jason Reitman's film Juno (2007), earning nominations for an Academy Award, a BAFTA Award, a Critics' Choice Awards, a Golden Globe Award, and a Screen Actors Guild Award. He also earned praise for his roles in The Tracey Fragments (2007), Whip It (2009), Super (2010), Inception (2010), and Tallulah (2016). He has also portrayed Kitty Pryde in two X-Men films (2006, 2014), and had voice roles in the films Window Horses (2016) and My Life as a Zucchini (2016). In 2017, Page was cast as Vanya Hargreeves in the Netflix series The Umbrella Academy (2019–present). He provided the voice, motion capture, and likeness of Jodie Holmes in the video game Beyond: Two Souls (2013). He produced the film Freeheld (2015), in which he also starred, and made his directorial debut with the documentary There's Something in the Water (2019).\n\nOn December 1, 2020, Page came out as transgender on his social media accounts, specified his pronouns as he/him and they/them, and revealed his new name, Elliot Page."
        },
        {
            "id": 95697,
            "name": "Dileep Rao",
            "image": "/jRNn8SZqFXuI5wOOlHwYsWh0hXs.jpg",
            "birth_date": "1973-07-29",
            "biography": "Dileep Rao (born July 29, 1973) is an American actor who has appeared in feature films and television series. He starred in Sam Raimi's horror film Drag Me to Hell (2009), James Cameron's science fiction film Avatar (2009), and Christopher Nolan's thriller Inception (2010)."
        },
        {
            "id": 525,
            "name": "Christopher Nolan",
            "image": "/xuAIuYSmsUzKlUMBFGVZaWsY3DZ.jpg",
            "birth_date": "1970-07-30",
            "biography": "Christopher Edward Nolan, CBE (born 30 July 1970) is a British-American film director, screenwriter, and producer. He was born in Westminster, London, England and holds both British and American citizenship due to his American mother. He is known for writing and directing critically acclaimed films such as Memento (2000), The Prestige (2006), The Dark Knight Trilogy (2005-12), Inception (2010), Interstellar (2014) and Dunkirk (2017). Nolan is the founder of the production company Syncopy Films. He often collaborates with his wife, producer Emma Thomas, and his brother, screenwriter Jonathan Nolan."
        },
        {
            "id": 10297,
            "name": "Matthew McConaughey",
            "image": "/e9ZHRY5toiBZCIPEEyvOG9A8ers.jpg",
            "birth_date": "1969-11-04",
            "biography": "Matthew David McConaughey (born November 4, 1969) is an American actor. He first gained notice for his supporting performance in the coming-of-age comedy Dazed and Confused (1993), which was considered by many to be his breakout role. After a number of supporting roles in films including Angels in the Outfield (1994) and Texas Chainsaw Massacre: The Next Generation (1994), his breakthrough performance as a leading man came in the legal drama A Time to Kill (1996). He followed this with leading performances in the science fiction film Contact (1997), the historical drama Amistad (1997), the comedy-drama The Newton Boys (1998), the satire EDtv (1999), the war film U-571 (2000), and the psychological thriller Frailty (2001).\n\nIn the 2000s, McConaughey became best known for starring in romantic comedies, including The Wedding Planner (2001), How to Lose a Guy in 10 Days (2003), Failure to Launch (2006), Fool's Gold (2008), and Ghosts of Girlfriends Past (2009), establishing him as a sex symbol. After a two-year hiatus from film acting, McConaughey began to appear in more dramatic roles beginning with the legal drama The Lincoln Lawyer (2011). He was acclaimed for his supporting performances in Bernie (2011), Magic Mike (2012) and The Wolf of Wall Street (2013), and for his leading roles in Killer Joe (2011) and Mud (2012).\n\nMcConaughey's portrayal of Ron Woodroof, a cowboy diagnosed with AIDS, in the biopic Dallas Buyers Club (2013) earned him widespread praise and numerous accolades, including the Academy Award for Best Actor. In 2014, he starred as Rust Cohle in the first season of HBO's crime anthology series True Detective, for which he was nominated for the Primetime Emmy Award for Outstanding Lead Actor in a Drama Series. His film roles since have included Interstellar (2014), The Sea of Trees (2015), Free State of Jones (2016), Gold (2016), The Dark Tower (2017), and The Gentlemen (2019), earning varying degrees of commercial and critical success, as well as voice work in Kubo and the Two Strings (2016), Sing (2016), and Sing 2 (2021)."
        },
        {
            "id": 1813,
            "name": "Anne Hathaway",
            "image": "/s6tflSD20MGz04ZR2R1lZvhmC4Y.jpg",
            "birth_date": "1982-11-12",
            "biography": "Anne Jacqueline Hathaway (born November 12, 1982) is an American actress. She is the recipient of various accolades, including an Academy Award, a Golden Globe Award, and a Primetime Emmy Award, and was among the world's highest-paid actresses in 2015. Her films have grossed over $6.8 billion worldwide, and she appeared on the Forbes Celebrity 100 list in 2009.\n\nAs a teenager, she was cast in the television series Get Real (1999–2000) and made her breakthrough as the protagonist in her debut film, the Disney comedy The Princess Diaries (2001). Hathaway made a transition to adult roles with the 2005 dramas Havoc and Brokeback Mountain. The comedy-drama The Devil Wears Prada (2006), in which she played an assistant to a fashion magazine editor, was her biggest commercial success to that point.\n\nShe played a recovering addict with a mental illness in the drama Rachel Getting Married (2008), which earned her a nomination for the Academy Award for Best Actress. She went on to star in several commercially successful films, including the comedy Get Smart (2008), the romances Bride Wars (2009), Valentine's Day (2010), and Love & Other Drugs (2010), and the fantasy film Alice in Wonderland (2010). In 2012, she starred as Selina Kyle / Catwoman in her highest-grossing film, The Dark Knight Rises. Also that year, she played Fantine, a prostitute dying of tuberculosis, in the musical Les Misérables, for which she won the Academy Award for Best Supporting Actress.\n\nShe has since played a scientist in the science fiction film Interstellar (2014), the owner of an online fashion site in the comedy The Intern (2015), a haughty actress in the heist film Ocean's 8 (2018), a con artist in the comedy The Hustle (2019), and Rebekah Neumann in the miniseries WeCrashed (2022).\n\nIn addition to film roles, she won a Primetime Emmy Award for her voice role in the sitcom The Simpsons, sung for soundtracks, appeared on stage, and hosted events."
        },
        {
            "id": 83002,
            "name": "Jessica Chastain",
            "image": "/ajCes64FVk0RYEoSnUA5YTVkmR9.jpg",
            "birth_date": "1977-03-24",
            "biography": "Jessica Michelle Chastain (born March 24, 1977) is an American actress and film producer. Known for her roles in films with feminist themes, she has received various accolades, including an Academy Award, a Golden Globe Award, in addition to nominations for two British Academy Film Awards. Time magazine named her one of the 100 most influential people in the world in 2012.\n\nBorn and raised in Sacramento, California, Chastain developed an interest in acting from an early age. In 1998, she made her professional stage debut as Shakespeare's Juliet. After studying acting at the Juilliard School, she was signed to a talent holding deal with the television producer John Wells. She was a recurring guest star in several television series, including Law & Order: Trial by Jury. She also took on roles in the stage productions of Anton Chekhov's play The Cherry Orchard in 2004 and Oscar Wilde's tragedy Salome in 2006.\n\nChastain made her film debut in the drama Jolene (2008), and gained wide recognition for her starring roles in the dramas Take Shelter (2011) and The Tree of Life (2011). Her performance as an aspiring socialite in The Help (2011) earned her a nomination for the Academy Award for Best Supporting Actress. In 2012, she won a Golden Globe Award and received a nomination for the Academy Award for Best Actress for playing a CIA analyst in the thriller Zero Dark Thirty. Chastain made her Broadway debut in a revival of The Heiress in the same year. Her highest-grossing releases came with the science fiction films Interstellar (2014) and The Martian (2015), and the horror film It Chapter Two (2019), and she continued to receive critical acclaim for her performances in the dramas A Most Violent Year (2014), Miss Sloane (2016), Molly's Game (2017) and The Good Nurse (2022). For her portrayal of Tammy Faye in the biopic The Eyes of Tammy Faye (2021), which she also produced, Chastain won the Academy Award for Best Actress.\n\nIn television, Chastain starred in drama miniseries Scenes from a Marriage (2021) and George & Tammy (2022). For the latter, she won a SAG Award. Her performance also garnered her nominations for a Primetime Emmy Award and a Golden Globe Award.\n\nChastain is the founder of the production company Freckle Films, which was created to promote diversity in film. She is vocal about mental health issues, as well as gender and racial equality. She is married to fashion executive Gian Luca Passi de Preposulo, with whom she has two children.\n\nDescription above from the Wikipedia article Jessica Chastain, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 3895,
            "name": "Michael Caine",
            "image": "/hZruclwEPCKw3e83rnFSIH5sRFZ.jpg",
            "birth_date": "1933-03-14",
            "biography": "Sir Michael Caine CBE (born Maurice Joseph Micklewhite Jr.; March 14, 1933) is a retired English actor. Known for his distinctive South London accent, he has appeared in more than 160 films in a career spanning seven decades, and is considered a British film icon. As of February 2017, the films in which Caine has appeared have grossed over $7.8 billion worldwide.\n\nOften playing a Cockney, Caine made his breakthrough in the 1960s with starring roles in British films such as Zulu (1964), The Ipcress File (1965), Alfie (1966), The Italian Job (1969), and Battle of Britain (1969). He was nominated for an Academy Award for Alfie. His roles in the 1970s included Get Carter (1971), The Last Valley (1971), Sleuth (1972), The Man Who Would Be King (1975), The Eagle Has Landed (1976) and A Bridge Too Far (1977). He earned his second Academy Award nomination for Sleuth and achieved some of his greatest critical success in the 1980s, with Educating Rita (1983) earning him the BAFTA and Golden Globe Award for Best Actor and Woody Allen's Hannah and Her Sisters (1986) earning him his first Academy Award for Best Supporting Actor.\n\nCaine is also known for his performance as Ebenezer Scrooge in The Muppet Christmas Carol (1992), and for his comedic roles in Dirty Rotten Scoundrels (1988), Miss Congeniality (2000), Austin Powers in Goldmember (2002), and Secondhand Lions (2003). He received his second Golden Globe Award for Little Voice (1998). In 1999, he received his second Academy Award for Best Supporting Actor for his performance as a sympathetic doctor in The Cider House Rules. He portrayed a British journalist in Vietnam in The Quiet American (2002), earning his sixth Oscar nomination, and appeared in Alfonso Cuaron's dystopian drama film Children of Men (2006). Caine portrayed Alfred Pennyworth in Christopher Nolan's The Dark Knight Trilogy (2005–2012). He appeared in several other of Nolan's films including The Prestige (2006), Inception (2010), Interstellar (2014) and Tenet (2020). He also appeared in the heist thriller film Now You See Me (2013), the action comedy film Kingsman: The Secret Service (2014), the Italian drama Youth (2015) and the crime film King of Thieves (2018).\n\nCaine officially confirmed his retirement from acting on 13 October 2023."
        },
        {
            "id": 58549,
            "name": "Bill Irwin",
            "image": "/bAV5qsljgiHQkn3QluB5clVYC13.jpg",
            "birth_date": "1950-04-11",
            "biography": "William Mills Irwin (born April 11, 1950) is an American actor, clown, and comedian. He began as a vaudeville-style stage performer and has been noted for his contribution to the renaissance of American circus during the 1970s. He has also made a number of appearances on film and television, and he won a Tony Award for his role in Who's Afraid of Virginia Woolf on Broadway. He is also known as Mr. Noodle on the Sesame Street segment Elmo's World, has appeared in the Sesame Street film short Does Air Move Things?, and regularly appeared as a therapist on Law & Order: Special Victims Unit."
        },
        {
            "id": 9560,
            "name": "Ellen Burstyn",
            "image": "/wjxo9Yw8ZoKewcRlHShfTIZGVQF.jpg",
            "birth_date": "1932-12-07",
            "biography": "Ellen Burstyn (born Edna Rae Gillooly; December 7, 1932) is an American actress. Known for her portrayal of complicated women in dramas, Burstyn was the recipient of various accolades, and was among the few performers to have won an Oscar, Emmy, and Tony (Triple Crown of Acting).\n\nBorn in Detroit, Michigan, Burstyn left school and worked as a dancer and model. She made her stage debut on Broadway in 1957 and soon started to make appearances in television shows. Stardom followed several years later with her acclaimed role in The Last Picture Show (1971), which earned her a nomination for the Academy Award for Best Supporting Actress. Her next appearance in The Exorcist (1973), earned her a nomination for the Academy Award for Best Actress. The film has remained popular and several publications have regarded it as one of the greatest horror films of all time. She followed this with Martin Scorsese's Alice Doesn't Live Here Anymore (1974), which won her the Academy Award for Best Actress.\n\nShe appeared in numerous television films and gained further recognition from her performances in Same Time, Next Year (1978), which won her a Golden Globe Award, and Resurrection (1980), How to Make an American Quilt (1995), and Requiem For a Dream (2000). For playing a lonely drug-addicted woman in the last one of these, she was again nominated for an Academy Award and a Screen Actors Guild Award. In the 2010s, she made appearances in television series including the political dramas, Political Animals and House of Cards, which have earned her Emmy Award nominations. From 2000 till her death, she had been co-president of the Actors Studio, a drama school in New York City. In 2013, she was inducted into the American Theatre Hall of Fame for her work on stage.\n\nDescription above from the Wikipedia article Ellen Burstyn, licensed under CC-BY-SA, full list of contributors on Wikipedia"
        },
        {
            "id": 240,
            "name": "Stanley Kubrick",
            "image": "/yFT0VyIelI9aegZrsAwOG5iVP4v.jpg",
            "birth_date": "1928-07-26",
            "biography": "Stanley Kubrick (July 26, 1928 – March 7, 1999) was an American film director, writer, producer, and photographer who lived in England during most of the last four decades of his career. Kubrick was noted for the scrupulous care with which he chose his subjects, his slow method of working, the variety of genres he worked in, his technical perfectionism, and his reclusiveness about his films and personal life. He maintained almost complete artistic control, making movies according to his own whims and time constraints, but with the rare advantage of big-studio financial support for all his endeavors. Kubrick's films are characterized by a formal visual style and meticulous attention to detail—his later films often have elements of surrealism and expressionism that eschews structured linear narrative. His films are repeatedly described as slow and methodical, and are often perceived as a reflection of his obsessive and perfectionist nature. A recurring theme in his films is man's inhumanity to man. While often viewed as expressing an ironic pessimism, a few critics feel his films contain a cautious optimism when viewed more carefully.\n\nThe film that first brought him attention to many critics was Paths of Glory (1957), the first of three films of his about the dehumanizing effects of war. Many of his films at first got a lukewarm reception, only to be years later acclaimed as masterpieces that had a seminal influence on many later generations of film-makers. Considered especially groundbreaking was 2001: A Space Odyssey (1968) noted for being both one of the most scientifically realistic and visually innovative science-fiction films ever made while maintaining an enigmatic non-linear storyline. He voluntarily withdrew his film A Clockwork Orange (1971) from England, after it was accused of inspiring copycat crimes which in turn resulted in threats against Kubrick's family. His films were largely successful at the box-office, although Barry Lyndon (1975) performed poorly in the United States. Living authors Anthony Burgess and Stephen King were both unhappy with Kubrick's adaptations of their novels A Clockwork Orange and The Shining (1980) respectively, and both authors were engaged with subsequent adaptations. All of Kubrick's films from the mid-1950s to his death except for The Shining were nominated for Oscars, Golden Globes, or BAFTAs. Although he was nominated for an Academy Award as a screenwriter and director on several occasions, his only personal win was for the special effects in 2001: A Space Odyssey.\n\nEven though all of his films, apart from the first two, were adapted from novels or short stories, his works have been described by Jason Ankeny and others as \"original and visionary\". Although some critics, notably Andrew Sarris and Pauline Kael, frequently disparaged Kubrick's work, Ankeny describes Kubrick as one of the most \"universally acclaimed and influential directors of the postwar era\" with a \"standing unique among the filmmakers of his day.\""
        },
        {
            "id": 245,
            "name": "Keir Dullea",
            "image": "/dL9i0nCk2fCgInZNaYVjGck2IBp.jpg",
            "birth_date": "1936-05-30",
            "biography": "Keir Dullea (born May 30, 1936) is an American actor best known for the character of astronaut David Bowman, whom he portrayed in the 1968 film 2001: A Space Odyssey and in 1984's 2010: The Year We Make Contact, as well as his roles in the films Bunny Lake is Missing (1965) and Black Christmas (1974)."
        },
        {
            "id": 246,
            "name": "Gary Lockwood",
            "image": "/lQBqZKpMxGslopZRvFanIWL4pSl.jpg",
            "birth_date": "1937-02-21",
            "biography": "Gary Lockwood (born February 21, 1937) is an American actor perhaps best known for his iconic 1968 role as the astronaut Dr. Frank Poole in 2001: A Space Odyssey. He is father of the actress Samantha Lockwood. Both currently live in Los Angeles."
        },
        {
            "id": 247,
            "name": "William Sylvester",
            "image": "/gDzQVVDyzTMLuyK3iSrorDt1Utf.jpg",
            "birth_date": "1922-01-31",
            "biography": "William Sylvester (January 31, 1922 – January 25, 1995) was an American TV and film actor. His most famous film credit was Dr. Heywood Floyd in Stanley Kubrick's 2001 A Space Odyssey (1968). Born in Oakland, California and married at one time to the British actress Veronica Hurst, he moved to England after the Second World War and became a staple of British B films at a time when American and Canadian actors were much in demand in order to give indigenous films some appeal in the US.\n\nAs a result, he gained top billing in one of his very first films, House of Blackmail (1953), directed by the veteran filmmaker Maurice Elvey, for whom he also made What Every Woman Wants the following year. He also starred in such minor films as The Stranger Came Home (1954, for Hammer), Dublin Nightmare (1958), Offbeat (1960), Information Received (1961), Incident at Midnight, Ring of Spies and Blind Corner (all 1963). There were also lead roles in four British horror films: Gorgo (1960), Devil Doll (1963), Devils of Darkness (1964) and The Hand of Night (1966). Among his many TV credits were a 1959 BBC version of Shakespeare's Julius Caesar (playing Mark Antony), The Saint, The Baron, The High Chaparral, Harry O and The Six Million Dollar Man.\n\nHis later films included You Only Live Twice (1967) and, back in the USA after his prominent role for Kubrick, Busting (1973), The Hindenburg (1975) and Heaven Can Wait (1978). He died in Sacramento, California in 1995, aged 72."
        },
        {
            "id": 253,
            "name": "Douglas Rain",
            "image": "/blDCxSTUP5U9EdKOmhGtRvhby2c.jpg",
            "birth_date": "1928-03-13",
            "biography": "Douglas Rain (March 13, 1928 - November 11, 2018) was a Canadian actor and narrator. He was primarily a stage actor, but his best known film role was as the voice of the HAL 9000 computer in 2001: A Space Odyssey (1968) and its sequel 2010 (1984).\n\nRain was born in Winnipeg, Manitoba. He studied acting at the Banff School of Fine Arts in Banff, Alberta as well as in London at the Old Vic School. As a stage actor, his long association with the Stratford Festival of Canada that spans more than four decades. He has performed in many diverse roles on stage, most notably recognized for his performance at Stratford, Ontario in Henry V which was made into a television production in 1966.\n\nRain was also nominated for Broadway's 1972 Tony Award as Best Supporting or Featured Actor (Dramatic) for his performance in Vivat! Vivat Regina!"
        },
        {
            "id": 248,
            "name": "Daniel Richter",
            "image": "/cq8Fprv33RgYPwu39cGx6fxk5Qp.jpg",
            "birth_date": "1939-06-15",
            "biography": ""
        },
        {
            "id": 249,
            "name": "Leonard Rossiter",
            "image": "/qXjGUJ2TjO3ltiEYMEJ658VeqkA.jpg",
            "birth_date": "1926-10-21",
            "biography": "From Wikipedia, the free encyclopedia.  Leonard Rossiter (21 October 1926 – 5 October 1984) was an English actor known for his roles as Rupert Rigsby, in the British comedy television series Rising Damp (1974–78), and Reginald Iolanthe Perrin, in The Fall and Rise of Reginald Perrin (1976–79). He also had a long and distinguished career in the theatre and gained some notoriety for a series of Cinzano commercials (1978–1983), with Joan Collins.\n\nDescription above from the Wikipedia article Leonard Rossiter, licensed under CC-BY-SA,full list of contributors on Wikipedia."
        },
        {
            "id": 138,
            "name": "Quentin Tarantino",
            "image": "/1gjcpAa99FAOWGnrUvHEXXsRs7o.jpg",
            "birth_date": "1963-03-27",
            "biography": "Quentin Jerome Tarantino (born March 27, 1963) is an American film director, screenwriter, producer, cinematographer and actor. In the early 1990s he was an independent filmmaker whose films used nonlinear storylines and aestheticization of violence. His films have earned him a variety of Academy Award, Golden Globe, BAFTA and Palme d'Or Awards and he has been nominated for Emmy and Grammy Awards. In 2007, Total Film named him the 12th-greatest director of all time.\n\nTarantino was born in Knoxville, Tennessee, the son of Connie McHugh Tarantino Zastoupil, a health care executive and nurse born in Knoxville, and Tony Tarantino, an actor and amateur musician born in Queens, New York. Tarantino's mother allowed him to quit school at age 17, to attend an acting class full time. Tarantino gave up acting while attending the acting school, saying that he admired directors more than actors. Tarantino also worked in a video rental store before becoming a filmmaker, paid close attention to the types of films people liked to rent, and has cited that experience as inspiration for his directorial career.\n\nDescription above from the Wikipedia article Quentin Tarantino, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 8891,
            "name": "John Travolta",
            "image": "/zkAX8YV692YVDQgRBh5JPUddPMQ.jpg",
            "birth_date": "1954-02-18",
            "biography": "John Joseph Travolta (born February 18,1954) is an American actor, film producer, dancer, and singer. He first became known in the 1970s, after appearing on the television series Welcome Back, Kotter and starring in the box office successes Saturday Night Fever and Grease. Travolta's career re-surged in the 1990s, with his role in Pulp Fiction, and he has since continued starring in Hollywood films, including Face/Off, Ladder 49 and Wild Hogs. Travolta has twice been nominated for the Academy Award for Best Actor. The first, for his role in Saturday Night Fever and the second for Pulp Fiction. He won the Golden Globe Award for Best Actor - Motion Picture Musical or Comedy for his performance in Get Shorty.\n\nHe married actress Kelly Preston in 1991. The couple had a son, Jett, (April 13, 1992 - January 2, 2009), and have a daughter, Ella Bleu, born in 2000. They were married until Kelly's untimely death at the age of 57 in 2020 from breast cancer.\n\nHe was previously involved with actress Diana Hyland, whom he met while filming The Boy in the Plastic Bubble; the relationship ended when she died of breast cancer in 1977.\n\nHe is a certified pilot and owns five aircraft, including an ex-Australian Boeing 707–138 airliner. The plane bears the name Jett Clipper Ella in honor of his children. His $4.9 million estate in the Jumbolair subdivision in Ocala, Florida, is situated on Greystone Airport with its own runway and taxiway right to his front door.\n\nHe has been a practitioner of Scientology since 1975 when he was given the book Dianetics while filming the movie The Devil's Rain in Durango, Mexico."
        },
        {
            "id": 2231,
            "name": "Samuel L. Jackson",
            "image": "/nCJJ3NVksYNxIzEHcyC1XziwPVj.jpg",
            "birth_date": "1948-12-21",
            "biography": "Samuel Leroy Jackson (born December 21, 1948) is an American actor and producer. One of the most widely recognized actors of his generation, the films in which he has appeared have collectively grossed over $27 billion worldwide, making him the second highest-grossing actor of all time. The Academy of Motion Picture Arts and Sciences gave him an Academy Honorary Award in 2022 as \"A cultural icon whose dynamic work has resonated across genres and generations and audiences worldwide\".\n\nJackson started his career on stage making his professional theatre debut in Mother Courage and her Children in 1980 at The Public Theatre. From 1981 to 1983 he originated the role of Private Louis Henderson in A Soldier's Play Off-Broadway. He also originated the role of Boy Willie in August Wilson's The Piano Lesson in 1987 at the Yale Repertory Theatre. He returned to the play in the 2022 Broadway revival playing Doaker Charles. Jackson early film roles include Coming to America (1988), Goodfellas (1990), Patriot Games (1992), Juice (1992), True Romance (1993), and Jurassic Park (1993), Menace II Society (1993), and Fresh (1994). His collaborations with Spike Lee led to greater prominence with films such as School Daze (1988), Do the Right Thing (1989), Mo' Better Blues (1990), Jungle Fever (1991), Oldboy (2013), and Chi-Raq (2015).\n\nJackson's breakout role was in Quentin Tarantino's Pulp Fiction (1994) which earned him a BAFTA Award win and a nomination for the Academy Award for Best Supporting Actor. He further collaborated with Tarantino, acting in Jackie Brown (1997), Django Unchained (2012), and The Hateful Eight (2015). He's known for having appeared in a number of big-budget films, including Die Hard with a Vengeance (1995), A Time to Kill (1996), The Long Kiss Goodnight (1996), The Negotiator (1997), Deep Blue Sea (1999), Unbreakable (2000), Shaft (2000) and its reboot (2019), XXX (2002), S.W.A.T. (2003), Coach Carter (2005), Snakes on a Plane (2006), Kingsman: The Secret Service (2014), Kong: Skull Island (2017), and Glass (2019).\n\nHe also gained widespread recognition as the Jedi Mace Windu in the Star Wars prequel trilogy (1999–2005), later voicing the role in the animated film Star Wars: The Clone Wars (2008) and the video game Lego Star Wars: The Clone Wars (2011). With his permission, his likeness was used for the Ultimate version of the Marvel Comics character Nick Fury; he subsequently played Fury in 11 Marvel Cinematic Universe films, beginning with a cameo appearance in Iron Man (2008), as well as guest-starring in the television series Agents of S.H.I.E.L.D. He will reprise this role in the upcoming Disney+ series Secret Invasion, which is set to premiere on June 21, 2023. Jackson has provided his voice for several animated films, documentaries, television series, and video games, including Lucius Best / Frozone in the Pixar films The Incredibles (2004) and Incredibles 2 (2018)."
        },
        {
            "id": 139,
            "name": "Uma Thurman",
            "image": "/g8Y2jm5FznG7lGV6vNg6wEq0KFF.jpg",
            "birth_date": "1970-04-29",
            "biography": "Uma Karuna Thurman (born April 29, 1970) is an American actress, writer, producer and model. She has acted in a variety of films, from romantic comedies and dramas to science fiction and action films. Following her appearances on the December 1985 and May 1986 covers of British Vogue, Thurman's breakthrough role was Dangerous Liaisons (1988) in which she starred. She rose to international prominence with her role as Mia Wallace in Quentin Tarantino's 1994 film Pulp Fiction, for which she was nominated for the Academy Award, the BAFTA Award, and the Golden Globe Award for Best Supporting Actress. Often hailed as Tarantino's muse, she reunited with the director to play the main role of The Bride in Kill Bill: Volume 1 and 2 (2003, 2004), which brought her two additional Golden Globe Award nominations.\n\nEstablished as a Hollywood leading lady, her other notable films include Henry & June (1990), The Truth About Cats & Dogs (1996), Batman & Robin (1997), Gattaca (1997), Les Misérables (1998), Paycheck (2003), The Producers (2005), My Super Ex-Girlfriend (2006), Percy Jackson & the Olympians: The Lightning Thief (2010), Lars von Trier's Nymphomaniac (2013) and The House That Jack Built (2018). In 2011, Thurman was a member of the jury for the main competition at the 64th Cannes Film Festival, and in 2017, she was named president of the 70th edition's \"Un Certain Regard\" jury. Thurman made her Broadway debut in The Parisian Woman (2017–2018).\n\nFor her performance in the made-for-HBO film Hysterical Blindness (2002), Thurman won the Golden Globe Award for Best Actress in a Television Film, and for her five-episode role in the NBC musical series Smash (2012), she received a Primetime Emmy Award nomination for Outstanding Guest Actress in a Drama Series. Thurman has starred in the miniseries The Slap (2015) and the series Imposters (2017–2018).\n\nDescription above from the Wikipedia article Uma Thurman, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 62,
            "name": "Bruce Willis",
            "image": "/A1XBu3CffBpSK8HEIJM8q7Mn4lz.jpg",
            "birth_date": "1955-03-19",
            "biography": "Walter Bruce Willis (born March 19, 1955) is a retired American actor. His career began on the off-Broadway stage in the 1970s. He achieved fame with a leading role on the comedy-drama series Moonlighting (1985–1989) and has since appeared in over 70 films, gaining widespread recognition as an action hero after his portrayal of John McClane in the Die Hard franchise (1988–2013) and other subsequent roles.\n\nWillis's other credits include The Last Boy Scout (1991), Pulp Fiction (1994), 12 Monkeys (1995), Last Man Standing (1996), The Fifth Element (1997), Armageddon (1998), The Sixth Sense (1999), Hart's War (2002), Tears of the Sun (2003), Hostage (2005), Lucky Number Slevin (2006), Surrogates (2009), Moonrise Kingdom (2012), Rock the Kasbah (2015) and Motherless Brooklyn (2019).\n\nAs a singer, Willis released his debut album The Return of Bruno in 1987, followed by two more successful albums in 1989 and 2001. He made his Broadway debut in the stage adaptation of Misery in 2015. Willis has received numerous accolades during his career, including a Golden Globe, two Primetime Emmy Awards, and two People's Choice Awards. He received a star on the Hollywood Walk of Fame in 2006.\n\nIn March 2022, Willis announced that he was retiring from acting after being diagnosed with aphasia, which affects his ability to communicate. In February 2023, Willis' family announced that they had received a more accurate diagnosis and he had been diagnosed with frontotemporal dementia."
        },
        {
            "id": 10182,
            "name": "Ving Rhames",
            "image": "/ohAOsD8E4tu35PI2buzZORpn9Ef.jpg",
            "birth_date": "1959-05-12",
            "biography": "Irving Rameses Rhames (born May 12, 1959) is an American actor. He is known for his supporting roles as IMF Agent Luther Stickell in the Mission: Impossible film series and gang kingpin Marsellus Wallace in Pulp Fiction (1994). He also appeared in Jacob's Ladder (1990), Dave (1993), Striptease (1996), Con Air (1997), Only in America (1997), Out of Sight (1998), Entrapment (1999), Bringing Out the Dead (1999), Dawn of the Dead (2004), I Now Pronounce You Chuck & Larry (2007), Jamesy Boy (2014). He voiced Cobra Bubbles in the animated films Lilo & Stitch (2002), Stitch! The Movie (2003), and Leroy & Stitch (2006)."
        },
        {
            "id": 1037,
            "name": "Harvey Keitel",
            "image": "/7P30hza1neYWW3r7rSQOC736K2Z.jpg",
            "birth_date": "1939-05-13",
            "biography": "Harvey Keitel (born May 13, 1939) is an American actor known for his portrayal of morally ambiguous and \"tough guy\" characters. He rose to prominence during the New Hollywood movement, and has held a long-running association with director Martin Scorsese, starring in six of his films: Who's That Knocking at My Door (1967), Mean Streets (1973), Alice Doesn't Live Here Anymore (1974), Taxi Driver (1976), The Last Temptation of Christ (1988), and The Irishman (2019).\n\nKeitel received the Academy Award for Best Supporting Actor nomination for his portrayal of Mickey Cohen in Bugsy (1991). He won the AACTA Award for Best Actor in a Leading Role for The Piano (1993). Other films include Blue Collar (1978), Thelma & Louise (1991), Reservoir Dogs (1992), Bad Lieutenant (1992), Pulp Fiction (1994), From Dusk till Dawn (1996), Holy Smoke! (1998), Cop Land (1997), and Youth (2015).\n\nHe has acted in the Wes Anderson films Moonrise Kingdom (2012), The Grand Budapest Hotel (2014), and Isle of Dogs (2018). He played FBI Agent Peter Sadusky in both National Treasure (2004), and National Treasure: Book of Secrets (2006) and reprised his role in the Disney+ series National Treasure: Edge of History (2022). From 1995 to 2017, he was a co-president of the Actors Studio, alongside Al Pacino and Ellen Burstyn.\n\nDescription above from the Wikipedia article Harvey Keitel, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 7396,
            "name": "Peter Farrelly",
            "image": "/3PDYOFfk5NLmNcEz6SFZmdmqVZr.jpg",
            "birth_date": "1956-12-17",
            "biography": "Peter John Farrelly (born December 17, 1956) is an American film director, screenwriter, producer, and novelist, known for his work in the comedy genre with his younger brother Bobby, writing and directing films such as \"Dumb and Dumber\" (1994), \"There's Something About Mary\" (1998), and \"Me, Myself & Irene\" (2000). After a twenty-year run of collaborations that culminated in the sequel \"Dumb and Dumber To\" (2014), the Farrelly brothers embarked on solo careers. Peter made his solo directorial debut with the period drama \"Green Book\" (2018), which went on to win Best Picture at the Academy Awards in 2019."
        },
        {
            "id": 110,
            "name": "Viggo Mortensen",
            "image": "/vH5gVSpHAMhDaFWfh0Q7BG61O1y.jpg",
            "birth_date": "1958-10-20",
            "biography": "Viggo Peter Mortensen, Jr. (born October 20, 1958) is an American actor, writer, director, producer, musician, and multimedia artist. Born and raised in the state of New York to a Danish father and American mother, he also lived in Argentina during his childhood. He is the recipient of various accolades including a Screen Actors Guild Award and has been nominated for three Academy Awards, three BAFTA Awards, and four Golden Globe Awards."
        },
        {
            "id": 932967,
            "name": "Mahershala Ali",
            "image": "/9ZmSejm5lnUVY5IJ1iNx2QEjnHb.jpg",
            "birth_date": "1974-02-16",
            "biography": "Mahershalalhashbaz \"Mahershala\" Ali (born Mahershalalhashbaz Gilmore; February 16, 1974) is an American actor. Ali began his career as a regular on series such as Crossing Jordan and Threat Matrix before his breakthrough role as Richard Tyler in the science-fiction series The 4400. His first major film release was in the 2008 David Fincher-directed romantic fantasy drama film The Curious Case of Benjamin Button, and he gained wider attention for supporting roles in the final two films of the original The Hunger Games film series, and in House of Cards, for which he received a Primetime Emmy Award nomination.\n\nAli won the Academy Award for Best Supporting Actor for his performances in Moonlight (2016) and Green Book (2018). He is the first Muslim actor to win an Oscar, the first Black actor to win two Academy Awards in the same category, and the second Black actor to win multiple acting Oscars."
        },
        {
            "id": 1817,
            "name": "Linda Cardellini",
            "image": "/bcycvynDprC1rrhBNrnBjn5uOUd.jpg",
            "birth_date": "1975-06-25",
            "biography": "Linda Edna Cardellini (born June 25, 1975) is an American actress. In television, she is known for her leading roles in the teen drama Freaks and Geeks (1999–2000), the medical drama ER (2003–09), the drama thriller Bloodline (2015–17), and the tragicomedy Dead to Me (2019–present), the latter of which earned her a nomination for the Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series. She also guest starred in the period drama Mad Men (2013–15), for which she received a Primetime Emmy Award nomination. Her voice work includes the animated series Scooby-Doo! Mystery Incorporated (2010–13), Regular Show (2012–15), Gravity Falls (2012–16), and Sanjay and Craig (2013–16).\n\nIn film, Cardellini is best known for her portrayal of Velma Dinkley in Scooby-Doo (2002) and its sequel Scooby-Doo 2: Monsters Unleashed (2004), and her supporting roles in Legally Blonde (2001), Brokeback Mountain (2005), Grandma’s Boy (2006), Kill the Irishman (2011), Avengers: Age of Ultron (2015), The Founder (2016), Green Book, A Simple Favor (both 2018), and Avengers: Endgame (2019). She also starred in the drama Return (2011), earning an Independent Spirit Award for Best Female Lead nomination, the comedies Daddy's Home (2015) and Daddy's Home 2 (2017), and the horror film The Curse of La Llorona (2019).\n\nDescription above from the Wikipedia article Linda Cardellini, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 299743,
            "name": "Sebastian Maniscalco",
            "image": "/8TvA9HEwURJmY9MkkUruB4Sl0lR.jpg",
            "birth_date": "1973-07-08",
            "biography": "Sebastian Maniscalco (/mænɪˈskælkoʊ/; Italian: [mani'skalko]; born July 8, 1973) is an American stand-up comedian and actor. He has since released five comedy specials. Maniscalco has also had supporting acting roles in the films Green Book (2018) and The Irishman (2019), playing mobster Joe Gallo in the latter."
        },
        {
            "id": 1613744,
            "name": "Dimiter D. Marinov",
            "image": "/lZwHZ27xqsPsuswcxyx6uWSh5VP.jpg",
            "birth_date": "1964-10-06",
            "biography": ""
        },
        {
            "id": 1211946,
            "name": "P.J. Byrne",
            "image": "/shniQxLvKNvANyJy3hLG8Oo7fW7.jpg",
            "birth_date": "1974-12-15",
            "biography": "Paul Jeffrey Byrne (born December 15, 1974) is an American film and television actor. He is best known for his roles as Nicky \"Rugrat\" Koskoff in the Martin Scorsese film The Wolf of Wall Street (2013) and Bolin on Nickelodeon's animated series The Legend of Korra (2012–2014)."
        },
        {
            "id": 1577,
            "name": "Richard Kelly",
            "image": "/l0rWmZW2tBBwjBedjzAH23eagZ3.jpg",
            "birth_date": "1975-03-28",
            "biography": "James Richard Kelly (born 1975) is an American writer-director, best known for his debut feature, the science-fiction cult classic \"Donnie Darko\"(2001).\n\nKelly was born in Newport News, Virginia, the son of Lane and Ennis Kelly. He won a scholarship to the University of Southern California to study at the USC School of Cinema-Television. He made two short films at USC, \"The Goodbye Place\" and \"Visceral Matter\", before graduating in 1997.\n\n\"Donnie Darko\" was his first feature and was nominated for 21 awards, winning 11 of them, including a nomination for a Saturn Award. The film later ended up #2 on Empire magazine's list of 50 greatest independent films of all time, behind Quentin Tarantino's \"Reservoir Dogs\".\n\nKelly wrote the screenplay for Tony Scott's biographical crime thriller \"Domino\" (2005), and went on to write and direct the postmodern L.A. satire \"Southland Tales\" (2006) and the science-fiction mystery \"The Box\" (2009), inspired by \"The Twilight Zone\" episode \"Button, Button\". Although his three films differ considerably in setting and characters, they share similar themes of time travel, existentialism, and spirituality.\n\nKelly's particular filmmaking sensibilities can be traced back to his viewing of Terry Giliam's \"Brazil\" (1985), as told to author Robert K. Elder in an interview for his book \"The Film That Changed My Life\" (2011).\n\nThe commercial underperformance of Kelly's films has made it difficult for him to secure financing for other projects, and as such he has not directed a film since 2009. In 2016, filmmaker Kevin Smith said of Kelly: \"He is insanely creative and is not unlike Christopher Nolan. But Nolan wound up in the Warner Bros. system where he got special handling, and he got a lot of money to make huge art films like \"Inception\". Richard can be one of our greatest filmmakers. He is right now, but just a lot of people don't realize it. He's still a kid, and someone needs to Nolan that kid.\""
        },
        {
            "id": 131,
            "name": "Jake Gyllenhaal",
            "image": "/btORQRDyGCF0KNweGGYpmQXZK3P.jpg",
            "birth_date": "1980-12-19",
            "biography": "Jacob Benjamin Gyllenhaal (born December 19, 1980) is an American actor and producer. Born into the Gyllenhaal family, he is the son of director Stephen Gyllenhaal and screenwriter Naomi Foner; his older sister is actress Maggie Gyllenhaal.\n\nHe began acting as a child, making his acting debut in City Slickers (1991), followed by roles in his father's films A Dangerous Woman (1993) and Homegrown (1998). His breakthrough roles were as Homer Hickam in October Sky (1999) and as a psychologically troubled teenager in Donnie Darko (2001).  In 2004, Gyllenhaal starred in the science fiction disaster film The Day After Tomorrow. In 2005, he played Jack Twist in Ang Lee's romantic drama Brokeback Mountain, for which Gyllenhaal won a BAFTA Award and was nominated for an Academy Award. His career progressed with starring roles in the thriller Zodiac (2007), the romantic comedy Love & Other Drugs (2010), and the science fiction film Source Code (2011). Further acclaim came with his roles in Denis Villeneuve's thrillers Prisoners (2013) and Enemy (2013), and he received nominations for the BAFTA Award for Best Actor in a Leading Role for his performances as a manipulative journalist in Nightcrawler (2014) and a troubled writer in Nocturnal Animals (2016).  His highest-grossing release came with the Marvel Cinematic Universe superhero film Spider-Man: Far From Home (2019), in which he portrayed Quentin Beck / Mysterio. Gyllenhaal has also performed on stage, starring in Broadway productions of the musical Sunday in the Park with George as well as the plays Constellations and Sea Wall/A Life, the lattermost of which earned him a Tony Award nomination. Aside from acting, he is vocal about political and social issues.  Description above from the Wikipedia article Jake Gyllenhaal, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 20089,
            "name": "Jena Malone",
            "image": "/1qmkanVCFr3ZaXcxSXVDO8andb0.jpg",
            "birth_date": "1984-11-21",
            "biography": "Jena Malone (born November 21, 1984) is an American actress, musician, and photographer. She made her film debut in Bastard Out of Carolina (1996) and has appeared in films including Ellen Foster (1997), Contact (1997), Stepmom (1998), For Love of the Game (1999), Donnie Darko (2001), Life as a House (2001), Saved! (2004), Pride & Prejudice (2005), Into the Wild (2007), The Ruins (2008), Sucker Punch (2011), The Hunger Games film series (2013–15), The Neon Demon (2016), Nocturnal Animals (2016), and Antebellum (2020).\n\nMalone is also an indie pop musician who has released music both under her own name (as \"Jena Malone and Her Bloodstains\") and as one-half of the duo The Shoe."
        },
        {
            "id": 1582,
            "name": "James Duval",
            "image": "/vvasxKKPnxv2qOoXTnaXW3ecGLO.jpg",
            "birth_date": "1972-09-10",
            "biography": "James \"Jimmy\" Edward Duval (born September 10, 1972) is an American actor, who is most famous for his roles in the Gregg Araki \"Teenage Apocalypse\" trilogy in addition to Frank in Donnie Darko, Miguel in Independence Day, and Singh in Go."
        },
        {
            "id": 69597,
            "name": "Drew Barrymore",
            "image": "/mVQdb6w6gXmLZ6nZ3K9Fw3vzawM.jpg",
            "birth_date": "1975-02-22",
            "biography": "Drew Blythe Barrymore (born February 22, 1975) is an American actress, director, producer, businesswoman, and talk show host who is the recipient of numerous accolades, including a Golden Globe and a Screen Actors Guild Award, as well as five Emmy Award nominations and a BAFTA nomination. She is a member of the Barrymore family of actors and the granddaughter of John Barrymore.\n\nBarrymore achieved fame as a child actress with her role in E.T. the Extra-Terrestrial. Following a highly publicized childhood marked by drug and alcohol abuse, she released an autobiography Little Girl Lost. She starred in a string of successful films during the 1990s and 2000s, including Charlie's Angels, Never Been Kissed, Poison Ivy, Boys on the Side, Mad Love, Batman Forever, Scream and Ever After. Barrymore starred with Adam Sandler in several films, including The Wedding Singer, 50 First Dates and Blended.\n\nHer other films include Firestarter, Donnie Darko, Riding in Cars with Boys, Confessions of a Dangerous Mind, Charlie's Angels: Full Throttle, Fever Pitch, Music and Lyrics, Going the Distance, Big Miracle and Miss You Already. She also starred in her directorial debut film Whip It. She won a SAG Award and a Golden Globe for her role in Grey Gardens. She starred in the Netflix series Santa Clarita Diet and currently hosts her syndicated talk show The Drew Barrymore Show.\n\nBarrymore is the founder of the production company Flower Films. It produced several projects in which she has starred. She launched a range of cosmetics under the Flower banner in 2013, which has grown to include lines in make-up, perfume and eyewear. Her other business ventures include a range of wines and a clothing line. E. P. Dutton published a collection of Barrymore's autobiographical essays in a book titled Wildflower in 2015. Barrymore received a star on the Hollywood Walk of Fame in 2004."
        },
        {
            "id": 5151,
            "name": "Beth Grant",
            "image": "/6THLoPYhIu422TqUmQDgnQRfYxA.jpg",
            "birth_date": "1949-09-18",
            "biography": "Beth Grant (born September 18, 1949) is an American actress. She is known for often playing characters who are conservatives, religious zealots or sticklers for rules.\n\nShe has appeared in dozens of films, including Rain Man, Speed; To Wong Foo, Thanks for Everything! Julie Newmar; Love Field; Donnie Darko; A Time to Kill; Little Miss Sunshine; Child's Play 2; Daltry Calhoun; City Slickers 2; Don't Tell Her It's Me; Matchstick Men; Factory Girl; The Wizard; Sordid Lives; The Rookie; All About Steve; No Country for Old Men, Crazy Heart, and Rango.\n\nGrant has also appeared in many TV shows, including Everwood; Delta; The Golden Girls; Malcolm in the Middle; The X-Files; Friends; CSI; Six Feet Under; Wonderfalls; My Name Is Earl; Yes, Dear; King of the Hill; The Office; Angel; Judging Amy; Jericho; Sordid Lives: The Series; Criminal Minds, Sabrina The Teenage Witch; True Blood; How I Met Your Mother; and The Mentalist.\n\nGrant was born in Gadsden, Alabama, and is an alumna of East Carolina University. She is married to actor Michael Chieffo with whom she has one child.\n\nGrant played the same character, Marianne Marie Beetle, in the short-lived show Wonderfalls and Pushing Daisies, both created by Bryan Fuller.\n\nDescription above from the Wikipedia article Beth Grant, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 1579,
            "name": "Maggie Gyllenhaal",
            "image": "/qxgM5LzzG4uWTprCL3gBVVJ2Q1K.jpg",
            "birth_date": "1977-11-16",
            "biography": "Margalit \"Maggie\" Ruth Gyllenhaal (born November 16, 1977) is an American actress and filmmaker. Part of the Gyllenhaal family, she is the daughter of filmmakers Stephen Gyllenhaal and Naomi Achs, and the older sister of actor Jake Gyllenhaal.\n\nGyllenhaal began her career as a teenager with small roles in several of her father's films, and appeared with her brother in the cult favorite Donnie Darko (2001). She then appeared in Adaptation, Confessions of a Dangerous Mind (both 2002), and Mona Lisa Smile (2003). Gyllenhaal received critical acclaim for her leading performances in the erotic romantic comedy drama Secretary (2002) and the drama Sherrybaby (2006), each of which earned her a Golden Globe Award nomination. After several commercially successful films in 2006, including World Trade Center, she received wider recognition for playing Rachel Dawes in the superhero film The Dark Knight (2008).\n\nFor her performance as a single mother in Crazy Heart (2009), she received a nomination for Academy Award for Best Supporting Actress. She subsequently starred in the comedies and dramas: Nanny McPhee and the Big Bang (2010), Hysteria (2011), and Won't Back Down (2012). Her other roles include a Secret Service agent in the action-thriller White House Down (2013), a musician in Frank (2014), and the title role in the drama The Kindergarten Teacher (2018). In 2021, Gyllenhaal made her writing and directing debut with the psychological drama The Lost Daughter, for which she won the Venice International Film Festival's Best Screenplay Award and was nominated for the Academy Award for Best Adapted Screenplay.\n\nGyllenhaal has also appeared in five stage productions since 2000, including making her Broadway debut in a revival of The Real Thing. She has starred in several television series, including the BBC political-thriller miniseries The Honourable Woman. For her performance, she won a Golden Globe award for Best Actress, and was nominated for a Primetime Emmy Award. She also produced and starred in the HBO period drama series The Deuce (2017–19). Gyllenhaal has been married to actor Peter Sarsgaard since 2009 and they have two children together."
        },
        {
            "id": 40684,
            "name": "David Leitch",
            "image": "/htO4qu7yMUfZzJR9DF9iXch8ina.jpg",
            "birth_date": "1975-11-16",
            "biography": "David Leitch (born November 16, 1975) is an American filmmaker, actor, stunt performer and stunt coordinator who made his directorial debut on the 2014 action film John Wick with Chad Stahelski, though only Stahelski was credited. Leitch then directed the 2017 thriller film Atomic Blonde, starring Charlize Theron, and 2018's Deadpool 2, the sequel to the 2016 film. In 2019, he directed Hobbs & Shaw, a spin-off of the Fast & Furious franchise."
        },
        {
            "id": 10859,
            "name": "Ryan Reynolds",
            "image": "/so89QyuxAZY8IOpNTweCekhxsvO.jpg",
            "birth_date": "1976-10-23",
            "biography": "Ryan Rodney Reynolds (born October 23, 1976) is a Canadian actor and film producer. He began his career starring in the Canadian teen soap opera Hillside (1991–1993), and had minor roles before landing the lead role on the sitcom Two Guys and a Girl between 1998 and 2001. Reynolds then starred in a range of films, including comedies such as National Lampoon's Van Wilder (2002), Waiting... (2005), and The Proposal (2009). He also performed in dramatic roles in Buried (2010), Woman in Gold (2015), and Life (2017), starred in action films such as Blade: Trinity (2004), Green Lantern (2011), 6 Underground (2019) and Free Guy (2021), and provided voice acting in the animated features The Croods (2013), Turbo (2013), Pokémon: Detective Pikachu (2019) and The Croods: A New Age (2020).\n\nReynolds' biggest commercial success came with the superhero films Deadpool (2016) and Deadpool 2 (2018), in which he played the title character. The former set numerous records at the time of its release for an R-rated comedy and his performance earned him nominations at the Critics' Choice Movie Awards and the Golden Globe Awards."
        },
        {
            "id": 16851,
            "name": "Josh Brolin",
            "image": "/sX2etBbIkxRaCsATyw5ZpOVMPTD.jpg",
            "birth_date": "1968-02-12",
            "biography": "Josh James Brolin (born February 12, 1968) is an American actor. A son of actor James Brolin, he gained fame in his youth for his role in the adventure film The Goonies (1985). After years of decline, Brolin had a resurgence with his starring role in the crime film No Country for Old Men (2007). Brolin received a nomination for the Academy Award for Best Supporting Actor for portraying Dan White in the biopic Milk (2008).\n\nBrolin gained wider recognition for playing Thanos in the Marvel Cinematic Universe, including in the films Avengers: Infinity War (2018) and Avengers: Endgame (2019), as well as Cable in Deadpool 2 (2018). His other notable films include W. (2008), True Grit (2010), Wall Street: Money Never Sleeps (2010), Men in Black 3 (2012), Oldboy (2013), Inherent Vice (2014), Everest (2015), Sicario (2015), Hail, Caesar! (2016), Only the Brave (2017), Dune (2021), and Dune: Part Two (2024).\n\nDescription above from the Wikipedia article Josh Brolin, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 54882,
            "name": "Morena Baccarin",
            "image": "/kBSKKaOtsqIzZPhtEeHfCBmhWl9.jpg",
            "birth_date": "1979-06-02",
            "biography": "Morena Baccarin (born June 2, 1979) is a Brazilian-born American actress most widely known for roles in several American science fiction television shows: as Inara Serra in the series Firefly; as Adria in the series Stargate SG-1; and as Anna in the 2009 version of the series V.\n\nBaccarin was born in Rio de Janeiro, Brazil. Her mother is Brazilian stage and TV actress Vera Setta, and her father is Italian journalist Fernando Baccarin. When she was 7, Baccarin moved with her family to Greenwich Village, New York, as her father was transferred to Globo TV's headquarters in the United States, working as editor. Baccarin attended Public School 41 and New York City Lab School for Collaborative Studies, where she and Claire Danes were classmates. She later attended the Fiorello H. LaGuardia High School of Music & Art and Performing Arts before she entered the theater program at Juilliard. Baccarin landed her first movie role in the improvised fashion world comedy Perfume (2001)."
        },
        {
            "id": 1139349,
            "name": "Julian Dennison",
            "image": "/jp1phhrj8lT4NWQpztqi0FmM94i.jpg",
            "birth_date": "2002-10-26",
            "biography": "Julian Dennison is a film child actor from New Zealand, best known for his roles as Ricky Baker in Hunt for the Wilderpeople, the highest-grossing New Zealand film in history, and as Russell Collins a.k.a. \"Firefist\" in Deadpool 2."
        },
        {
            "id": 1545693,
            "name": "Zazie Beetz",
            "image": "/sgxzT54GnvgeMnOZgpQQx9csAdd.jpg",
            "birth_date": "1991-06-01",
            "biography": "Zazie Olivia Beetz (born June 1, 1991) is a German-American actress. She stars in the FX comedy-drama series Atlanta (2016–2022), for which she received a nomination for the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series. She also appeared in the Netflix anthology series Easy (2016–19) and voices Amber Bennett in Amazon's animated superhero action series Invincible.\n\nIn film, Beetz has appeared in the disaster film Geostorm (2017) and has played the Marvel Comics character Domino in the superhero film Deadpool 2 (2018) and Arthur Fleck/Joker's neighbor Sophie in the psychological thriller Joker (2019)."
        },
        {
            "id": 51990,
            "name": "T.J. Miller",
            "image": "/rRrVvBxOkyYM5XdLXimShHR1Itn.jpg",
            "birth_date": "1981-06-04",
            "biography": "Todd Joseph \"T.J.\" Miller (born June 4, 1981) is an American actor and stand-up comedian.\n\nAfter college, Miller moved to Chicago and began to perform improv and stand-up comedy. He toured with The Second City for two years. In 2008, he was named one of Variety's \"10 Comics To Watch.\"\n\nHe portrayed Marmaduke Brooker in Carpoolers on ABC (2007–2008).\n\nIn 2008, he made his film acting debut in Cloverfield in which he only appeared onscreen for a few minutes, but his voice was heard in almost every scene as the person who videotaped most of the events depicted. In 2009, he played Cessna Jim in The Goods: Live Hard, Sell Hard and the grindcore musician Rory in Mike Judge's comedy Extract. In 2010, he co-starred in She's Out of My League as Stainer, played Brian the Concierge in Get Him to the Greek and had a supporting role in Unstoppable. From 2010 to 2014, he voiced Tuffnut Thorston in the first three How to Train Your Dragon films.\n\nIn 2010, he played Ranger Jones in the live-action animated film Yogi Bear, and he also played Dan in Gulliver's Travels. In 2011, he appeared in the film Our Idiot Brother and, in 2012, he had a cameo as administrative personnel for Rolling Stone in the musical film Rock of Ages.\n\nOn 12/13/2010, 10/28/2011, and 6/14/2012, he performed stand-up on Conan. On November 15, 2011, his stand-up special No Real Reason premiered on Comedy Central. In 2011, he hosted a special called Mash Up, which was picked up in 2012 for a full season by Comedy Central. He also appeared frequently as a member of the \"round table\" on Chelsea Lately.\n\nIn 2012, he voiced Robbie Valentino on the Disney channel cartoon Gravity Falls. He also voiced Gorburger, a giant blue monster talk show host, on The Gorburger Show, which originally aired on Funny or Die and YouTube for 2 seasons in 2012–13, then on Comedy Central for a 3rd season in 2017.  In 2013, he co-starred in the Fox TV series The Goodwin Games as Jimmy Goodwin. In 2014, he was in Transformers: Age of Extinction and he voiced the character of Fred in the superhero CGI film Big Hero 6. He voiced Augie in the 2015 animated film Hell and Back. In 2015, he was part of Funny or Die's Oddball Comedy and Curiosity Festival, a touring show which included Amy Schumer, Aziz Ansari, and other comics.\n\nFrom 2014 to 2017, he starred as Erlich Bachman in the HBO sitcom Silicon Valley for which he won the Critics' Choice Television Award for Best Supporting Actor in a Comedy Series in 2015. In 2016, he starred in the movie Search Party with Adam Pally and the movie Office Christmas Party.\n\nOn June 17, 2017, HBO premiered his hour-long stand-up special, T.J. Miller: Meticulously Ridiculous, which was filmed in Miller's native Denver at the end of his 2016 Meticulously Ridiculous Tour. In October 2017, Miller began his \"Touring In Perpetuity Tour\", a self described \"One Man Philosophy Circus.\"\n\nIn 2018, he played the role of I-R0K in the film Ready Player One, directed by Steven Spielberg. As a commercial actor, he voiced a talking ball of mucus in commercials for Mucinex and starred as Greg the Genie in a promo campaign for Slim Jim meat snacks.\n\nHe hosted a podcast with friend and fellow comedian Cash Levy, titled Cashing in With TJ Miller, which began airing in March 2012 on the Nerdist Network. He is also a frequent guest on Doug Benson's podcast Doug Loves Movies."
        },
        {
            "id": 1484586,
            "name": "Nadia Hallgren",
            "image": "/7qmAAPkxa0BP1U9jWpSMdDpKPGK.jpg",
            "birth_date": null,
            "biography": "Nadia Hallgren is an award-winning Director and Cinematographer. Nadia shot and directed 2020's Becoming, a documentary about former First Lady Michelle Obama, which was released on Netflix and has been nominated for four Emmys including Best Director, Best Cinematographer and Best Documentary Feature. After Maria (2019), a documentary short, tells the story of three mothers displaced by Hurricane Maria. It was shortlisted for an Academy Award in 2019. Nadia won the special jury prize at SXSW 2018 for 2017's She’s the Ticket, an independent episodic series about women running for office.\n\nHer cinematography credits include the Sundance award-winner Motherland, Academy Award-nominated and Sundance Grand Jury Prize-winner Trouble the Water, and Sundance award-winner Trapped. Nadia is currently in production on a documentary on Civil Rights Attorney Benjamin Crump who is representing the families of George Floyd, Ahmaud Arbery and Breonna Taylor. A native of The Bronx and a graduate of the International Center of Photography, Nadia is also a member of the Academy of Motion Picture Arts and Sciences."
        },
        {
            "id": 964843,
            "name": "Michelle Obama",
            "image": "/aoumtex4PjUmG2sYp3VaLrarmBl.jpg",
            "birth_date": "1964-01-17",
            "biography": "Michelle LaVaughn Robinson Obama (born January 17, 1964), an American lawyer and writer, is the wife of the 44th President of the United States, Barack Obama, and the first African-American First Lady of the United States. Raised on the South Side of Chicago, she is a graduate of Princeton University and Harvard Law School, and spent the early part of her legal career working at the law firm Sidley Austin, where she met her future husband. Subsequently, she worked as part of the staff of Chicago mayor Richard M. Daley, and for the University of Chicago Medical Center. Throughout 2007 and 2008, she helped campaign for her husband's presidential bid. She delivered a keynote address at the 2008 Democratic National Convention and also spoke at the 2012 Democratic National Convention. She is the mother of Malia and Natasha (Sasha). As the wife of a senator, and later the first lady, she has become a fashion icon and role model for women, and an advocate for poverty awareness, nutrition, and healthy eating."
        },
        {
            "id": 102786,
            "name": "Barack Obama",
            "image": "/cm19WyxzcqcaAO7bLVEQROrqY9c.jpg",
            "birth_date": "1961-08-04",
            "biography": "Barack Hussein Obama II is an American politician who served as the 44th president of the United States from 2009 to 2017. A member of the Democratic Party, Obama was the first African-American president of the United States."
        },
        {
            "id": 1837786,
            "name": "Phoebe Robinson",
            "image": "/56G9cQ8azq1Gnss97F9BO95uho.jpg",
            "birth_date": "1984-09-28",
            "biography": "Phoebe Robinson (born September 28, 1984) is an American comedian, New York Times best-selling writer, and actress based in New York City."
        },
        {
            "id": 2346797,
            "name": "Sasha Obama",
            "image": "/nq1j9H5LW9LlAPv7HNsYkzNFZqD.jpg",
            "birth_date": "2001-06-10",
            "biography": ""
        },
        {
            "id": 2024791,
            "name": "Malia Ann",
            "image": "/dvI3wtLmXNaxLV86S5uD7Nylcbh.jpg",
            "birth_date": "1998-07-04",
            "biography": "Malia Ann Obama (born 4 July 1998; Chicago) is a writer and director, known for The Heart (2023), Swarm (2023)."
        },
        {
            "id": 13309,
            "name": "Oprah Winfrey",
            "image": "/nNpYieaDLxKZWw2FY9wsDkjwURu.jpg",
            "birth_date": "1954-01-29",
            "biography": "Oprah Gail Winfrey (born Orpah Gail Winfrey; January 29, 1954), also known mononymously as Oprah, is an American talk show host, television producer, actress, author, and media proprietor. She is best known for her talk show, The Oprah Winfrey Show, broadcast from Chicago, which ran in national syndication for 25 years, from 1986 to 2011. Dubbed the \"Queen of All Media\", she was the richest African-American of the 20th century and was once the world's only black billionaire. By 2007, she was often ranked as the most influential woman in the world."
        },
        {
            "id": 2127,
            "name": "James Wan",
            "image": "/bNJccMIKzCtYnndcOKniSKCzo5Y.jpg",
            "birth_date": "1977-02-26",
            "biography": "James Wan (born 26 February 1977) is a Malaysia-born Australian film director, screenwriter, producer, and comic book writer. He has primarily worked in the horror genre as the co-creator of the \"Saw\" and \"Insidious\" franchises and the creator of \"The Conjuring\" universe. Wan is also the founder of Atomic Monster, which has produced film and television projects.\n\nAfter directing the micro-budget film \"Stygian\" (2000), Wan made his professional feature directorial debut with \"Saw\" (2004). The film was a hit and launched a franchise that has grossed more than $1 billion globally. Following a period of setbacks with the underperforming titles \"Dead Silence\" and \"Death Sentence\" (both 2007), Wan returned to commercial success with the PG-13 supernatural horror-fantasy \"Insidious\" (2010), and went on to direct \"Insidious: Part 2\" (2013) and to produce further sequels in the series. In between his two \"Insidious\" projects, Wan directed the more traditional supernatural horror film \"The Conjuring\" (2013), which achieved enormous critical and commercial success and spawned a sprawling set of sequels and spin-offs collectively known as The Conjuring Universe. Wan served as the director of \"The Conjuring 2\" (2016) while producing subsequent films in the franchise such as \"Annabelle\" (2014) and \"The Nun\" (2018). The Conjuring Universe is the second highest-grossing horror franchise at over $2 billion.\n\nOutside of horror, Wan directed \"Furious 7\" (2015), the seventh installment in the \"Fast & Furious\" franchise, and the DC Extended Universe superhero film \"Aquaman\" (2018). Both grossed over $1 billion, making Wan the eighth director with two films to reach the milestone. He is the 20th highest-grossing director of all time as of 2021, with his films having grossed over $3.6 billion worldwide."
        },
        {
            "id": 117642,
            "name": "Jason Momoa",
            "image": "/6dEFBpZH8C8OijsynkSajQT99Pb.jpg",
            "birth_date": "1979-08-01",
            "biography": "Joseph Jason Namakaeha Momoa (born August 1, 1979) is an American actor and filmmaker. He made his acting debut as Jason Ioane on the syndicated action drama series Baywatch: Hawaii (1999–2001), which was followed by his portrayal of Ronon Dex on the Syfy science fiction series Stargate Atlantis (2005–2009), Khal Drogo in the first two seasons of the HBO fantasy drama series Game of Thrones (2011–2012), Declan Harp on the Discovery Channel historical drama series Frontier (2016–2018), and Baba Voss on the Apple TV+ science fiction series See (2019–present). Momoa was featured as the lead of the two lattermost series.\n\nSince 2016, Momoa portrays Arthur Curry / Aquaman in the DC Extended Universe (DCEU), headlining the eponymous 2018 film and its 2023 sequel. Momoa also played Duncan Idaho in the 2021 film adaptation of the science fiction novel Dune.\n\nDescription above from the Wikipedia article Jason Momoa, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 55085,
            "name": "Amber Heard",
            "image": "/Ah08MAZFDM9LecmHxkmy64eKuzJ.jpg",
            "birth_date": "1986-04-22",
            "biography": "Amber Laura Heard (born April 22, 1986) is an American film and television actress. After a series of small roles in film and television, Heard had her first starring role in the horror film All the Boys Love Mandy Lane (2006). She first gained mainstream recognition for supporting roles in the action film Never Back Down (2008) and the comedy Pineapple Express (2008). In the following years, she appeared in films such as The Joneses (2009), The Ward (2010), The Rum Diary (2011), Drive Angry (2011), Machete Kills (2013) and Magic Mike XXL (2015).\n\nIn 2017, Heard joined the DC Extended Universe to play Atlantean queen Mera in superhero films Justice League (2017), Aquaman (2018), and Zack Snyder's Justice League (2021). In addition to acting, Heard has been a global spokesperson for the cosmetics giant L'Oréal Paris since 2018. She also engages in human rights activism."
        },
        {
            "id": 5293,
            "name": "Willem Dafoe",
            "image": "/ui8e4sgZAwMPi3hzEO53jyBJF9B.jpg",
            "birth_date": "1955-07-22",
            "biography": "William James \"Willem\" Dafoe (born July 22, 1955) is an American actor. He is the recipient of various accolades, including the Volpi Cup for Best Actor, in addition to receiving nominations for four Academy Awards, four Screen Actors Guild Awards, three Golden Globe Awards, and a British Academy Film Award. He frequently collaborates with filmmakers Paul Schrader, Abel Ferrara, Lars von Trier, Julian Schnabel,  Wes Anderson, and Robert Eggers.\n\nDafoe was an early member of experimental theater company The Wooster Group. He made his film debut in Heaven's Gate (1980), but was fired during production. He had his first leading role in the outlaw biker film The Loveless (1982) and then played the main antagonist in Streets of Fire (1984) and To Live and Die in L.A. (1985). He received his first Academy Award nomination (as Best Supporting Actor) for his role as Sergeant Elias Grodin in Oliver Stone's war film Platoon (1986). In 1988, Dafoe played Jesus in Martin Scorsese's The Last Temptation of Christ and costarred in Mississippi Burning, both of which were controversial.\n\nAfter receiving his second Academy Award nomination (as Best Supporting Actor) for portraying Max Schreck in Shadow of the Vampire (2000), Dafoe portrayed the supervillain Norman Osborn / Green Goblin in the superhero film Spider-Man (2002), a role he reprised in its sequels Spider-Man 2 (2004) and Spider-Man 3 (2007), and the Marvel Cinematic Universe film Spider-Man: No Way Home (2021) earning him the Guinness World Record for the \"longest career as a live-action Marvel character\". He also portrayed the villains in Once Upon a Time in Mexico (2003) and XXX: State of the Union (2005), as well as Carson Clay in the film Mr. Bean's Holiday (2007). In 2009, he starred in the experimental film Antichrist, one of his three films with Lars von Trier. Dafoe then appeared in The Fault in Our Stars, John Wick, The Grand Budapest Hotel (all 2014), The Great Wall (2016), Murder on the Orient Express (2017), The Florida Project (2017) (for which he received his third Academy Award nomination in the Best Supporting Actor category), The Lighthouse (2019), The French Dispatch, and Nightmare Alley (both 2021). He portrayed Nuidis Vulko in the DC Extended Universe films Aquaman (2018), Zack Snyder's Justice League (2021) and Aquaman and the Lost Kingdom (2022).\n\nDafoe has portrayed several real-life figures, including T. S. Eliot in Tom & Viv (1994), Pier Paolo Pasolini in Pasolini (2014), Vincent van Gogh in At Eternity's Gate (2018) (for which he received an Academy Award for Best Actor nomination, his first in that category), and Leonhard Seppala in Togo (2019)."
        },
        {
            "id": 17178,
            "name": "Patrick Wilson",
            "image": "/tc1ezEfIY8BhCy85svOUDtpBFPt.jpg",
            "birth_date": "1973-07-03",
            "biography": "Patrick Joseph Wilson (born July 3, 1973) is an American actor, director, and singer. He began his career in 1995, starring in Broadway musicals. He is a two-time Tony Award nominee for his roles in The Full Monty (2000–2001) and Oklahoma! (2002). He co-starred in the acclaimed HBO miniseries Angels in America (2003), for which he was nominated for both the Golden Globe Award and Primetime Emmy Award for Outstanding Supporting Actor in a Miniseries or a Movie.\n\nWilson has also appeared in films such as The Phantom of the Opera (2004), Hard Candy (2005), Little Children (2006), Watchmen (2009), Insidious (2010), The A-Team (2010), Insidious: Chapter 2 (2013), and as demonologist Ed Warren in the Conjuring Universe (2013–present). He has earned a reputation as a \"scream king\" due to his frequent casting in horror films.\n\nOn television, Wilson starred in the CBS drama series A Gifted Man (2011–2012) and as Lou Solverson in the second season of FX's anthology series Fargo (2015), for which he received a second Golden Globe Award nomination. In the DC Extended Universe, he portrayed Orm Marius / Ocean Master in the superhero film Aquaman (2018) and voiced the U.S. President in Batman v Superman: Dawn of Justice (2016).\n\nDescription above from the Wikipedia article Patrick Wilson (American actor), licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 2227,
            "name": "Nicole Kidman",
            "image": "/5Yn5GAxJavlxW05nPwvYFvRnwQ7.jpg",
            "birth_date": "1967-06-20",
            "biography": "Nicole Mary Kidman AC (born June 20, 1967) is an American-Australian actress and producer. Known for her work across various film and television productions from several genres, she has consistently ranked among the world's highest-paid actresses. She is the recipient of numerous accolades, including an Academy Award, a British Academy Film Award, two Primetime Emmy Awards and six Golden Globe Awards.\n\nKidman began her acting career in Australia with the 1983 films Bush Christmas and BMX Bandits. Her breakthrough came in 1989 with the thriller film Dead Calm and the miniseries Bangkok Hilton. In 1990, she achieved international success with the action film Days of Thunder. She received greater recognition with lead roles in Far and Away (1992), Batman Forever (1995), To Die For (1995) and Eyes Wide Shut (1999). For her portrayal of writer Virginia Woolf in the drama The Hours (2002), Kidman won the Academy Award for Best Actress. She received additional Academy Award nominations for her roles in the musical Moulin Rouge! (2001) and the dramas Rabbit Hole (2010), Lion (2016) and Being the Ricardos (2021).\n\nKidman's television roles include Hemingway & Gellhorn (2012), Big Little Lies (2017–2019), Top of the Lake: China Girl (2017), The Undoing (2020) and Nine Perfect Strangers (2021). For Big Little Lies, she received two Primetime Emmy Awards, one for Outstanding Lead Actress and the other for Outstanding Limited Series as an executive producer.\n\nKidman has served as a Goodwill Ambassador for UNICEF since 1994 and for UNIFEM since 2006. In 2006, she was appointed Companion of the Order of Australia. She was married to actor Tom Cruise from 1990 to 2001 and has been married to country music singer Keith Urban since 2006. In 2010, she founded the production company Blossom Films. In 2004 and 2018, Time magazine included her on its list of the 100 most influential people in the world, and in 2020, The New York Times named her one of the greatest actors of the 21st century.\n\nDescription above from the Wikipedia article Nicole Kidman, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 16644,
            "name": "Dolph Lundgren",
            "image": "/3MqLWHnFFNGLEOQFlGrIE3rra85.jpg",
            "birth_date": "1957-11-03",
            "biography": "Hans Lundgren (born 3 November 1957), better known as Dolph Lundgren, is a Swedish actor, filmmaker, and martial artist. Lundgren's breakthrough came in 1985, when he starred in Rocky IV as the imposing Soviet boxer Ivan Drago. Since then, he has starred in more than 69 films, almost all of them in the action genre.\n\nLundgren received a degree in chemical engineering from the Royal Institute of Technology in the early 1980s and a master's degree in chemical engineering from the University of Sydney in 1982. He holds the rank of 4th dan black belt in Kyokushin karate and was European champion in 1980–81. While in Sydney, he became a bodyguard for Jamaican singer Grace Jones and began a relationship with her. He received a Fulbright scholarship to MIT and moved to Boston. Jones convinced him to leave the university and move to New York City to be with her and begin acting, where, after a short stint as a model and bouncer at the Manhattan nightclub The Limelight, Lundgren got a small debut role as a KGB henchman in the James Bond film A View to a Kill.\n\nAfter appearing in Rocky IV, Lundgren portrayed He-Man in the 1987 science fantasy film Masters of the Universe, Lt. Rachenko in Red Scorpion (1988) and Frank Castle in the 1989 film The Punisher. Throughout the 1990s he appeared in films such as I Come in Peace (1990), Cover Up (1991), Showdown in Little Tokyo (1991), Universal Soldier film series (1992, 2009, 2012), Joshua Tree (1993), Pentathlon (1994), Men of War (1994), Johnny Mnemonic (1995), The Shooter (1995), Silent Trigger (1996), The Peacekeeper (1997), and Blackjack (1998). In 2004 he directed his first film, The Defender, and subsequently directed The Mechanik (2005), Missionary Man (2007), Command Performance (2009), and Icarus (2010), also starring in all of them.\n\nAfter a long spell performing in direct-to-video films since 1995, Lundgren returned to Hollywood in 2010 with the role of Gunnar Jensen in The Expendables, alongside Sylvester Stallone and an all-action star cast. He reprised his role in The Expendables 2 (2012) and The Expendables 3 (2014). Also in 2014, he co-starred in Skin Trade, an action thriller about human trafficking he co-wrote and produced. He reprised his role of Ivan Drago in Creed II (2018), and is due to reprise his role as Gunner Jensen in The Expendables 4. He appears in Sharknado 5: Global Swarming (2017), playing the protagonist's son Gil as an adult, and in Aquaman (2018), playing the father of Mera. He also had a recurring role in the fifth season of Arrow."
        },
        {
            "id": 3556,
            "name": "Roman Polanski",
            "image": "/yHwHSXdZatkoLgIjPeW14GKlrZs.jpg",
            "birth_date": "1933-08-18",
            "biography": "Roman Polański (born 18 August 1933) is a Polish-French film director, producer, writer and actor. Born in Paris to Polish parents, Polański relocated with his family to Poland in 1937. After surviving the Holocaust, he continued his education in Poland and became a critically acclaimed director of both art house and commercial films. Polański's first feature-length film, Knife in the Water (1962), made in Poland, was nominated for an Academy Award for Best Foreign Language Film. He has since received five more Oscar nominations, and in 2002 received the Academy Award for Best Director for his film, The Pianist. He has also been the recipient of two Baftas, four Césars, a Golden Globe and the Palme d'Or. He left Poland in 1961 to live in France for several years, then moved to the United Kingdom where he collaborated with Gérard Brach on three films, beginning with Repulsion (1965). In 1968 he moved to the United States, immediately cementing his burgeoning directing status with the 1968 groundbreaking Academy Award winning horror film Rosemary's Baby.\n\nIn 1969, Polański's pregnant wife, Sharon Tate, was murdered while staying at the Polański's Benedict Canyon home above Los Angeles by members of the Manson Family. Following Tate's death, Polański returned to Europe and spent much of his time in Paris and Gstaad, but did not make another film until he filmed Macbeth (1971) in England. The following year he went to Italy to make What? (1973) and subsequently spent the next five years living near Rome. However, he traveled to Hollywood to direct Chinatown (1974) for Paramount Pictures, with Robert Evans serving as producer. The film was nominated for eleven Academy Awards, and was a critical and box-office success; the script by Robert Towne won for Best Original Screenplay. Polański's next film, The Tenant (1976), was shot in France, and completed the \"Apartment Trilogy\", following Repulsion and Rosemary's Baby.\n\nIn 1977, after a photo shoot in Los Angeles, Polański was arrested for the sexual abuse of a 13 year old girl. He was charged with rape but pleaded guilty to unlawful sex with a minor. To avoid sentencing, Polański fled to his home in London, and then moved on to France the following day. He has had a U.S. arrest warrant outstanding since then, and an international arrest warrant since 2005.\n\nPolański continued to make films such as The Pianist (2002), a World War II-set adaptation of Jewish-Polish musician Władysław Szpilman's autobiography of the same name, which echoed some of Polański's earlier life experiences. Like Szpilman, Polański escaped the ghetto and the concentration camps while family members were killed. The film won three Academy Awards including Best Director, the Cannes Film Festival's Palme d'Or, and seven French César Awards including Best Picture and Best Director. He then released the successful films Oliver Twist (2005), To Each His Own Cinema (2007), and The Ghost Writer (2010), completed while under house arrest.\n\nIn September 2009, Polański was arrested by Swiss police, at the request of U.S. authorities, when he traveled to receive a lifetime achievement award at the Zurich Film Festival. In October 2009, the U.S. requested his extradition; however, on July 12, 2010, the Swiss rejected that request and instead declared him a \"free man\" after releasing him from custody."
        },
        {
            "id": 514,
            "name": "Jack Nicholson",
            "image": "/b4da3H3YmAnlNCQPxdvzJfxaWXX.jpg",
            "birth_date": "1937-04-22",
            "biography": "John Joseph \"Jack\" Nicholson (born April 22, 1937) is an American actor, film director, producer and writer. He is renowned for his often dark-themed portrayals of neurotic characters. Nicholson has been nominated for Academy Awards 12 times. He has won the Academy Award for Best Actor twice, for One Flew Over the Cuckoo's Nest and for As Good as It Gets. He won the Academy Award for Best Supporting Actor for the 1983 film Terms of Endearment. He is tied with Walter Brennan for most acting wins by a male actor (three), and second to Katharine Hepburn for most acting wins overall (four).\n\nHe is also one of only two actors nominated for an Academy Award for acting (either lead or supporting) in every decade from the 1960s to 2000s (the other one being Michael Caine). He has won seven Golden Globe Awards, and received a Kennedy Center Honor in 2001. In 1994, he became one of the youngest actors to be awarded the American Film Institute's Life Achievement Award. Notable films in which he has starred include, in chronological order, Easy Rider, Five Easy Pieces, Chinatown, One Flew Over the Cuckoo's Nest, The Shining, The Postman Always Rings Twice, Reds, Terms of Endearment, Batman, A Few Good Men, As Good as It Gets, About Schmidt, Something's Gotta Give and The Departed.\n\nDescription above from the Wikipedia article Jack Nicholson, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 6450,
            "name": "Faye Dunaway",
            "image": "/bwHJPkiDOjTslgrl0mri1Ndvx2V.jpg",
            "birth_date": "1941-01-14",
            "biography": "Dorothy Faye Dunaway (born January 14, 1941) is an American actress. She is the recipient of such accolades as an Academy Award, three Golden Globes, and a British Academy Film Award.\n\nHer career began in the early 1960s on Broadway. She made her screen debut in the 1967 film The Happening, and rose to fame that same year with her portrayal of outlaw Bonnie Parker in Arthur Penn's Bonnie and Clyde, for which she received her first Academy Award nomination. Her most notable films include the crime caper The Thomas Crown Affair (1968), the drama The Arrangement (1969), the revisionist western Little Big Man (1970), an adaptation of the Alexandre Dumas classic The Three Musketeers (1973), the neo-noir mystery Chinatown (1974), for which she earned her second Oscar nomination, the action-drama disaster The Towering Inferno (1974), the political thriller Three Days of the Condor (1975), the satire Network (1976), for which she won an Academy Award for Best Actress, and the thriller Eyes of Laura Mars (1978).\n\nHer career evolved to more mature and character roles in subsequent years, often in independent films, beginning with her controversial portrayal of Joan Crawford in the 1981 film Mommie Dearest. Other notable films in which she has appeared include Barfly (1987), The Handmaid's Tale (1990), Arizona Dream (1994), Don Juan DeMarco (1995), The Twilight of the Golds (1997), Gia (1998) and The Rules of Attraction (2002). Dunaway also performed on stage in several plays including A Man for All Seasons (1961–63), After the Fall (1964), Hogan's Goat (1965–67), A Streetcar Named Desire (1973) and was awarded the Sarah Siddons Award for her portrayal of opera singer Maria Callas in Master Class (1996).\n\nDescription above from the Wikipedia article Faye Dunaway, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 6593,
            "name": "John Huston",
            "image": "/3uwPuwZxYSdYaNJA3e4ZmOH1LWY.jpg",
            "birth_date": "1906-08-05",
            "biography": "John Marcellus Huston (August 5, 1906 – August 28, 1987) was an American film director, screenwriter, actor, and visual artist. He wrote the screenplays for most of the 37 feature films he directed, many of which are today considered classics: The Maltese Falcon (1941), The Treasure of the Sierra Madre (1948), The Asphalt Jungle (1950), The African Queen (1951), The Misfits (1961), Fat City (1972), The Man Who Would Be King (1975) and Prizzi's Honor (1985).\n\nIn his early years, Huston studied and worked as a fine art painter in Paris. He explored the visual aspects of his films throughout his career, sketching each scene on paper beforehand, then carefully framing his characters during the shooting. While most directors rely on post-production editing to shape their final work, Huston instead created his films while they were being shot, with little editing needed. Some of Huston's films were adaptations of important novels, often depicting an \"heroic quest,\" as in Moby Dick, or The Red Badge of Courage. In many films, different groups of people, while struggling toward a common goal, would become doomed, forming \"destructive alliances,\" giving the films a dramatic and visual tension. Many of his films involved themes such as religion, meaning, truth, freedom, psychology, colonialism, and war.\n\nHuston has been referred to as \"a titan\", \"a rebel\", and a \"renaissance man\" in the Hollywood film industry. Author Ian Freer describes him as \"cinema's Ernest Hemingway\"—a filmmaker who was \"never afraid to tackle tough issues head on.\" During his 46-year career, Huston received 15 Oscar nominations, winning twice. He directed both his father, Walter Huston, and daughter, Anjelica Huston, to Oscar wins.\n\nDescription above from the Wikipedia article John Huston, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 12295,
            "name": "Perry Lopez",
            "image": "/rQXvA13yB182uYVZ1ziHDe6ECV0.jpg",
            "birth_date": "1929-07-22",
            "biography": "​From Wikipedia, the free encyclopedia.  \n\nPerry Lopez (July 22, 1929 - February 14, 2008) was an American film and television actor. His acting career lasted over 40 years before his death in 2008.\n\nLopez was born in New York City. Lopez began his acting career on in theater, based in New York. He was signed to a contract at Warner Bros. Studios in 1955. Lopez appeared in a number of B-movies and Westerns early on in his career, including the Creature from the Black Lagoon, Young Guns and The Lone Ranger.\n\nLopez was, perhaps, best known as Lieutenant Lou Escobar in the 1974 film Chinatown, which he starred in opposite Jack Nicholson and Faye Dunaway. He reprised the role sixteen years later (with Escobar promoted to Captain) in The Two Jakes in 1990.\n\nAmong his many television appearances, one of his more well-known roles is that of Esteban Rodriguez in the classic Star Trek episode \"Shore Leave\". Lopez also appeared in an episode of Bonanza, as the cold-blooded outlaw Duke Miller, who kills a man over being first in line to get a haircut. He was Joaquín Castañeda, a mestizo that fought to free his people, on El Zorro, starring Guy Williams. Lopez also appeared in episode 14, \"Night Of The Long Knives\" originally airing December 16, 1966 of The Time Tunnel television series, in the Voyage to the Bottom of the Sea -episode \"Savage Jungle\" and played Pvt. Petuko in Kelly's Heroes (1970).\n\nLopez died of lung cancer in at The Rehabilitation Centre of Beverly Hills in Beverly Hills, California at age 78. He was survived by several nieces and nephews.\n\nDescription above from the Wikipedia article   licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 12296,
            "name": "John Hillerman",
            "image": "/zRuuhcWG1jjzZaQaeUEV76guU7D.jpg",
            "birth_date": "1932-12-20",
            "biography": "John Benedict Hillerman (December 20, 1932 – November 9, 2017) was an American actor best known for his starring role as Jonathan Quayle Higgins III on the television series Magnum, P.I. that aired from 1980 to 1988. For his role as Higgins, Hillerman earned five Golden Globe nominations, winning in 1981, and four Emmy nominations, winning in 1987.\n\nDescription above from the Wikipedia article John Hillerman, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 6587,
            "name": "Diane Ladd",
            "image": "/l09hDywACsXFkmSy7d8V2YJiRNW.jpg",
            "birth_date": "1932-11-29",
            "biography": "From Wikipedia, the free encyclopedia\n\nDiane Ladd (born November 29, 1935) is an American actress, film director, producer and published author. She has appeared in over 120 roles, on television, and in miniseries and feature films, including Alice Doesn't Live Here Anymore (1974), Wild at Heart (1990), Rambling Rose (1991), Ghosts of Mississippi, Primary Colors, 28 Days (2000), and American Cowslip (2008). Twice divorced and currently married, Ladd is the mother of actress Laura Dern by ex-husband actor Bruce Dern.\n\nDescription above from the Wikipedia article Diane Ladd, licensed under CC-BY-SA, full list of contributors on Wikipedia. ​"
        },
        {
            "id": 7467,
            "name": "David Fincher",
            "image": "/yV36WTsLBAGyYVUQshNdI8hyk9l.jpg",
            "birth_date": "1962-08-28",
            "biography": "David Andrew Leo Fincher (born August 28, 1962) is an American film director. His films, mostly thrillers, have received 40 nominations at the Academy Awards, including three for him as Best Director.\n\nBorn in Denver, Colorado, Fincher was interested in filmmaking at an early age. He directed numerous music videos, most notably Madonna's \"Express Yourself\" in 1989 and \"Vogue\" in 1990, both of which won him the MTV Video Music Award for Best Direction. He made his feature film debut with Alien 3 (1992), which garnered mixed reviews, followed by the thriller Seven (1995), which was better received. Fincher found lukewarm success with The Game (1997) and Fight Club (1999), but the latter eventually became a cult classic. In 2002, he returned to prominence with the thriller Panic Room starring Jodie Foster.\n\nFincher also directed Zodiac (2007), The Social Network (2010), The Girl with the Dragon Tattoo (2011), and Mank (2020). For The Social Network, he won the Golden Globe Award for Best Director and BAFTA Award for Best Direction. His biggest commercial successes are The Curious Case of Benjamin Button (2008) and Gone Girl (2014), both of which grossed more than $300 million worldwide, with the former earning thirteen nominations at the Academy Awards, and eleven at the British Academy Film Awards.\n\nHe also served as an executive producer and director for the Netflix series House of Cards (2013–2018) and Mindhunter (2017–2019), winning the Primetime Emmy Award for Outstanding Directing for a Drama Series for the pilot episode of House of Cards. Fincher was the co-founder of Propaganda Films, a film, and music."
        },
        {
            "id": 192,
            "name": "Morgan Freeman",
            "image": "/jPsLqiYGSofU4s6BjrxnefMfabb.jpg",
            "birth_date": "1937-06-01",
            "biography": "Morgan Freeman (born June 1, 1937) is an American actor, director, and narrator. Noted for his distinctive deep voice, Freeman is known for his various roles in a wide variety of film genres. Throughout his career spanning over five decades, he has received multiple accolades, including an Academy Award, a Screen Actors Guild Award, and a Golden Globe Award.\n\nBorn in Memphis, Tennessee, Freeman was raised in Mississippi where he began acting in school plays. He studied theatre arts in Los Angeles and appeared in stage productions in his early career. He rose to fame in the 1970s for his role in the children's television series The Electric Company. Freeman then appeared in the Shakespearean plays Coriolanus and Julius Caesar, the former of which earned him an Obie Award. His breakout role was in Street Smart (1987), playing a hustler, which earned him an Academy Award nomination for Best Supporting Actor. He achieved further stardom in Glory, the biographical drama Lean on Me, and comedy-drama Driving Miss Daisy (all 1989), the latter of which garnered him his first Academy Award nomination for Best Actor.\n\nIn 1992, Freeman starred alongside Clint Eastwood in the western revenge film Unforgiven; this would be the first of several collaborations with Eastwood. In 1994, he starred in the prison drama The Shawshank Redemption for which he received another Academy Award nomination. Freeman also starred in David Fincher's crime thriller Se7en (1995), and Steven Spielberg's historical drama Amistad (1997). Freeman won the Academy Award for Best Supporting Actor for his performance in Clint Eastwood's 2004 sports drama Million Dollar Baby. In 2009, he received his fifth Oscar nomination for playing former South African President Nelson Mandela in Eastwood's Invictus. Freeman is also known for his performance as Lucius Fox in Christopher Nolan's The Dark Knight Trilogy (2005–2012).\n\nIn addition to acting, Freeman has directed the drama Bopha! (1993). He also founded film production company Revelations Entertainment with business partner Lori McCreary. He is the recipient of the Kennedy Center Honor, the AFI Life Achievement Award, the Cecil B. DeMille Award, and the Screen Actors Guild Life Achievement Award. For his performances in theatrical productions, he has won three Obie Awards, one of the most prestigious honors for recognizing excellence in theatre.\n\nDescription above from the Wikipedia article Morgan Freeman, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 287,
            "name": "Brad Pitt",
            "image": "/eAOtKAc4p2C3DV8TGJQJzw8DeRv.jpg",
            "birth_date": "1963-12-18",
            "biography": "William Bradley Pitt (born December 18, 1963) is an American actor and film producer. He is the recipient of various accolades, including an Academy Award, a British Academy Film Award, and two Golden Globe Awards for his acting, in addition to a second Academy Award, a second British Academy Film Award, a third Golden Globe Award, and a Primetime Emmy Award as a producer under his production company, Plan B Entertainment.\n\nPitt first gained recognition as a cowboy hitchhiker in the road film Thelma & Louise (1991). His first leading roles in big-budget productions came with the drama films A River Runs Through It (1992) and Legends of the Fall (1994), and the horror film Interview with the Vampire (1994). He gave critically acclaimed performances in the crime thriller Seven (1995) and the science fiction film 12 Monkeys (1995), the latter earning him a Golden Globe Award for Best Supporting Actor and an Academy Award nomination.\n\nPitt starred in Fight Club (1999) and the heist film Ocean's Eleven (2001), as well as its sequels, Ocean's Twelve (2004) and Ocean's Thirteen (2007). His greatest commercial successes have been Ocean's Eleven (2001), Troy (2004), Mr. & Mrs. Smith (2005), World War Z (2013), and Once Upon a Time in Hollywood (2019), for which he won a second Golden Globe Award and the Academy Award for Best Supporting Actor. Pitt's other Academy Award nominated performances were in The Curious Case of Benjamin Button (2008) and Moneyball (2011). He produced The Departed (2006) and 12 Years a Slave (2013), both of which won the Academy Award for Best Picture, and also The Tree of Life (2011), Moneyball (2011) and The Big Short (2015), all of which were nominated for Best Picture. Pitt is the second actor to have won Academy Awards for both Best Supporting Actor and Best Picture.\n\nIn a court filing in Los Angeles, filed as part of a legal battle over a winery the prominent Hollywood actors once owned together, lawyers for Ms. Jolie stated that negotiations to sell her share of the business to Mr. Pitt had broken down over his demand that she sign “a nondisclosure agreement that would have contractually prohibited her from speaking outside of court about Pitt’s physical and emotional abuse of her and their children.”\n\nHer filing goes on to describe an extended physical and verbal outburst in September 2016 as Mr. Pitt, Ms. Jolie and their six children flew from France to California. “Pitt choked one of the children and struck another in the face” and “grabbed Jolie by the head and shook her,” the filing states, adding that at one point “he poured beer on Jolie; at another, he poured beer and red wine on the children.”"
        },
        {
            "id": 12052,
            "name": "Gwyneth Paltrow",
            "image": "/slPWN0VvYJtNOEuxlFSsXSNQMaF.jpg",
            "birth_date": "1972-09-27",
            "biography": "Gwyneth Kate Paltrow (born September 27, 1972) is an American actress and businesswoman. She is the recipient of various accolades, including an Academy Award, a Golden Globe Award, and a Primetime Emmy Award.\n\nPaltrow gained notice for her early work in films such as Seven (1995), Emma (1996), Sliding Doors (1998), and A Perfect Murder (1998). She garnered wider acclaim for her performance as Viola de Lesseps in the historical romance Shakespeare in Love (1998) which won her several awards, including the Academy Award for Best Actress. This was followed by roles in The Talented Mr. Ripley (1999), The Royal Tenenbaums (2001), Shallow Hal (2001), and Sky Captain and the World of Tomorrow (2004).\n\nAfter becoming a parent in 2004, Paltrow significantly reduced her acting workload. She made occasional appearances in films, such as the drama Proof (2005), which earned her a nomination for a Golden Globe Award for Best Actress. In 2009, she received a Grammy Award nomination for Best Spoken Word Album for Children for the children's audiobook Brown Bear and Friends. In addition, she won a Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series for her guest role as Holly Holliday on the Fox musical television series Glee in 2011. From 2008 to 2019, she portrayed Pepper Potts in the Marvel Cinematic Universe.\n\nBeginning in 1995, Paltrow has been the face of Estée Lauder's Pleasures perfume; she was previously the face of the American fashion brand Coach. She is the founder and CEO of the lifestyle company Goop, which has been criticized for promoting pseudoscience, and has authored several cookbooks."
        },
        {
            "id": 12055,
            "name": "John Cassini",
            "image": "/kn2Rtn0I8ivCR7ydZTY74XUBh1K.jpg",
            "birth_date": null,
            "biography": "​From Wikipedia, the free encyclopedia.  \n\nJohn Cassini (born at Toronto) is a Canadian actor who played the role of Officer Davis in the 1995 Brad Pitt film, Se7en. He also starred in the 2005 film Cool Money. Cassini starred as Ronnie Delmarco on the CBC series, Intelligence. On March 7, 2008, the CBC announced that Intelligence would be cancelled. Cassini appeared in and is listed as a producer of the film \"Guido Superstar: The Rise of Guido\", starring, produced, and directed by Silvio Pollio, including, Nicholas Lea, Terry Chen, and Michael Eklund. The film screened at the 2010 Vancouver International Film Festival Thursday, Oct. 7 at 9:45 p.m. and Friday, Oct. 8, at 10:45 a.m., both at the Empire Granville 7 in downtown Vancouver, BC.  Cassini is an Italian citizen\n\nDescription above from the Wikipedia article John Cassini,  licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 30487,
            "name": "Peter Crombie",
            "image": "/pMvhE1wwQo3eTSp4vwq8Hb22CwN.jpg",
            "birth_date": "1952-06-26",
            "biography": "Peter B. Crombie (born June 26, 1952 - January 11, 2024) is an American film and television actor."
        },
        {
            "id": 38951,
            "name": "Reg E. Cathey",
            "image": "/cgyJJQUdbK4S7ihkL9hgIIwutk3.jpg",
            "birth_date": "1958-08-18",
            "biography": "Reginald Eurias Cathey (August 18, 1958 – February 9, 2018) was an American character actor. He was best known for his roles as Norman Wilson in The Wire, Martin Querns in Oz, the game show announcer in Square One Television, Dr. Franklin Storm in the 2015 reboot of Fantastic Four, and Freddy Hayes in House of Cards, the last earning him three consecutive Emmy Award nominations for Outstanding Guest Actor in a Drama Series, including a win in 2015.\n\nDescription above from the Wikipedia article Reg E. Cathey, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 14999,
            "name": "George A. Romero",
            "image": "/w2zVF92x149qK79ZxwUowcSp2c6.jpg",
            "birth_date": "1940-02-04",
            "biography": "George Andrew Romero (February 4, 1940 – July 16, 2017) was an American-Canadian film director, screenwriter and editor, best known for his gruesome and satirical zombie films, including the seminal \"Night of the Living Dead\" (1968) and \"Dawn of the Dead\" (1978). Throughout his career he primarily worked in the horror genre and directed several notable films outside of the zombie subgenre, including vampire film \"Martin\" (1977) and EC Comics homage \"Creepshow\" (1982)."
        },
        {
            "id": 11066,
            "name": "Hal Holbrook",
            "image": "/mZw1GUv6B5yvKfy62imbuemxG6p.jpg",
            "birth_date": "1925-02-17",
            "biography": "Harold Rowe Holbrook Jr. (February 17, 1925 – January 23, 2021) was an American actor, television director, and writer. He first received critical acclaim in 1954 for a one-man stage show he developed, Mark Twain Tonight!, performing as Mark Twain, while studying at Denison University. He won the Tony Award for Best Actor in a Play in 1966 for his portrayal of Twain. He would continue to perform his signature role for over 60 years, only retiring the show in 2017 due to his failing health. Throughout his career, he also won five Primetime Emmy Awards for his work on television and was nominated for an Academy Award for his work in film.\n\nHolbrook made his film debut in Sidney Lumet's The Group (1966). He later gained international fame for his performance as Deep Throat in the 1976 film All the President's Men. He played Abraham Lincoln in the 1976 miniseries Lincoln and 1985 miniseries North and South. He also appeared in such films as Julia (1977), The Fog (1980), Creepshow (1982), Wall Street (1987), The Firm (1993), Hercules (1997), and Men of Honor (2000).\n\nHolbrook's role as Ron Franz in Sean Penn's Into the Wild (2007) earned him both Academy Award and Screen Actors Guild Award nominations for Best Supporting Actor. In 2009, Holbrook received critical acclaim for his performance as recently retired farmer Abner Meecham in the independent film That Evening Sun. He also portrayed Francis Preston Blair in Steven Spielberg's Lincoln (2012).\n\nIn 2003, Holbrook was honored with the National Humanities Medal by President George W. Bush.\n\nDescription above from the Wikipedia article Hal Holbrook, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 11782,
            "name": "Adrienne Barbeau",
            "image": "/8uQqjG63SFCkmgdFB4SG8wRQmfp.jpg",
            "birth_date": "1945-06-11",
            "biography": "Adrienne Jo Barbeau (born June 11, 1945) is an American actress, singer and the author of three books. Barbeau came to prominence in the 1970s as Broadway's original Rizzo in the musical Grease, and as Carol Traynor, the divorced daughter of Maude Findlay (played by Beatrice Arthur) in the sitcom Maude. In the early 1980s Barbeau was a sex symbol, starring in several horror and science fiction films, including The Fog, Creepshow, Swamp Thing, and Escape from New York. During the 1990s, she became known for providing the voice of Catwoman on Batman: The Animated Series and subsequent Batman cartoon series. In the 2000s, she appeared in the HBO series Carnivàle as Ruthie the snake dancer."
        },
        {
            "id": 6839,
            "name": "Fritz Weaver",
            "image": "/gjudPIeWyMJaxDvkRgx0HoTf2zG.jpg",
            "birth_date": "1926-01-19",
            "biography": "Fritz William Weaver (January 19, 1926 − November 26, 2016) was an American actor in television, stage, and motion pictures. He portrayed Dr. Josef Weiss in the 1978 epic television drama Holocaust, for which he was nominated for a Primetime Emmy Award. In cinema, he made his debut in the film Fail Safe (1964) and also appeared in Marathon Man (1976), Creepshow (1982), and The Thomas Crown Affair (1999). Among many television roles, he performed in the movie The Legend of Lizzie Borden (1975). He also worked in science fiction and fantasy, especially in television series and movies like The Twilight Zone, 'Way Out, Night Gallery, The X-Files, The Martian Chronicles, and Demon Seed."
        },
        {
            "id": 7633,
            "name": "Leslie Nielsen",
            "image": "/u5vWl5dw69Nf89f905Qb5JqEVL3.jpg",
            "birth_date": "1926-02-11",
            "biography": "Leslie William Nielsen, OC (February 11, 1926 – November 28, 2010) was a Canadian and naturalized American actor and comedian. Nielsen appeared in over one hundred films and 1,500 television programs over the span of his career, portraying over 220 characters. Born in Regina, Saskatchewan, Nielsen enlisted in the Royal Canadian Air Force and worked as a disc jockey before receiving a scholarship to Neighborhood Playhouse. Making his television debut in 1948, he quickly expanded to over 50 television appearances two years later. Nielsen made his film debut in 1956, and began collecting roles in dramas, westerns, and romance films. Nielsen's performances in the films Forbidden Planet (1956) and The Poseidon Adventure (1972) received positive reviews as a serious actor, though he is primarily known for his comedic roles.\n\nAlthough Nielsen's acting career crossed a variety of genres in both television and films, his deadpan delivery in Airplane! (1980) marked a turning point in his career, one that would make him, in the words of film critic Roger Ebert, \"the Olivier of spoofs.\" Nielsen enjoyed further success with The Naked Gun film series (1988 – 1994), based on a short-lived television series Police Squad! in which he starred earlier. His portrayal of serious characters seemingly oblivious to (and complicit in) their absurd surroundings gave him a reputation as a comedian. In the final years of his career, Nielsen appeared in multiple spoof and parody films, many of which were met poorly by critics, but performed well in box office and home media releases. Nielsen married four times and had two daughters from his second marriage. He was recognized with a variety of awards throughout his career, and was inducted into the Canada and Hollywood Walks of Fame.\n\nDescription above from the Wikipedia article Leslie Nielsen, licensed under CC-BY-SA, full list of contributors on Wikipedia"
        },
        {
            "id": 175087,
            "name": "Carrie Nye",
            "image": "/rNld8MZJoO0jrGWoDZfiht3lQFX.jpg",
            "birth_date": "1936-10-14",
            "biography": "Carolyn Nye McGeoy (October 14, 1936 – July 14, 2006) was an American actress. She received nominations for a Tony Award, a Primetime Emmy Award, and a Drama Desk Award."
        },
        {
            "id": 5249,
            "name": "E.G. Marshall",
            "image": "/psimeVoRk64DV7UNm4cLQylRFy2.jpg",
            "birth_date": "1914-06-18",
            "biography": "E. G. Marshall (June 18, 1914 – August 24, 1998) was an American actor, best known for his television roles as the lawyer Lawrence Preston on The Defenders in the 1960s, and as neurosurgeon David Craig on The Bold Ones: The New Doctors in the 1970s. Among his film roles, he is perhaps best known as the unflappable Juror #4 in Sidney Lumet's courtroom drama 12 Angry Men (1957).\n\n​From Wikipedia, the free encyclopedia"
        }
    ],
    "roles": [
        {
            "11": {
                "2": "Luke Skywalker",
                "3": "Han Solo",
                "4": "Princess Leia Organa",
                "5": "Grand Moff Tarkin",
                "12248": "Obi-Wan \"Ben\" Kenobi",
                "6": "C-3PO"
            }
        },
        {
            "293660": {
                "10859": "Wade Wilson / Deadpool",
                "54882": "Vanessa",
                "1047649": "Ajax",
                "51990": "Weasel",
                "78452": "Angel Dust",
                "122750": "Blind Al"
            }
        },
        {
            "475557": {
                "73421": "Arthur Fleck / Joker",
                "380": "Murray Franklin",
                "1545693": "Sophie Dumond",
                "4432": "Penny Fleck",
                "16841": "Thomas Wayne",
                "74242": "Detective Burke"
            }
        },
        {
            "43074": {
                "41091": "Erin Gilbert",
                "55536": "Abby “Wonton” Yates",
                "1240487": "Jillian Holtzmann",
                "168452": "Patty Tolan",
                "74568": "Kevin",
                "1267216": "Rowan North"
            }
        },
        {
            "263115": {
                "6968": "Logan / Wolverine / X-24",
                "1464650": "Laura / X-23",
                "2387": "Charles Xavier / Professor X",
                "65421": "Gabriela",
                "467645": "Pierce",
                "39189": "Caliban"
            }
        },
        {
            "299537": {
                "60073": "Carol Danvers / Vers / Captain Marvel",
                "2231": "Nick Fury",
                "77335": "Talos / Keller",
                "9642": "Yon-Rogg",
                "516": "Supreme Intelligence / Dr. Wendy Lawson",
                "938": "Korath"
            }
        },
        {
            "320288": {
                "1001657": "Jean Grey / Dark Phoenix",
                "5530": "Charles Xavier / Professor X",
                "3292": "Hank McCoy / Beast",
                "1034681": "Scott Summers / Cyclops",
                "17288": "Erik Lensherr / Magneto",
                "1253199": "Ororo Munroe / Storm"
            }
        },
        {
            "577922": {
                "1117313": "The Protagonist",
                "11288": "Neil",
                "1133349": "Kat",
                "11181": "Andrei Sator",
                "78921": "Priya",
                "1227717": "Mahir"
            }
        },
        {
            "27205": {
                "6193": "Dom Cobb",
                "24045": "Arthur",
                "3899": "Saito",
                "2524": "Eames",
                "27578": "Ariadne",
                "95697": "Yusuf"
            }
        },
        {
            "157336": {
                "10297": "Joseph \"Coop\" Cooper",
                "1813": "Dr. Amelia Brand",
                "83002": "Murphy \"Murph\" Cooper",
                "3895": "Professor John Brand",
                "58549": "TARS (voice)",
                "9560": "Old Murph"
            }
        },
        {
            "62": {
                "245": "Dr. David Bowman",
                "246": "Dr. Frank Poole",
                "247": "Dr. Heywood Floyd",
                "253": "HAL 9000 (voice)",
                "248": "Moonwatcher",
                "249": "Dr. Andrei Smyslov"
            }
        },
        {
            "680": {
                "8891": "Vincent Vega",
                "2231": "Jules Winnfield",
                "139": "Mia Wallace",
                "62": "Butch Coolidge",
                "10182": "Marsellus Wallace",
                "1037": "Winston \"The Wolf\" Wolfe"
            }
        },
        {
            "490132": {
                "110": "Tony Lip",
                "932967": "Dr. Don Shirley",
                "1817": "Dolores",
                "299743": "Johnny Venere",
                "1613744": "Oleg",
                "1211946": "Record Exec"
            }
        },
        {
            "141": {
                "131": "Donnie Darko",
                "20089": "Gretchen Ross",
                "1582": "Frank",
                "69597": "Karen Pomeroy",
                "5151": "Kitty Farmer",
                "1579": "Elizabeth Darko"
            }
        },
        {
            "383498": {
                "10859": "Wade Wilson / Deadpool / Juggernaut (voice) / Ryan Reynolds",
                "16851": "Nathan Summers / Cable",
                "54882": "Vanessa Carlysle",
                "1139349": "Russell Collins / Firefist",
                "1545693": "Neena Thurman / Domino",
                "51990": "Jack Hammer / Weasel"
            }
        },
        {
            "699280": {
                "964843": "Self",
                "102786": "Self",
                "1837786": "Self",
                "2346797": "Self",
                "2024791": "Self",
                "13309": "Self"
            }
        },
        {
            "297802": {
                "117642": "Arthur Curry / Aquaman",
                "55085": "Mera",
                "5293": "Nuidis Vulko",
                "17178": "King Orm Marius / Ocean Master",
                "2227": "Atlanna",
                "16644": "King Nereus"
            }
        },
        {
            "829": {
                "514": "J.J. 'Jake' Gittes",
                "6450": "Evelyn Cross Mulwray",
                "6593": "Noah Cross",
                "12295": "Lieutenant Lou Escobar",
                "12296": "Russ Yelburton",
                "6587": "Ida Sessions"
            }
        },
        {
            "807": {
                "192": "Detective Lt. William Somerset",
                "287": "Detective David Mills",
                "12052": "Tracy Mills",
                "12055": "Officer Davis",
                "30487": "Dr. O'Neill",
                "38951": "Dr. Santiago"
            }
        },
        {
            "16281": {
                "11066": "Henry Northrup (segment \"The Crate\")",
                "11782": "Wilma Northrup (segment \"The Crate\")",
                "6839": "Dexter Stanley (segment \"The Crate\")",
                "7633": "Richard Vickers (segment \"Something To Tide You Over\")",
                "175087": "Sylvia Grantham (segment \"Father's Day\")",
                "5249": "Upson Pratt (segment \"They're Creeping Up On You\")"
            }
        }
    ],
    "directs": [
        {
            "id": 1,
            "movie": 11
        },
        {
            "id": 55252,
            "movie": 293660
        },
        {
            "id": 57130,
            "movie": 475557
        },
        {
            "id": 116805,
            "movie": 43074
        },
        {
            "id": 366,
            "movie": 263115
        },
        {
            "id": 53068,
            "movie": 299537
        },
        {
            "id": 11092,
            "movie": 320288
        },
        {
            "id": 525,
            "movie": 577922
        },
        {
            "id": 525,
            "movie": 27205
        },
        {
            "id": 525,
            "movie": 157336
        },
        {
            "id": 240,
            "movie": 62
        },
        {
            "id": 138,
            "movie": 680
        },
        {
            "id": 7396,
            "movie": 490132
        },
        {
            "id": 1577,
            "movie": 141
        },
        {
            "id": 40684,
            "movie": 383498
        },
        {
            "id": 1484586,
            "movie": 699280
        },
        {
            "id": 2127,
            "movie": 297802
        },
        {
            "id": 3556,
            "movie": 829
        },
        {
            "id": 7467,
            "movie": 807
        },
        {
            "id": 14999,
            "movie": 16281
        }
    ]
}