{
    "movie_details": [
        {
            "movie_id": 1094844,
            "language": "en",
            "title": "Ape vs. Mecha Ape",
            "genre": [
                "Action",
                "Science Fiction"
            ],
            "description": "Recognizing the destructive power of its captive giant Ape, the military makes its own battle-ready A.I., Mecha Ape. But its first practical test goes horribly wrong, leaving the military no choice but to release the imprisoned giant ape to stop the colossal robot before it destroys downtown Chicago.",
            "poster": "/dJaIw8OgACelojyV6YuVsOhtTLO.jpg",
            "director": 1654626,
            "release_date": "2023-03-24",
            "vote_average": 5.824
        },
        {
            "movie_id": 940551,
            "language": "en",
            "title": "Migration",
            "genre": [
                "Animation",
                "Action",
                "Adventure",
                "Comedy",
                "Family"
            ],
            "description": "After a migrating duck family alights on their pond with thrilling tales of far-flung places, the Mallard family embarks on a family road trip, from New England, to New York City, to tropical Jamaica.",
            "poster": "/ldfCF9RhR40mppkzmftxapaHeTo.jpg",
            "director": 1092607,
            "release_date": "2023-12-06",
            "vote_average": 7.5
        },
        {
            "movie_id": 872585,
            "language": "en",
            "title": "Oppenheimer",
            "genre": [
                "Drama",
                "History"
            ],
            "description": "The story of J. Robert Oppenheimer's role in the development of the atomic bomb during World War II.",
            "poster": "/8Gxv8gSFCU0XGDykEGv7zR1n2ua.jpg",
            "director": 525,
            "release_date": "2023-07-19",
            "vote_average": 8.111
        },
        {
            "movie_id": 385687,
            "language": "en",
            "title": "Fast X",
            "genre": [
                "Action",
                "Crime",
                "Thriller"
            ],
            "description": "Over many missions and against impossible odds, Dom Toretto and his family have outsmarted, out-nerved and outdriven every foe in their path. Now, they confront the most lethal opponent they've ever faced: A terrifying threat emerging from the shadows of the past who's fueled by blood revenge, and who is determined to shatter this family and destroy everything—and everyone—that Dom loves, forever.",
            "poster": "/fiVW06jE7z9YnO4trhaMEdclSiC.jpg",
            "director": 18865,
            "release_date": "2023-05-17",
            "vote_average": 7.1
        },
        {
            "movie_id": 938614,
            "language": "en",
            "title": "Late Night with the Devil",
            "genre": [
                "Horror"
            ],
            "description": "A live broadcast of a late-night talk show in 1977 goes horribly wrong, unleashing evil into the nation's living rooms.",
            "poster": "/u3YQJctMzFN2wAvnkmXy41bXhFv.jpg",
            "director": 1083154,
            "release_date": "2024-03-19",
            "vote_average": 7.376
        },
        {
            "movie_id": 346698,
            "language": "en",
            "title": "Barbie",
            "genre": [
                "Comedy",
                "Adventure"
            ],
            "description": "Barbie and Ken are having the time of their lives in the colorful and seemingly perfect world of Barbie Land. However, when they get a chance to go to the real world, they soon discover the joys and perils of living among humans.",
            "poster": "/iuFNMS8U5cb6xfzi51Dbkovj7vM.jpg",
            "director": 45400,
            "release_date": "2023-07-19",
            "vote_average": 7.07
        },
        {
            "movie_id": 298618,
            "language": "en",
            "title": "The Flash",
            "genre": [
                "Action",
                "Adventure",
                "Science Fiction"
            ],
            "description": "When his attempt to save his family inadvertently alters the future, Barry Allen becomes trapped in a reality in which General Zod has returned and there are no Super Heroes to turn to. In order to save the world that he is in and return to the future that he knows, Barry's only hope is to race for his life. But will making the ultimate sacrifice be enough to reset the universe?",
            "poster": "/rktDFPbfHfUbArZ6OOOKsXcv0Bm.jpg",
            "director": 1113116,
            "release_date": "2023-06-13",
            "vote_average": 6.744
        },
        {
            "movie_id": 577922,
            "language": "en",
            "title": "Tenet",
            "genre": [
                "Action",
                "Thriller",
                "Science Fiction"
            ],
            "description": "Armed with only one word - Tenet - and fighting for the survival of the entire world, the Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.",
            "poster": "/k68nPLbIST6NP96JmTxmZijEvCA.jpg",
            "director": 525,
            "release_date": "2020-08-22",
            "vote_average": 7.183
        },
        {
            "movie_id": 760104,
            "language": "en",
            "title": "X",
            "genre": [
                "Horror",
                "Thriller",
                "Mystery"
            ],
            "description": "In 1979, a group of young filmmakers set out to make an adult film in rural Texas, but when their reclusive, elderly hosts catch them in the act, the cast find themselves fighting for their lives.",
            "poster": "/woTQx9Q4b8aO13jR9dsj8C9JESy.jpg",
            "director": 101542,
            "release_date": "2022-03-17",
            "vote_average": 6.729
        },
        {
            "movie_id": 609681,
            "language": "en",
            "title": "The Marvels",
            "genre": [
                "Science Fiction",
                "Adventure",
                "Action"
            ],
            "description": "Carol Danvers, aka Captain Marvel, has reclaimed her identity from the tyrannical Kree and taken revenge on the Supreme Intelligence. But unintended consequences see Carol shouldering the burden of a destabilized universe. When her duties send her to an anomalous wormhole linked to a Kree revolutionary, her powers become entangled with that of Jersey City super-fan Kamala Khan, aka Ms. Marvel, and Carol’s estranged niece, now S.A.B.E.R. astronaut Captain Monica Rambeau. Together, this unlikely trio must team up and learn to work in concert to save the universe.",
            "poster": "/9GBhzXMFjgcZ3FdR9w3bUMMTps5.jpg",
            "director": 1795072,
            "release_date": "2023-11-08",
            "vote_average": 6.2
        },
        {
            "movie_id": 348,
            "language": "en",
            "title": "Alien",
            "genre": [
                "Horror",
                "Science Fiction"
            ],
            "description": "During its return to the earth, commercial spaceship Nostromo intercepts a distress signal from a distant planet. When a three-member team of the crew discovers a chamber containing thousands of eggs on the planet, a creature inside one of the eggs attacks an explorer. The entire crew is unaware of the impending nightmare set to descend upon them when the alien parasite planted inside its unfortunate host is birthed.",
            "poster": "/vfrQk5IPloGg1v9Rzbh2Eg3VGyM.jpg",
            "director": 578,
            "release_date": "1979-05-25",
            "vote_average": 8.152
        },
        {
            "movie_id": 1015303,
            "language": "en",
            "title": "Elevator Game",
            "genre": [
                "Horror"
            ],
            "description": "Follows socially awkward teenager Ryan, who discovers that the night his sister disappeared she had played ‘The Elevator Game’ — a ritual conducted in an elevator in which players attempt to travel to another dimension using a set of rules that can be found online. Ignoring warnings, he resolves to follow and find her.",
            "poster": "/a4Zb13jow8RqJkYFgCUSdmzJCWq.jpg",
            "director": 1521437,
            "release_date": "2023-07-12",
            "vote_average": 4.613
        },
        {
            "movie_id": 787699,
            "language": "en",
            "title": "Wonka",
            "genre": [
                "Comedy",
                "Family",
                "Fantasy"
            ],
            "description": "Willy Wonka – chock-full of ideas and determined to change the world one delectable bite at a time – is proof that the best things in life begin with a dream, and if you’re lucky enough to meet Willy Wonka, anything is possible.",
            "poster": "/qhb1qOilapbapxWQn9jtRCMwXJF.jpg",
            "director": 101666,
            "release_date": "2023-12-06",
            "vote_average": 7.188
        },
        {
            "movie_id": 62,
            "language": "en",
            "title": "2001: A Space Odyssey",
            "genre": [
                "Science Fiction",
                "Mystery",
                "Adventure"
            ],
            "description": "Humanity finds a mysterious object buried beneath the lunar surface and sets off to find its origins with the help of HAL 9000, the world's most advanced super computer.",
            "poster": "/ve72VxNqjGM69Uky4WTo2bK6rfq.jpg",
            "director": 240,
            "release_date": "1968-04-02",
            "vote_average": 8.1
        },
        {
            "movie_id": 792307,
            "language": "en",
            "title": "Poor Things",
            "genre": [
                "Science Fiction",
                "Romance",
                "Comedy"
            ],
            "description": "An account of the fantastical evolution of Bella Baxter, a young woman brought back to life by the brilliant and unorthodox scientist Dr. Godwin Baxter.",
            "poster": "/kCGlIMHnOm8JPXq3rXM6c5wMxcT.jpg",
            "director": 122423,
            "release_date": "2023-12-07",
            "vote_average": 7.789
        },
        {
            "movie_id": 845783,
            "language": "en",
            "title": "Baghead",
            "genre": [
                "Horror"
            ],
            "description": "Following the death of her estranged father, Iris learns she has inherited a run-down, centuries-old pub. She travels to Berlin to identify her father’s body and meet with The Solicitor to discuss the estate. Little does she know, when the deed is signed she will become inextricably tied to an unspeakable entity that resides in the pub’s basement – Baghead – a shape-shifting creature that can transform into the dead.",
            "poster": "/lbOyeiiRYAE6Nm2e7xiNAAaRwZB.jpg",
            "director": 2138168,
            "release_date": "2023-12-28",
            "vote_average": 6.81
        },
        {
            "movie_id": 526896,
            "language": "en",
            "title": "Morbius",
            "genre": [
                "Action",
                "Science Fiction",
                "Fantasy"
            ],
            "description": "Dangerously ill with a rare blood disorder, and determined to save others suffering his same fate, Dr. Michael Morbius attempts a desperate gamble. What at first appears to be a radical success soon reveals itself to be a remedy potentially worse than the disease.",
            "poster": "/6JjfSchsU6daXk2AKX8EEBjO3Fm.jpg",
            "director": 125738,
            "release_date": "2022-03-30",
            "vote_average": 6.046
        },
        {
            "movie_id": 49047,
            "language": "en",
            "title": "Gravity",
            "genre": [
                "Science Fiction",
                "Thriller",
                "Drama"
            ],
            "description": "Dr. Ryan Stone, a brilliant medical engineer on her first Shuttle mission, with veteran astronaut Matt Kowalsky in command of his last flight before retiring. But on a seemingly routine spacewalk, disaster strikes. The Shuttle is destroyed, leaving Stone and Kowalsky completely alone-tethered to nothing but each other and spiraling out into the blackness of space. The deafening silence tells them they have lost any link to Earth and any chance for rescue. As fear turns to panic, every gulp of air eats away at what little oxygen is left. But the only way home may be to go further out into the terrifying expanse of space.",
            "poster": "/kZ2nZw8D681aphje8NJi8EfbL1U.jpg",
            "director": 11218,
            "release_date": "2013-10-03",
            "vote_average": 7.164
        },
        {
            "movie_id": 111,
            "language": "en",
            "title": "Scarface",
            "genre": [
                "Action",
                "Crime",
                "Drama"
            ],
            "description": "After getting a green card in exchange for assassinating a Cuban government official, Tony Montana stakes a claim on the drug trade in Miami. Viciously murdering anyone who stands in his way, Tony eventually becomes the biggest drug lord in the state, controlling nearly all the cocaine that comes through Miami. But increased pressure from the police, wars with Colombian drug cartels and his own drug-fueled paranoia serve to fuel the flames of his eventual downfall.",
            "poster": "/iQ5ztdjvteGeboxtmRdXEChJOHh.jpg",
            "director": 1150,
            "release_date": "1983-12-09",
            "vote_average": 8.168
        },
        {
            "movie_id": 15,
            "language": "en",
            "title": "Citizen Kane",
            "genre": [
                "Mystery",
                "Drama"
            ],
            "description": "Newspaper magnate Charles Foster Kane is taken from his mother as a boy and made the ward of a rich industrialist. As a result, every well-meaning, tyrannical or self-destructive move he makes for the rest of his life appears in some way to be a reaction to that deeply wounding event.",
            "poster": "/sav0jxhqiH0bPr2vZFU0Kjt2nZL.jpg",
            "director": 40,
            "release_date": "1941-04-17",
            "vote_average": 8.009
        }
    ],
    "persons": [
        {
            "id": 1654626,
            "name": "Marc Gottlieb",
            "image": null,
            "birth_date": null,
            "biography": ""
        },
        {
            "id": 74036,
            "name": "Tom Arnold",
            "image": "/z2ajL1ozVCS4Ug04zOGCNH06OPP.jpg",
            "birth_date": "1959-03-06",
            "biography": "From Wikipedia, the free encyclopedia\n\nThomas Duane \"Tom\" Arnold (born March 6, 1959) is an American actor and comedian. He has appeared in many films, perhaps most notably True Lies (1994). He was the host of The Best Damn Sports Show Period for four years.\n\nDescription above from the Wikipedia article Tom Arnold (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 1333845,
            "name": "Eugenia Kuzmina",
            "image": null,
            "birth_date": "1987-12-24",
            "biography": "Eugenia Kuzmina is a Russian-American actress"
        },
        {
            "id": 99684,
            "name": "Corbin Timbrook",
            "image": null,
            "birth_date": null,
            "biography": ""
        },
        {
            "id": 1155659,
            "name": "Jack Pearson",
            "image": "/kTL6lQp7u0IlmWXOhdxz6nxnC0f.jpg",
            "birth_date": "1989-09-03",
            "biography": ""
        },
        {
            "id": 2234620,
            "name": "Brendan Petrizzo",
            "image": "/953AKc2GTxKPvlYqVy0fUqSBbXo.jpg",
            "birth_date": null,
            "biography": "Brendan Petrizzo is a director, a producer, and an actor"
        },
        {
            "id": 1800933,
            "name": "Xander Bailey",
            "image": "/7trhXBGaWlfQ66H4UxEVzrxla7C.jpg",
            "birth_date": null,
            "biography": "Xander Bailey is an actor and writer, known for Misfortune (2016), My Father's Son (2010) and Incarnate (2011)."
        },
        {
            "id": 1092607,
            "name": "Benjamin Renner",
            "image": "/yp4ucXRYU5TdMj16glyoYYoxJcw.jpg",
            "birth_date": "1983-11-14",
            "biography": "Benjamin Renner (born 14 November 1983) is a French cartoonist, animator and filmmaker.  Renner and his fellow producers received a 2014 Academy Awards nomination in the category of Best Animated Feature for the film Ernest & Celestine. He previously directed a short, La queue de la souris (The Mouse's Tail) in 2008."
        },
        {
            "id": 466505,
            "name": "Kumail Nanjiani",
            "image": "/9EyrK1Cv7ey1h1GgmsVAOn45w6G.jpg",
            "birth_date": "1978-02-21",
            "biography": "Kumail Ali Nanjiani (born May 2, 1978) is a Pakistani-American comedian, actor, and screenwriter. He is primarily known for his role as Dinesh in the HBO comedy series Silicon Valley (2014–2019) and for co-writing and starring in the romantic comedy film The Big Sick (2017). For co-writing the latter with his wife, Emily V. Gordon, he was nominated for the Academy Award for Best Original Screenplay. In 2018, Time magazine named him one of the 100 most influential people in the world.\n\nNanjiani has also voiced Prismo on the animated series Adventure Time and starred in the TNT series Franklin & Bash and the Adult Swim series Newsreaders. He also co-hosted the Comedy Central show The Meltdown with Jonah and Kumail, as well as playing various roles on the comedy series Portlandia."
        },
        {
            "id": 9281,
            "name": "Elizabeth Banks",
            "image": "/zrkI1dYucpTM8Qydtrtro9MgQPb.jpg",
            "birth_date": "1974-02-10",
            "biography": "Elizabeth Banks (born February 10, 1974) is an American actress, producer and director. She is known for playing Effie Trinket in The Hunger Games film series (2012–2015) and Gail Abernathy-McKadden in the Pitch Perfect film series (2012–2017). She made her directorial film debut with Pitch Perfect 2 (2015), whose $69 million opening-weekend gross set a record for a first-time director. She went on to direct, write, produce, and star in the action comedy film Charlie's Angels (2019). She also directed and produced the horror comedy film Cocaine Bear (2023). Banks founded the film and television production company Brownstone Productions in October 2002, with her husband Max Handelman.\n\nBanks made her film debut in the low-budget independent film Surrender Dorothy (1998). She has appeared in the films Wet Hot American Summer (2001), Sam Raimi's Spider-Man trilogy (2002–2007), The 40-Year-Old Virgin (2005), Invincible (2006), Zack and Miri Make a Porno (2008), Role Models (2008), The Next Three Days (2010), Man on a Ledge (2012), Movie 43 (2013), The Lego Movie (2014) and its 2019 sequel, Love & Mercy (2014), Walk of Shame (2014), Magic Mike XXL (2015), Power Rangers (2017), and The Beanie Bubble (2023)."
        },
        {
            "id": 1736671,
            "name": "Caspar Jennings",
            "image": "/hDp0awwLRghXYtXZ4FRrubjrMRa.jpg",
            "birth_date": null,
            "biography": "Caspar Jennings is known as voice actor for Operation Mincemeat (2021), Sing (2016), Sing 2 (2021), and Migration )2023)."
        },
        {
            "id": 4031156,
            "name": "Tresi Gazal",
            "image": null,
            "birth_date": null,
            "biography": "Tresi Gazal is known for Migration (2023), Billy Knight (2024) and Migration: I Love You Always Forever (2023)."
        },
        {
            "id": 1625558,
            "name": "Awkwafina",
            "image": "/l5AKkg3H1QhMuXmTTmq1EyjyiRb.jpg",
            "birth_date": "1988-06-02",
            "biography": "Nora Lum (born June 2, 1988), known professionally as Awkwafina, is an American actress, rapper, and comedian who rose to prominence in 2012 when her rap song \"My Vag\" became popular on YouTube. She then released her debut album, Yellow Ranger (2014), and appeared on the MTV comedy series Girl Code (2014–2015). Her second album, In Fina We Trust, was released in 2018. She played supporting roles in the comedy films Neighbors 2: Sorority Rising (2016), Ocean's 8 (2018), Crazy Rich Asians (2018), and Jumanji: The Next Level (2019).\n\nAwkwafina played a leading role in the comedy-drama film The Farewell (2019), for which she received critical acclaim and won the Golden Globe Award for Best Actress in a Motion Picture – Comedy or Musical, becoming the first woman of Asian descent to win a Golden Globe in any lead actress film category, and additionally won the Satellite Award for Best Actress and was nominated for the BAFTA Rising Star Award and the Critics' Choice Movie Award for Best Actress.\n\nAwkwafina is co-creator, writer, and executive producer of the Comedy Central series Awkwafina Is Nora from Queens (2020–present), in which she stars as a fictionalized version of herself. She then appeared in Swan Song (2021), voiced Courtney in The Angry Birds Movie 2, Sisu in Raya and the Last Dragon (2021) and Ms. Tarantula in The Bad Guys (2022), and portrayed Katy in the Marvel Cinematic Universe (MCU) superhero film Shang-Chi and the Legend of the Ten Rings (2021)."
        },
        {
            "id": 10556,
            "name": "Carol Kane",
            "image": "/3EOZ7B148lRwJcl3CmQhfpgubYQ.jpg",
            "birth_date": "1952-06-18",
            "biography": "Carolyn Laurie Kane (born June 18, 1952) is an American actress and comedian.\n\nShe became known in the 1970s in films such as Hester Street (for which she received an Oscar nomination) and Annie Hall. She appeared on the television series Taxi in the early 1980s, as Simka Gravas, the wife of Latka, the character played by Andy Kaufman, winning two Emmy Awards for her work. She has played the character of Madame Morrible in the musical Wicked, both in regional productions and on Broadway from 2005 to 2014. From 2015 to 2018 she was a main cast member on the Netflix original series Unbreakable Kimmy Schmidt, in which she played Lillian Kaushtupper."
        },
        {
            "id": 525,
            "name": "Christopher Nolan",
            "image": "/xuAIuYSmsUzKlUMBFGVZaWsY3DZ.jpg",
            "birth_date": "1970-07-30",
            "biography": "Christopher Edward Nolan, CBE (born 30 July 1970) is a British-American film director, screenwriter, and producer. He was born in Westminster, London, England and holds both British and American citizenship due to his American mother. He is known for writing and directing critically acclaimed films such as Memento (2000), The Prestige (2006), The Dark Knight Trilogy (2005-12), Inception (2010), Interstellar (2014) and Dunkirk (2017). Nolan is the founder of the production company Syncopy Films. He often collaborates with his wife, producer Emma Thomas, and his brother, screenwriter Jonathan Nolan."
        },
        {
            "id": 2037,
            "name": "Cillian Murphy",
            "image": "/2lKs67r7FI4bPu0AXxMUJZxmUXn.jpg",
            "birth_date": "1976-05-25",
            "biography": "Cillian Murphy (born 25 May 1976) is an Irish actor.\n\nHe made his professional debut in Enda Walsh's 1996 play Disco Pigs, a role he later reprised in the 2001 screen adaptation. His early notable film credits include the horror film 28 Days Later (2002), the dark comedy Intermission (2003), the thriller Red Eye (2005), the Irish war drama The Wind That Shakes the Barley (2006), and the science fiction thriller Sunshine (2007). He played a transgender Irish woman in the comedy-drama Breakfast on Pluto (2005), which earned him a Golden Globe Award nomination.\n\nMurphy began collaborating with filmmaker Christopher Nolan in 2005, playing Dr. Jonathan Crane / Scarecrow in The Dark Knight Trilogy (2005–2012) as well as appearing in Inception (2010) and Dunkirk (2017) and portraying the lead role of J. Robert Oppenheimer in the biographical epic Oppenheimer (2023). By the year 2023, Murphy has already worked with Nolan for around 20 years and six films. He also gained prominence for his role as Tommy Shelby in the BBC period drama series Peaky Blinders (2013–2022) and for starring in the horror sequel A Quiet Place Part II (2020).\n\nIn 2011, Murphy won the Irish Times Theatre Award for Best Actor and Drama Desk Award for Outstanding Solo Performance for the one-man play Misterman. In 2020, The Irish Times named him one of the greatest Irish film actors."
        },
        {
            "id": 5081,
            "name": "Emily Blunt",
            "image": "/5nCSG5TL1bP1geD8aaBfaLnLLCD.jpg",
            "birth_date": "1983-02-23",
            "biography": "Emily Olivia Laura Blunt (born 23 February 1983) is a British actress. She is the recipient of several accolades, including a Golden Globe Award and a Screen Actors Guild Award, in addition to nominations for three British Academy Film Awards. Forbes ranked her as one of the highest-paid actresses in the world in 2020.\n\nBlunt made her acting debut in a 2001 stage production of The Royal Family. She went on to appear in the television film Boudica (2003) and portrayed Queen Catherine Howard in the miniseries Henry VIII (2003). She made her feature film debut in the drama My Summer of Love (2004). Blunt's breakthrough came in 2006 with her starring roles in the television film Gideon's Daughter and the comedy-drama film The Devil Wears Prada. The former won her a Golden Globe Award for Best Supporting Actress and the latter earned her a nomination for the BAFTA Award for Best Actress in a Supporting Role.\n\nBlunt's profile continued to grow with leading roles in the period film The Young Victoria (2009), the romantic comedy Salmon Fishing in the Yemen (2011), the science fiction films The Adjustment Bureau (2011), Looper (2012), and Edge of Tomorrow (2014), and the musical films Into the Woods (2014) and Mary Poppins Returns (2018). She received critical acclaim for playing a principled FBI agent in the crime film Sicario (2015), an alcoholic in the thriller The Girl on the Train (2016), which earned her a nomination for the BAFTA Award for Best Actress in a Leading Role, and a survivalist mother in her husband John Krasinski's horror film A Quiet Place (2018), for which she won the SAG Award for Best Supporting Actress. She has since starred in the sequel A Quiet Place Part II (2020), Jungle Cruise (2021), the western miniseries The English (2022), Oppenheimer (2023) and Pain Hustlers (2023)."
        },
        {
            "id": 1892,
            "name": "Matt Damon",
            "image": "/At3JgvaNeEN4Z4ESKlhhes85Xo3.jpg",
            "birth_date": "1970-10-08",
            "biography": "Matthew Paige Damon (born October 8, 1970) is an American actor, film producer, and screenwriter. He is the recipient of various accolades, including an Academy Award from five nominations, and two Golden Globe Awards. He also received three BAFTA Award nominations, seven Primetime Emmy Award nominations, and six Screen Actors Guild Awards.\n\nDamon made his professional acting debut in the film Mystic Pizza (1988). He came to prominence when he and Ben Affleck wrote and starred in Good Will Hunting (1997), which won them the Academy Award for Best Screenplay. He continued to garner praise for his roles in Saving Private Ryan (1998), The Talented Mr. Ripley (1999), the Ocean's trilogy (2001-2007), the Bourne franchise (2002-2016), The Departed (2006), Invictus (2009), True Grit (2010), Behind The Candelabra (2013), The Martian (2015), Ford v Ferrari (2019), and Air (2023).\n\nDamon has co-written the feature films Good Will Hunting (1997), Gerry (2002), Promised Land (2012) and The Last Duel (2021).\n\nHe has produced the reality series Project Greenlight (2001-2015) as well as multiple films including Manchester by the Sea (2016) and The Last Duel (2021). In 2022, he co-founded the production company Artists Equity."
        },
        {
            "id": 3223,
            "name": "Robert Downey Jr.",
            "image": "/5qHNjhtjMD4YWH3UP0rm4tKwxCL.jpg",
            "birth_date": "1965-04-04",
            "biography": "Robert John Downey Jr. (born April 4, 1966) is an American actor and producer. His career has been characterized by critical and popular success in his youth, followed by a period of substance abuse and legal troubles, before a resurgence of commercial success later in his career. In 2008, Downey was named by Time magazine among the 100 most influential people in the world, and from 2013 to 2015, he was listed by Forbes as Hollywood's highest-paid actor.\n\nAt the age of five, he made his acting debut in his father Robert Downey Sr.'s film Pound in 1970. He subsequently worked with the Brat Pack in the teen films Weird Science (1985) and Less than Zero (1987). In 1992, Downey portrayed the title character in the biopic Chaplin, for which he was nominated for the Academy Award for Best Actor and won a BAFTA Award. Following a stint at the Corcoran Substance Abuse Treatment Facility on drug charges, he joined the TV series Ally McBeal, for which he won a Golden Globe Award. He was fired from the show in the wake of drug charges in 2000 and 2001. He stayed in a court-ordered drug treatment program and has maintained his sobriety since 2003.\n\nInitially, completion bond companies would not insure Downey, until Mel Gibson paid the insurance bond for the 2003 film The Singing Detective. He went on to star in the black comedy Kiss Kiss Bang Bang (2005), the thriller Zodiac (2007), and the action comedy Tropic Thunder (2008); for the latter, he was nominated for an Academy Award for Best Supporting Actor.\n\nDowney gained global recognition for starring as Tony Stark / Iron Man in ten films within the Marvel Cinematic Universe, beginning with Iron Man (2008), and leading up to Avengers: Endgame (2019). He has also played the title character in Guy Ritchie's Sherlock Holmes (2009), which earned him his second Golden Globe, and its sequel, Sherlock Holmes: A Game of Shadows (2011).\n\nIn 2024 he won his first Academy Award for Best Supporting Actor thanks to his work in \"Oppenheimer.\""
        },
        {
            "id": 1373737,
            "name": "Florence Pugh",
            "image": "/6Sjz9teWjrMY9lF2o9FCo4XmoRh.jpg",
            "birth_date": "1996-01-03",
            "biography": "Florence Pugh (born January 3, 1996) is an English actress. She made her acting debut in 2014 in the drama film The Falling. Pugh gained recognition in 2016 for her leading role as a young bride in the independent drama Lady Macbeth, winning a British Independent Film Award, and drew praise for starring in the miniseries The Little Drummer Girl (2018).\n\nPugh's international breakthrough came in 2019 with her portrayals of professional wrestler Paige in the biographical sports film Fighting with My Family, a despondent American woman in the horror film Midsommar, and Amy March in the period drama Little Women. For the last of these, she received nominations for an Academy Award and a BAFTA Award. Pugh was awarded the Trophée Chopard at the 2019 Cannes Film Festival.\n\nShe has played Yelena Belova in the Marvel Cinematic Universe, beginning with Black Widow (2021) and Hawkeye (2021). She will reprise her role again in Thunderbolts (2024). In the following year, she starred in the thriller Don't Worry Darling and drama The Wonder, and voiced Goldilocks in the animated film Puss in Boots: The Last Wish. Pugh also portrayed Jean Tatlock in Christopher Nolan's biographical film Oppenheimer (2023) and Princess Irulan in Denis Villeneuve’s sci-fi epic Dune: Part Two (2024)."
        },
        {
            "id": 2299,
            "name": "Josh Hartnett",
            "image": "/dCfu2EN7FjISACcjilaJu7evwEc.jpg",
            "birth_date": "1978-07-21",
            "biography": "Joshua Daniel \"Josh\" Hartnett (born July 21, 1978) is an American actor and producer.\n\nHe first came to audiences' attention in 1997 as \"Michael Fitzgerald\" in the television series Cracker. He made his feature film debut in 1998, co-starring with Jamie Lee Curtis in Halloween H20: 20 Years Later. That same year, he received an MTV Movie Award nomination for Best Breakthrough Male Performance. Hartnett gained fame for his role as Cpt Danny Walker in Pearl Harbor, and has starred since then for a variety of well-known directors such as Ridley Scott, Brian De Palma, Robert Rodriguez, Tran Anh Hung and Michael Bay."
        },
        {
            "id": 18865,
            "name": "Louis Leterrier",
            "image": "/bpqqRRyCLeoAup2OAv1Dtm5C8Tn.jpg",
            "birth_date": "1973-06-17",
            "biography": "Louis Leterrier (French: [lwi lətɛʁje]; born 17 June 1973) is a French film and television director. Best known for his work in action films, he directed the first two Transporter films (2002–2015), The Incredible Hulk (2008), Clash of the Titans (2010), Now You See Me (2013), and the tenth Fast & Furious installment, Fast X (2023). He also directed the streaming television series The Dark Crystal: Age of Resistance (2019)."
        },
        {
            "id": 12835,
            "name": "Vin Diesel",
            "image": "/7rwSXluNWZAluYMOEWBxkPmckES.jpg",
            "birth_date": "1967-07-18",
            "biography": "Mark Sinclair (born July 18, 1967), known professionally as Vin Diesel, is an American actor and producer. One of the world's highest-grossing actors, he is best known for playing Dominic Toretto in the Fast & Furious franchise.\n\nDiesel began his career in 1990, but faced difficulty achieving recognition until he wrote, directed and starred in the short film Multi-Facial (1995) and his debut feature Strays (1997); the films prompted Steven Spielberg to cast Diesel in the war epic Saving Private Ryan (1998). Diesel subsequently voiced the titular character in The Iron Giant (1999) and then gained a reputation as an action star after headlining the Fast & Furious, XXX, and The Chronicles of Riddick franchises. He is slated to appear in the upcoming Avatar films.\n\nDiesel voices Groot and Groot II in the Marvel Cinematic Universe (MCU); he portrayed the characters in six superhero films, beginning with Guardians of the Galaxy (2014). Diesel has reprised his role as Groot for the Disney+ animated shorts series I Am Groot (2022–present), the television special The Guardians of the Galaxy Holiday Special (2022), and the animated film Ralph Breaks the Internet (2018). Diesel achieved commercial success in the comedy The Pacifier (2005) and his portrayal of Jackie DiNorscio in Find Me Guilty (2006) was praised.\n\nHe founded the production company One Race Films, where he has also served as a producer or executive producer for his star vehicles. Diesel also founded the record label Racetrack Records and video game developer Tigon Studios, providing his voice and motion capture for all of Tigon's releases.\n\nDescription above from the Wikipedia article Vin Diesel, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 17647,
            "name": "Michelle Rodriguez",
            "image": "/xSvkVrLz6xas1mCeOR9i4QtmhnQ.jpg",
            "birth_date": "1978-07-12",
            "biography": "Mayte Michelle Rodríguez (born July 12, 1978), known professionally as Michelle Rodriguez, is an American actress, screenwriter, and DJ. She got her breakout role as a troubled boxer in the independent film Girlfight (2000), which was met with critical acclaim and earned her several awards, including the Independent Spirit Award and Gotham Award for Best Debut Performance. The following year, she starred as Letty Ortiz in the blockbuster film The Fast and the Furious (2001), reprising her role in its sequels Fast & Furious (2009), Fast & Furious 6 (2013), and Furious 7 (2015).\n\nDuring her career, Rodriguez has played tough, independent women in a number of successful action films, such as Blue Crush, S.W.A.T., Battle: Los Angeles, and Avatar. She is also known for her roles as Shé in the action comedy films Machete and Machete Kills, and Rain Ocampo in the science fiction films Resident Evil and Resident Evil: Retribution.\n\nRodriguez also branched into television, playing Ana Lucia Cortez in the second season of the series Lost as part of the main cast, before making numerous guest appearances before the series ended. She has also done voice work in video games such as Call of Duty and Halo, and lent her voice for the 3D animated film Turbo and the television series IGPX.\n\nWith her films grossing over $5 billion collectively, a 2013 Entertainment Weekly article described Rodriguez as \"arguably the most iconic actress in the action genre, as well as one of the most visible Latinas in Hollywood\"."
        },
        {
            "id": 8169,
            "name": "Tyrese Gibson",
            "image": "/1K315wBQBvDBuZMlzoozuGsqFXZ.jpg",
            "birth_date": "1978-12-30",
            "biography": "Tyrese Darnell Gibson (born December 30, 1978), also known mononymously as Tyrese, is an American Grammy-nominated R&B singer, songwriter, actor, author, television producer, former fashion model and MTV VJ. He is best known for his role as Roman Pearce in the The Fast and the Furious series."
        },
        {
            "id": 8171,
            "name": "Ludacris",
            "image": "/erkJijujhe48vhJ8iCEtVpNEeVn.jpg",
            "birth_date": "1977-09-11",
            "biography": "Christopher Brian Bridges (born September 11, 1977), known professionally as Ludacris, is an American rapper and actor. After forming his own label, Disturbing tha Peace, in the late 1990s, he later signed with Def Jam South and would go on to become one of the first Dirty South rappers to achieve mainstream success with his subsequent releases. For his music, Ludacris has won an MTV Video Music Award and three Grammy Awards.\n\nAs an actor, he is best known for his role as Tej Parker in the Fast and Furious film franchise. His other notable roles include Crash (2004), Gamer (2009), New Year's Eve (2011), and End of the Road (2023). For his performance in the ensemble of Crash, he was co-awarded a Screen Actors Guild Award and a Critic's Choice Award for Best Cast.\n\nHis daughter Karma Bridges is an actress."
        },
        {
            "id": 56446,
            "name": "John Cena",
            "image": "/rgB2eIOt7WyQjdgJCOuESdDlrjg.jpg",
            "birth_date": "1977-04-23",
            "biography": "John Felix Anthony Cena is an American professional wrestler, actor, and former rapper currently signed to WWE. Widely regarded as one of the greatest professional wrestlers of all time, he is tied with Ric Flair for the most world championship reigns in professional wrestling history.\n\nBorn and raised in West Newbury, Massachusetts, Cena moved to California in 1998 to pursue a career as a bodybuilder. He transitioned to professional wrestling in 1999 when he debuted for Ultimate Pro Wrestling (UPW). He signed with the World Wrestling Federation (WWF, now WWE) in 2001, where he was initially assigned to Ohio Valley Wrestling (OVW). He gained fame in the WWE after adopting the persona of a trash-talking rapper. He won his first singles title, the United States Championship, in 2004. The next year, he won the WWE Championship for the first time, and his character subsequently transitioned into a clean-cut \"Superman-like\" hero. He then led the company as its franchise player, and public face for the next decade.\n\nA joint-record 16-time world champion, Cena has won the WWE Championship thirteen times, a record for the title. He is also a five-time United States Champion, a four-time world tag team champion, a two-time Royal Rumble match winner, a one-time Money in the Bank match winner, and has headlined several major WWE pay-per-view events, including their flagship event, WrestleMania, five times. His professional wrestling career has been met with mixed critical and audience reception, with praise for his character work and promotional skills, but criticism for his supposed over-representation and on-screen placement relative to other wrestlers.\n\nCena first starred in The Marine (2006), and gained praise for his performances in Trainwreck (2015), Ferdinand (2017), Blockers, and Bumblebee (both 2018). He starred in F9 and portrayed Peacemaker in The Suicide Squad (both 2021) and in the eponymous television series. His debut studio album, You Can't See Me (2005), was certified platinum. Outside his work in entertainment, Cena is known for his involvement in numerous charitable causes, namely with the Make-A-Wish Foundation, where he has granted the most wishes, at over 650."
        },
        {
            "id": 1251069,
            "name": "Nathalie Emmanuel",
            "image": "/uh8EIhxKJxK7xsJlWcIgBkqyAKq.jpg",
            "birth_date": "1989-03-02",
            "biography": "Nathalie Joanne Emmanuel (born 2 March 1989) is an English actress best known for her role as Sasha Valentine in the soap opera Hollyoaks, Computer Hacktivist Ramsey in the action film Furious 7 and as the interpreter Missandei on the HBO fantasy series Game of Thrones."
        },
        {
            "id": 1083154,
            "name": "Cameron Cairnes",
            "image": "/uipeyReF5kffUt0jDVwa6atDVBh.jpg",
            "birth_date": null,
            "biography": ""
        },
        {
            "id": 83854,
            "name": "David Dastmalchian",
            "image": "/hYpGoCNyddrAlG8FI6Jk2r38JSE.jpg",
            "birth_date": "1977-07-21",
            "biography": "David Dastmalchian is an American actor. Raised in Kansas, he studied at The Theatre School at DePaul University. In Chicago, he received acclaim for lead roles in Tennessee Williams' The Glass Menagerie and Sam Shepard's Buried Child at Shattered Globe Theatre. Wikipedia"
        },
        {
            "id": 187400,
            "name": "Laura Gordon",
            "image": "/gUYQEPivLz4pLON5mVakrxB9tXz.jpg",
            "birth_date": null,
            "biography": ""
        },
        {
            "id": 62486,
            "name": "Ian Bliss",
            "image": "/26Ms6gQlbfxAzdrSTKfkcMoJrov.jpg",
            "birth_date": null,
            "biography": ""
        },
        {
            "id": 230609,
            "name": "Fayssal Bazzi",
            "image": "/FdGWperjFqzfGD53TVXLxsjJ7a.jpg",
            "birth_date": null,
            "biography": ""
        },
        {
            "id": 2554414,
            "name": "Ingrid Torelli",
            "image": "/qJuNZiALqkbOmVDs4DXLurPQpD2.jpg",
            "birth_date": null,
            "biography": ""
        },
        {
            "id": 3964519,
            "name": "Rhys Auteri",
            "image": "/dpds0ltWHdQthsLoXdGC1uh2kdg.jpg",
            "birth_date": null,
            "biography": "Rhys is an actor, improviser, musician and writer who was most recently seen in Colin and Cameron Cairnes'  feature film Late Night with the Devil which premiered at SxSW, then Sydney Film Festival and Melbourne International Film Festival.  Rhys' nuanced and quirky performance in the film garnered many positive reviews.\n\nHe performs regularly as part of the Impro Melbourne ensemble, The Big Hoo-Haa and Murder Village, and has written for and performed at festivals across Melbourne, Adelaide, Brisbane and New Zealand. Rhys is also a songwriter, performing solo and in the duo Baby Drivers.\n\nRhys completed a Bachelor of Performing Arts (Hons) at Monash University and a Certificate of Professional Screenwriting at RMIT where he was awarded the 2014 FilmVic Award."
        },
        {
            "id": 45400,
            "name": "Greta Gerwig",
            "image": "/nvB866tPA2DcDDAF5r2HDcOtYNv.jpg",
            "birth_date": "1983-08-04",
            "biography": "Greta Gerwig is an American actress, playwright, screenwriter, and director based in NY. She has collaborated with Noah Baumbach on several films, including Greenberg (2010), Frances Ha (2012), for which she earned a Golden Globe nomination, and Mistress America (2015). Gerwig made her solo directorial debut with the critically acclaimed comedy-drama film Lady Bird (2017), which she also wrote, and has also had starring roles in the films Damsels in Distress (2011), Jackie (2016), and 20th Century Women (2016).\n\nGreta Celeste Gerwig was born in Sacramento, California, to Christine Gerwig (née Sauer), a nurse, and Gordon Gerwig, a financial consultant and computer programmer. She has German, Irish, and English ancestry. Gerwig was raised as a Unitarian Universalist, but also attended an all-girls Catholic school. She has described herself as \"an intense child\". With an early interest in dance, she intended to get a degree in musical theatre in New York. She graduated from Barnard College in NY, where she studied English and philosophy, instead.\n\nOriginally intending to become a playwright, after meeting young film director Joe Swanberg, she became the star of a series of intellectual low budget movies made by first-time filmmakers, a trend dubbed \"mumblecore\". Gerwig was cast in a minor role in Swanberg's LOL (2006) in 2006, while still studying at Barnard. She then appeared in many of Swanberg's films, and personally co-directed, co-wrote and co-produced one entitled Nights and Weekends (2008). She has worked with good quality directors such as Ti West (The House of the Devil (2009)), Whit Stillman (Damsels in Distress (2011)), or Woody Allen (To Rome with Love (2012)) but success and (international) recognition did not come until Frances Ha (2012), directed by Noah Baumbach, a film she also co-wrote. Both tall and immature, awkward and graceful, blundering and candid, annoying and engaging, Greta has won all hearts in the title role of Frances Ha(liday).\n\nIn 2017, she wrote and directed the highly acclaimed, semi-autobiographical teen movie Lady Bird (2017), set in 2002-2003, and starring Saoirse Ronan, Laurie Metcalf, and Timothée Chalamet. In 2011, Gerwig received an award for Acting from the Athena Film Festival for her artistry as one of Hollywood's definitive screen actresses of her generation."
        },
        {
            "id": 234352,
            "name": "Margot Robbie",
            "image": "/euDPyqLnuwaWMHajcU3oZ9uZezR.jpg",
            "birth_date": "1990-07-02",
            "biography": "Margot Elise Robbie (born July 2, 1990) is an Australian actress and producer. Known for her work in both blockbuster and independent films, she has received several accolades, including nominations for two Academy Awards, four Golden Globe Awards, and five British Academy Film Awards. Time magazine named her one of the 100 most influential people in the world in 2017 and she was ranked as one of the world's highest-paid actresses by Forbes in 2019.\n\nBorn and raised in Queensland, Robbie began her career in 2008 on the television series Neighbours, on which she was a regular until 2011. After moving to America, she led the television series Pan Am (2011–2012), and had her breakthrough in 2013 with the black comedy film The Wolf of Wall Street. She achieved wider recognition with starring roles as Jane Porter in The Legend of Tarzan (2016), Harley Quinn in the DC superhero films Suicide Squad (2016), Birds of Prey (2020) and The Suicide Squad (2021). Robbie also starred in Amsterdam (2022), Babylon (2022), Asteroid City (2023) and the titular role of Barbie in Barbie (2023).\n\nRobbie received critical acclaim and a nomination for the Academy Award for Best Actress for her portrayal of disgraced figure skater Tonya Harding in the biopic I, Tonya (2017). This acclaim continued with her roles as Queen Elizabeth I in the period drama Mary Queen of Scots (2018), Sharon Tate in the comedy-drama Once Upon a Time in Hollywood (2019), and a fictional Fox News employee in the drama Bombshell (2019); she received BAFTA Award nominations for all three and a nomination for the Academy Award for Best Supporting Actress for the lattermost.\n\nRobbie is married to filmmaker Tom Ackerley. They are co-founders of the production company LuckyChap Entertainment, under which they have produced several films, including I, Tonya and Promising Young Woman (2020), as well as the television series Dollface (2019–2022) and the miniseries Maid (2021)."
        },
        {
            "id": 30614,
            "name": "Ryan Gosling",
            "image": "/lyUyVARQKhGxaxy0FbPJCQRpiaW.jpg",
            "birth_date": "1980-11-12",
            "biography": "Ryan Thomas Gosling (born November 12, 1980) is a Canadian actor. Prominent in independent film, he has also worked in blockbuster films of varying genres, and has accrued a worldwide box office gross of over 1.9 billion USD. He has received various accolades, including a Golden Globe Award, and nominations for two Academy Awards and a BAFTA Award.\n\nBorn and raised in Canada, he rose to prominence at age 13 for being a child star on the Disney Channel's The Mickey Mouse Club (1993–1995), and went on to appear in other family entertainment programs, including Are You Afraid of the Dark? (1995) and Goosebumps (1996). His first film role was as a Jewish neo-Nazi in The Believer (2001), and he went on to star in several independent films, including Murder by Numbers (2002), The Slaughter Rule (2002), and The United States of Leland (2003).\n\nGosling gained wider recognition and stardom for the 2004 romance film The Notebook. This was followed by starring roles in a string of critically acclaimed independent dramas including Half Nelson (2006), for which he was nominated for the Academy Award for Best Actor. Gosling co-starred in three mainstream films in 2011, the romantic comedy Crazy, Stupid, Love and the action drama Drive, all of which were critical and commercial successes. He then starred in the acclaimed financial satire The Big Short (2015) and the romantic musical La La Land (2016), the latter of which won him the Golden Globe Award for Best Actor and a second Academy Award nomination for Best Actor. Further acclaim followed with the science fiction thriller Blade Runner 2049 (2017) and the biopic First Man (2018). In addition to acting, he made his directorial debut in 2014's Lost River."
        },
        {
            "id": 59174,
            "name": "America Ferrera",
            "image": "/7F84Lh2lKpvkM3EiOvqqvlOmw93.jpg",
            "birth_date": "1984-04-18",
            "biography": "America Georgina Ferrera (born April 18, 1984) is an American actress. She has received numerous accolades, including a Primetime Emmy Award, a Golden Globe Award, and a Screen Actors Guild Award, in addition to an Academy Award nomination. In 2007, Time named her one of the 100 most influential people in the world.\n\nBorn in Los Angeles to Honduran parents, Ferrera developed an interest in acting at a young age, performing in several stage productions at her school. She made her feature film debut in 2002 with the comedy-drama Real Women Have Curves, earning praise for her performance. She achieved modest success early in her career with roles in films such as the comedy-dramas Gotta Kick It Up! (2002) and The Sisterhood of the Traveling Pants (2005); the latter earned her the Imagen Award for Best Actress and her first nomination for the ALMA Award for Outstanding Actress in a Motion Picture. She garnered further critical acclaim and recognition for her starring role as Betty Suarez in the ABC comedy-drama series Ugly Betty (2006–2010). For her performance, she won a Golden Globe Award, a Screen Actors Guild Award, and a Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series, the first for a Latina woman in the category.\n\nFerrera's other notable film roles include the drama The Dry Land (2010), the romantic comedy Our Family Wedding (2010), the crime drama End of Watch (2012), and the fantasy comedy Barbie (2023). She provided the voice of Astrid Hofferson in the How to Train Your Dragon franchise, including the three films and the television series Dreamworks Dragons. She co-produced and starred as Amy Sosa in the NBC workplace comedy series Superstore (2015–2021).\n\nDescription above from the Wikipedia article America Ferrera, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 1767250,
            "name": "Ariana Greenblatt",
            "image": "/8xrCTYP8PuHixWzkiX6onJNfw8k.jpg",
            "birth_date": "2007-08-27",
            "biography": "Ariana Greenblatt was born on August 27, 2007 in New York and is an American actress. Greenblatt has always known that she wanted to be an actor, with a burgeoning professional career beginning when she was six years old, an evident through early roles on Liv and Maddie and Nickelodeon's Legendary Dudas. Her film and television credits include A Bad Moms Christmas, Avengers: Infinity War, SCOOB!, In the Heights, The Boss Baby: Family Business, 65 & Barbie."
        },
        {
            "id": 1455336,
            "name": "Issa Rae",
            "image": "/1tX1T5ZNCMh2KYP1jMgfg8P26vm.jpg",
            "birth_date": "1985-01-12",
            "biography": "Jo-Issa Rae Diop, known as Issa Rae (born January 12, 1985), is an American actress, writer, director, producer, and web series creator. She first garnered attention for her work on the YouTube web series Awkward Black Girl. Since then, she has been known for her roles in the TV show 'Insecure' (2016-2021) and films such as 'The Hate U Give' (2018) and 'Barbie' (2023).\n\nHer father is Senegalese."
        },
        {
            "id": 1240487,
            "name": "Kate McKinnon",
            "image": "/2cNetzianFcxPQbyOQnkAIkKUZE.jpg",
            "birth_date": "1984-01-06",
            "biography": "Kate McKinnon Berthold (born January 6, 1984) is an American actress, comedian, impressionist, and writer. She was a cast member on the NBC sketch comedy series Saturday Night Live from 2012 to 2022, where she became known for her character work and celebrity impressions. For her work on the series, she was nominated for ten Primetime Emmy Awards, including one for Outstanding Original Music and Lyrics and nine for Outstanding Supporting Actress in a Comedy Series, winning in 2016 and 2017.\n\nMcKinnon starred in the Logo sketch comedy series The Big Gay Sketch Show (2007–2010), voiced lead roles in the PBS Kids animated series Nature Cat (2015–present) and the Netflix animated series The Magic School Bus Rides Again (2017–2021), and portrayed Carole Baskin in the Peacock miniseries Joe vs. Carole (2022).\n\nMcKinnon has also appeared in numerous films, such as Balls Out (2014), Ghostbusters (2016), Office Christmas Party (2016), Rough Night (2017), The Spy Who Dumped Me (2018), Yesterday (2019), Bombshell (2019), DC League of Super-Pets (2022), and Barbie (2023).\n\nDescription above from the Wikipedia article Kate McKinnon, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 1113116,
            "name": "Andy Muschietti",
            "image": "/mzOMGWzqFFLqIqa2WkDv5I1IxHE.jpg",
            "birth_date": "1973-08-26",
            "biography": "Andrés Walter Muschietti (born 26 August 1973) is an Argentine film director and screenwriter who achieved wide recognition with the 2013 film Mama. He gained further recognition for directing both films in the It film series, the 2017 film adaptation of the Stephen King novel and its sequel, It Chapter Two. In 2023, he directed the DC Extended Universe film The Flash."
        },
        {
            "id": 132157,
            "name": "Ezra Miller",
            "image": "/cAwXQKomuxPaFN3d9bIPZDKvbcb.jpg",
            "birth_date": "1992-09-30",
            "biography": "Ezra Matthew Miller (born September 30, 1992) is an American actor. Their feature film debut was in Afterschool (2008), which they followed by starring in the dramas We Need to Talk About Kevin (2011) and The Perks of Being a Wallflower (2012).\n\nAfter a supporting role in the comedy Trainwreck (2015), Miller played Credence Barebone in the Fantastic Beasts fantasy films Fantastic Beasts and Where to Find Them (2016), Fantastic Beasts: The Crimes of Grindelwald (2018), and Fantastic Beasts: The Secrets of Dumbledore (2022). In 2020, they had a recurring role on the miniseries The Stand. Miller played the Flash in the DC Extended Universe, including in the films Justice League (2017) and The Flash (2023)."
        },
        {
            "id": 2542319,
            "name": "Sasha Calle",
            "image": "/yLZY25AQOC2xKzsWqteyJTcWPK3.jpg",
            "birth_date": "1995-08-07",
            "biography": "Sasha Calle (born August 7, 1995) is an American actress. She starred in the soap opera The Young and the Restless from 2018 to 2021, for which she received a nomination for a Daytime Emmy Award. She made her film debut as Supergirl in the superhero film The Flash (2023)."
        },
        {
            "id": 2232,
            "name": "Michael Keaton",
            "image": "/baeHNv3qrVsnApuKbZXiJOhqMnw.jpg",
            "birth_date": "1951-09-05",
            "biography": "Michael John Douglas (born September 5, 1951), known professionally as Michael Keaton, is an American actor. He is best known for portraying the DC Comics superhero Bruce Wayne / Batman in the films Batman (1989), Batman Returns (1992) and the upcoming The Flash and Batgirl (both 2022), as well as Jack Butler in Mr. Mom (1983), Betelgeuse in Beetlejuice (1988), and Adrian Toomes / Vulture in Spider-Man: Homecoming (2017) and the upcoming Morbius (2022). His breakout role was as fast-talking schemer Bill \"Blaze\" Blazejowski in the 1982 film Night Shift (which was also Ron Howard's second job as a director). He later appeared in a variety of films ranging from dramas and romantic comedies to thriller and action films, such as Clean and Sober (1989), Much Ado About Nothing (1993), The Paper (1994), Multiplicity (1996), Jackie Brown (1997), Herbie: Fully Loaded (2005), The Other Guys (2010), Spotlight (2015), The Founder (2016), Dumbo (2019), The Trial of the Chicago 7 (2020) and Worth (2021). He has also provided voices for characters in animated films such as Porco Rosso (1992), Cars (2006), Toy Story 3 (2010), and Minions (2015). In 2021, he starred in the limited series Dopesick on Hulu. In 2014, Keaton garnered critical acclaim for his performance in Alejandro González Iñárritu's black comedy film Birdman, winning a Golden Globe Award for Best Actor—Motion Picture Musical or Comedy and receiving a nomination for the Academy Award for Best Actor. He had previously received a Golden Globe Award nomination for his performance in Live from Baghdad (2002) and five Screen Actors Guild Award nominations, which ultimately yielded three wins for his performances in Birdman (2014), Spotlight (2015), and The Trial of the Chicago 7 (2020)."
        },
        {
            "id": 335,
            "name": "Michael Shannon",
            "image": "/6mMczfjM8CiS1WuBOgo5Xom1TcR.jpg",
            "birth_date": "1974-08-07",
            "biography": "Michael Corbett Shannon (born August 7, 1974) is an American actor, producer, musician, and theatre director. He has been nominated twice for the Academy Award for Best Supporting Actor for his roles in the Sam Mendes period drama Revolutionary Road (2008) and the Tom Ford psychological thriller Nocturnal Animals (2016). He earned Screen Actors Guild Award and Golden Globe Award nominations for his role in 99 Homes (2014), and a Tony Award nomination for Best Featured Actor in a Play for the Broadway revival of Eugene O'Neill's Long Day's Journey into Night (2016).\n\nShannon made his film debut in 1993 with Groundhog Day and received widespread attention for his performance in 8 Mile (2002). He is known for his on-screen versatility, performing in both comedies and dramas such as Pearl Harbor (2001), Bad Boys II (2003), Bug (2006), Before the Devil Knows You're Dead (2007), Bad Lieutenant: Port of Call New Orleans (2009), The Iceman (2012), Premium Rush (2012), The Night Before (2015), The Shape of Water (2017) and Knives Out (2019). He played Superman's Kryptonian adversary General Zod in Man of Steel (2013) and Batman v Superman: Dawn of Justice (2016), and is set to reprise the role in The Flash (2022). Shannon is a frequent collaborator of Jeff Nichols, appearing in all of his films: Shotgun Stories (2007), Take Shelter (2011), Mud (2012), Midnight Special, and Loving (both 2016). He is also known for his role as Nelson Van Alden in the HBO period drama series Boardwalk Empire (2010–2014), for which he was nominated for three Screen Actors Guild Awards. In 2021, he had a main role in the Hulu drama miniseries Nine Perfect Strangers."
        },
        {
            "id": 17402,
            "name": "Ron Livingston",
            "image": "/pr5CjWnkaf5WKTIYh8wtNufjmyb.jpg",
            "birth_date": "1967-06-05",
            "biography": "Ronald Joseph \"Ron\" Livingston (born June 5, 1967) is an American film and television actor. His roles include a disaffected corporate employee in the film Office Space, a sardonic writer in a short-term relationship with Carrie Bradshaw in the TV show Sex and the City, and Captain Lewis Nixon in the miniseries Band of Brothers. In 2006, he starred as FBI negotiator Matt Flannery in the Fox series Standoff, co-starring Rosemarie DeWitt, and he was an ad spokesman for Sprint Nextel. In 2009 he portrayed flight engineer Maddux Donner in the series Defying Gravity, which was cancelled after a single season.\n\nDescription above from the Wikipedia article Ron Livingston, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 16971,
            "name": "Maribel Verdú",
            "image": "/5ml5J9yDEV6ZLkinkS7vAHfE882.jpg",
            "birth_date": "1970-10-02",
            "biography": "María Isabel Verdú Rollán (born 2 October 1970), better known as Maribel Verdú, is a Spanish actress. She is the recipient of numerous accolades throughout her career spanning nearly four decades, including two Goya Awards for Best Actress, an Ariel Award for Best Actress, the Gold Medal of the Academy of Cinematographic Arts and Sciences of Spain in 2008 and the National Cinematography Award in 2009.\n\nVerdú made her acting debut at the age of thirteen in Captain Sánchez's Crime (1985). Some of her film credits include performances in Lovers (1991), Belle Époque (1992), Y tu mamá también (2001), Pan's Labyrinth (2006), The Blind Sunflowers (2008), Tetro (2009), Snow White (2012) and Raymond & Ray (2022). She also appeared as Nora Allen in the DC Extended Universe film The Flash, her second superhero film credit after Superlópez (2018)."
        },
        {
            "id": 525,
            "name": "Christopher Nolan",
            "image": "/xuAIuYSmsUzKlUMBFGVZaWsY3DZ.jpg",
            "birth_date": "1970-07-30",
            "biography": "Christopher Edward Nolan, CBE (born 30 July 1970) is a British-American film director, screenwriter, and producer. He was born in Westminster, London, England and holds both British and American citizenship due to his American mother. He is known for writing and directing critically acclaimed films such as Memento (2000), The Prestige (2006), The Dark Knight Trilogy (2005-12), Inception (2010), Interstellar (2014) and Dunkirk (2017). Nolan is the founder of the production company Syncopy Films. He often collaborates with his wife, producer Emma Thomas, and his brother, screenwriter Jonathan Nolan."
        },
        {
            "id": 1117313,
            "name": "John David Washington",
            "image": "/qoOp8XvZ4v7B0C9ZmtoRCl9CDSO.jpg",
            "birth_date": "1984-07-28",
            "biography": "John David Washington (born July 28, 1984) is an American actor and former American football running back. He shifted to an acting career like his father, Denzel Washington and mother, Pauletta Washington. In 2015, he started with the HBO comedy series Ballers and his role in BlacKkKlansman (2018) brought him a Golden Globe nomination for Best Actor. After seeing Washington's work in BlacKkKlansman, well-renowned director Christopher Nolan hand-picked him to anchor his thriller film Tenet (2020). Since then, Washington has also starred in Malcolm & Marie (2021), Amsterdam (2022) and The Creator (2023)."
        },
        {
            "id": 11288,
            "name": "Robert Pattinson",
            "image": "/3qZ09UE7lN6AtorfXFRYpEtSY93.jpg",
            "birth_date": "1986-05-13",
            "biography": "Robert Douglas Thomas Pattinson (born 13 May 1986) is an English actor. Noted for his versatile roles in both big-budget and independent films, Pattinson has been ranked among the world's highest-paid actors. After starting to act in a London theatre club at age 15, Pattinson began his film career by playing Cedric Diggory in the fantasy film Harry Potter and the Goblet of Fire (2005). He gained worldwide recognition for portraying Edward Cullen in The Twilight Saga film series (2008–2012), which grossed over $3.3 billion worldwide. After starring in the romantic dramas Remember Me (2010) and Water for Elephants (2011), Pattinson received critical acclaim for his performances in independent films from auteur directors. He starred in David Cronenberg's thriller Cosmopolis (2012), David Michôd's dystopian western The Rover (2014), James Gray's adventure drama The Lost City of Z (2016), the Safdie Brothers' crime drama Good Time (2017), Claire Denis' science-fiction drama High Life (2018), and Robert Eggers' psychological horror film The Lighthouse (2019). He returned to mainstream films with a leading role in Christopher Nolan's spy film Tenet (2020), and starred as the DC Comics superhero Batman in Matt Reeves' film The Batman (2022)."
        },
        {
            "id": 1133349,
            "name": "Elizabeth Debicki",
            "image": "/ljHfp4MKl5quPmf98gGHBNdO9Vd.jpg",
            "birth_date": "1990-08-24",
            "biography": "Elizabeth Debicki (born 24 August 1990) is an Australian actress. After making her feature film debut in A Few Best Men (2011), she appeared in The Great Gatsby (2013) as Jordan Baker. Other roles are in the limited series The Night Manager (2016) and Widows (2018)."
        },
        {
            "id": 11181,
            "name": "Kenneth Branagh",
            "image": "/AbCqqFxNi5w3nDUFdQt0DGMFh5H.jpg",
            "birth_date": "1960-12-10",
            "biography": "Sir Kenneth Charles Branagh (born 10 December 1960) is a British actor and filmmaker. Branagh trained at the Royal Academy of Dramatic Art in London; in 2015 he succeeded Richard Attenborough as its president. He has been nominated for five Academy Awards and five Golden Globe Awards. He has won three BAFTAs and two Emmy Awards. He was appointed a Knight Bachelor in the 2012 Birthday Honours and knighted on 9 November 2012.  He was made a Freeman of his native city of Belfast in January 2018. In 2020, he was listed at number 20 on The Irish Times list of Ireland's greatest film actors.\n\nBranagh has both directed and starred in several film adaptations of William Shakespeare's plays, including Henry V (1989), Much Ado About Nothing (1993), Othello (1995), Hamlet (1996), Love's Labour's Lost (2000), and As You Like It (2006). He was nominated for Academy Awards for Best Actor and Best Director for Henry V and for Best Adapted Screenplay for Hamlet.\n\nHe has also starred in the television series Fortunes of War (1987), Shackleton (2002), and Wallander (2008–2016) and in the films Celebrity (1998), Wild Wild West (1999), The Road to El Dorado (2000), as SS leader Reinhard Heydrich in Conspiracy (2001), Harry Potter and the Chamber of Secrets (2002), Warm Springs (2005), as Major General Henning von Tresckow in Valkyrie (2008), The Boat That Rocked (2009), and as Sir Laurence Olivier in My Week with Marilyn (2011), Dunkirk (2017), and Tenet (2020). He won an International Emmy Award for Wallander and a Primetime Emmy Award for Conspiracy, and was nominated for the Academy Award for Best Supporting Actor for My Week with Marilyn.\n\nBranagh directed and starred in the romantic thriller Dead Again (1991), the horror film Mary Shelley's Frankenstein (1994), and the action thriller Jack Ryan: Shadow Recruit (2014). He directed and starred as Hercule Poirot in the mystery drama adaptations of Agatha Christie's Murder on the Orient Express (2017) and Death on the Nile (2022). He also directed such films as Swan Song (1992), which earned an Academy Award nomination for Best Live Action Short Film, The Magic Flute (2006), Sleuth (2007), the Marvel superhero film Thor (2011), and the live-action adaptation of Disney's Cinderella (2015),\n\nHe narrated numerous documentary series, including Cold War (1998), Walking with Dinosaurs (1999), The Ballad of Big Al (2001), Walking with Beasts (2001), Walking with Monsters (2005), and World War 1 in Colour (2005)."
        },
        {
            "id": 78921,
            "name": "Dimple Kapadia",
            "image": "/iqGELKRFsN6YkbzvgFl3q0c6Emv.jpg",
            "birth_date": "1957-06-08",
            "biography": "Dimple Kapadia (born 8 June 1957) is an Indian film actress who predominantly appears in Hindi films. She was launched by Raj Kapoor at age 16, playing the title role in his teen romance Bobby (1973). In that same year she married Indian actor Rajesh Khanna and retired from acting. Kapadia returned to the film industry in 1984, following her separation from Khanna. One of her films of that period was the drama Saagar (1985). Both Bobby and Saagar won her the Filmfare Award for Best Actress. She went on to establish herself as one of the leading actresses of Hindi cinema in the 1980s.\n\nInitially recognized as a national sex symbol, Kapadia was keen to avoid being stereotyped and expand her range of acting roles. She subsequently took on more serious parts in a range of film genres, from mainstream to parallel cinema, and received acclaim for her performances in such films as Kaash (1987), Drishti (1990), Lekin... (1990), and Rudaali (1993), which earned her a National Film Award for Best Actress and a Filmfare Critics Award for Best Actress. She followed with supporting roles in Gardish (1993) and Krantiveer (1994), the latter of which garnered her a fourth Filmfare Award.\n\nKapadia continued working infrequently through the 1990s and the 2000s. She played a minor part in Dil Chahta Hai (2001) and was noted for her portrayal of the title role in the American production Leela (2002). Some of her later film credits include leading roles in Hum Kaun Hai? (2004), Pyaar Mein Twist (2005), Phir Kabhi (2008) and Tum Milo Toh Sahi (2010), and supporting roles in Being Cyrus (2005), Luck by Chance (2009), Dabangg (2010), Cocktail (2012) and Finding Fanny (2014). Kapadia is the mother of Twinkle Khanna and Rinke Khanna, both former actresses."
        },
        {
            "id": 1227717,
            "name": "Himesh Patel",
            "image": "/fC6diZ0i3Epot9dRl7b2SSegf4L.jpg",
            "birth_date": "1990-10-30",
            "biography": "Himesh Patel was born on October 13, 1990 in Huntingdon, Cambridgeshire, England as Himesh Jitendra Patel. He is an actor and writer, known for EastEnders: E20 (2010), My Pure Land (2017) and EastEnders (1985)."
        },
        {
            "id": 101542,
            "name": "Ti West",
            "image": "/y65ZHU9m830lbdbggxC8eOT123S.jpg",
            "birth_date": "1980-10-05",
            "biography": "Ti West (born October 5, 1980) is an American film director, producer, screenwriter, editor, cinematographer, and occasional actor. He is best known for directing horror films such as \"The House of the Devil\" (2009), \"The Innkeepers\" (2011) and \"X\" (2022). He has also directed segments for horror anthologies such as \"V/H/S\" (2012) and \"The ABCs of Death\" (2012), in addition to episodes of television shows such as \"Scream: The TV Series\" (2015-2019), \"The Exorcist\" (2016-2017) and \"The Resident\" (2018-)."
        },
        {
            "id": 1137824,
            "name": "Mia Goth",
            "image": "/wLfyapNgOaLdhYSHGDmTk17kIfN.jpg",
            "birth_date": "1993-10-25",
            "biography": "Mia Gypsy Mello da Silva Goth (born 1993) is an English actress and model best known for her work in the ongoing horror film franchise X (2022–present).\n\nFollowing a brief stint modeling as a teenager, Goth made her feature film debut in Nymphomaniac (2013). She went on to have supporting roles in the sci-fi thriller The Survivalist (2015), the sci-fi horror High Life (2018), the supernatural horror Suspiria (2018), and the romantic comedy Emma (2020). Goth starred in Ti West's slasher films X and Pearl (both 2022), the latter of which she also co-wrote."
        },
        {
            "id": 974169,
            "name": "Jenna Ortega",
            "image": "/7oUAtVgZU0uLdUSvDHKkINt1y7Y.jpg",
            "birth_date": "2002-09-27",
            "biography": "Jenna Marie Ortega (born September 27, 2002) is an American actress. She began her career as a child actress, receiving recognition for her role as young Jane on The CW comedy-drama series Jane the Virgin (2014–2019). She had her breakthrough for starring as Harley Diaz on the Disney Channel series Stuck in the Middle (2016–2018), for which she won an Imagen Award. She played Ellie Alves in the second season of the Netflix thriller series You in 2019 and starred in the Netflix family film Yes Day (2021).\n\nOrtega received critical praise for her performance in the teen drama The Fallout (2021), and went on to star in the slasher films X (2022), Scream (2022) and its sequel Scream VI (2023), establishing herself as a scream queen. She starred as Wednesday Addams in the Netflix horror comedy series Wednesday (2022), for which she received nominations for a Primetime Emmy Award, a Golden Globe Award and a SAG Award.\n\nDescription above from the Wikipedia article Jenna Ortega, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 29221,
            "name": "Brittany Snow",
            "image": "/uSQW2E7caOaXHBbvL2jdzGbwDwH.jpg",
            "birth_date": "1986-03-09",
            "biography": "Brittany Anne Snow (born March 9, 1986) is an American actress. She rose to prominence after appearing in the CBS soap opera Guiding Light (1998–2001), for which she won a Young Artist Award for Best Young Actress and was nominated for two other Young Artist Awards and a Soap Opera Digest Award. She then starred in the NBC drama series American Dreams (2002–2005), for which she was nominated for a Young Artist Award and three Teen Choice Awards.\n\nSnow has appeared in various films, including The Pacifier (2005), John Tucker Must Die (2006), Hairspray (2007), Prom Night (2008), Would You Rather (2012), the Pitch Perfect film series (2012–2017), Bushwick (2017), Hangman (2017), Someone Great (2019), and X (2022). She also appeared in the NBC legal comedy-drama series Harry's Law (2011) and in the Fox drama series Almost Family (2019–2020).\n\nSnow is the co-founder of the Love Is Louder movement, a project by the not-for-profit Jed Foundation, dedicated to stop bullying in schools. Snow also started a mental health letter writing initiative in 2020 called \"September Letters\"."
        },
        {
            "id": 484359,
            "name": "Kid Cudi",
            "image": "/z5TRmx4WQB9Ge1WQa6VdxBKnwmC.jpg",
            "birth_date": "1984-01-30",
            "biography": "Scott Ramon Seguro Mescudi (born January 30, 1984), better known by his stage name Kid Cudi (often stylized as KiD CuDi), is an American-Mexican rapper, singer, songwriter, record producer, and actor. He has widely been recognized as an influence on several contemporary hip hop and alternative acts. His lyrics are often autobiographical and describe his childhood hardships of depression, loneliness and alienation, his struggle with alcohol and drugs into adulthood, as well as themes of spirituality, heartbreak, dissipation and celebration. Cudi began to gain major recognition following the release of his first official full-length project, a mixtape titled A Kid Named Cudi (2008), which caught the attention of American musician Kanye West, who subsequently signed Cudi to his GOOD Music label imprint by late 2008."
        },
        {
            "id": 26291,
            "name": "Martin Henderson",
            "image": "/avJFARzEPaB24rKQUYLinGQqilL.jpg",
            "birth_date": "1974-10-08",
            "biography": "Martin Henderson (born October 8, 1974) is a New Zealand actor, well known to American audiences for his starring role in the ABC TV series Off the Map, while remaining known in his home country for his teenage role as Stuart Neilson in the soap opera Shortland Street."
        },
        {
            "id": 132220,
            "name": "Owen Campbell",
            "image": "/bRdQybqqBGh67WOUdLrpB4MYUZT.jpg",
            "birth_date": "1994-06-09",
            "biography": "Owen Campbell (born June 9, 1994) is an American stage, film and television actor. He is best known for his roles as RJ in X (2022), Zach in Super Dark Times (2017) and Jack in As You Are (2016). He grew up in Brooklyn, New York and studied at Fiorello H. LaGuardia High School of Performing Arts. His earliest film credit dates back to 2009, with Dominic Murphy's White Lightnin', where Campbell starred alongside the late Carrie Fisher."
        },
        {
            "id": 1795072,
            "name": "Nia DaCosta",
            "image": "/zRyaLNXLT2gKgPvLreyg3GeEIdD.jpg",
            "birth_date": "1989-11-08",
            "biography": "Nia DaCosta (born November 8, 1989) is an American screenwriter and director. She is known for her breakout film \"Little Woods\" (2018), the supernatural horror legacy sequel \"Candyman\" (2021), and the MCU superhero film \"The Marvels\" (2023), which continues the stories of characters introduced in the film \"Captain Marvel\" and the Disney+ shows \"WandaVision\" and \"Ms. Marvel.\""
        },
        {
            "id": 60073,
            "name": "Brie Larson",
            "image": "/nOoqQouupZaaa959wLZR01n2xmW.jpg",
            "birth_date": "1989-10-01",
            "biography": "Brie Larson (born Brianne Sidonie Desaulniers; October 1, 1989), is an American actress and filmmaker. She's best known for her role as Carol Danvers / Captain Marvel in Captain Marvel (2019) and reprise her role in other MCU films and series. She's also known for her roles as Elizabeth Zott in the miniseries Lessons in Chemistry (which she also executive produced), Tess in Fast X, Eva Ansley in Just Mercy, Jeannette Walls in The Glass Castle, Mason Weaver in Kong: Skull Island, Joy \"Ma\" Newsome in Room, Kim Townsend in Trainwreck, Amy Phillips in The Gambler, Monica Martello in Don Jon, Cassidy Roy in The Spectacular Now, Molly Tracey in 21 Jump Street, Helen in Rampart, Envy Adams in Scott Pilgrim vs. the World, Kate Gregson on Showtime's United States of Tara, Beatrice \"The Bear\" Leep in Hoot, and Emily Stewart on WB's sitcom Raising Dad.\n\nShe appeared as a regular in the 2001 sitcom Raising Dad and briefly dabbled with a music career, releasing the album Finally Out of P.E. in 2005. She played supporting roles in the comedy films 13 Going on 30 (2004), Hoot (2006), Scott Pilgrim vs. the World (2010), and 21 Jump Street (2012), and appeared as a sardonic teenager in the television series United States of Tara (2009–2011).\n\nHer breakthrough came with a leading role in the acclaimed independent drama Short Term 12 (2013), and she continued to take on supporting parts in the romance The Spectacular Now (2013) and the comedy Trainwreck (2015). For playing a kidnapping victim in the drama Room (2015), she won the Academy Award for Best Actress.\n\nThe 2017 adventure film Kong: Skull Island marked her first big-budget release, followed by Free Fire, The Glass Castle, Unicorn Store, and Basmati Blues, the same year. She then starred as Carol Danvers / Captain Marvel in the 2019 Marvel Cinematic Universe superhero film Captain Marvel. She reprised her role in other MCU films including Avengers: Endgame, Shang-Chi and the Legend of the Ten Rings, Avengers: Quantum Encounter, and The Marvels, as well as in the series Ms. Marvel. She then starred in and executive produced the comedy-drama Apple TV+ miniseries Lessons in Chemistry (2023). She also starred in Fast X (2023).\n\nShe has co-written and co-directed two short films, and made her feature film directorial debut with the independent comedy-drama Unicorn Store (2017). For producing the virtual reality series The Messy Truth VR Experience (2020), she won a Primetime Emmy Award."
        },
        {
            "id": 970219,
            "name": "Teyonah Parris",
            "image": "/k3U24YNgdaINZEQ4PftebnN5cpU.jpg",
            "birth_date": "1987-09-22",
            "biography": "Teyonah Parris (born September 22, 1987) is an American actress. She began her career playing a recurring role as Dawn Chambers in the AMC drama series, Mad Men, before landing her breakthrough role in the 2014 independent film Dear White People. In 2015, Parris starred in the satirical drama film Chi-Raq directed by Spike Lee.\n\nParris gained further recognition for her role as Monica Rambeau / Photon in WandaVision (2021) and The Marvels (2023). Other notable film credits include If Beale Street Could Talk (2018), Candyman (2021) and They Cloned Tyrone (2023)."
        },
        {
            "id": 2798462,
            "name": "Iman Vellani",
            "image": "/ojt4pq4x9zINjgBfMEKGGtCoOaC.jpg",
            "birth_date": "2002-08-12",
            "biography": "Iman Vellani (born 12 August 2002) is a Pakistani-born Canadian actress, known for Ms. Marvel (2022) and The Marvels (2023)."
        },
        {
            "id": 118034,
            "name": "Zawe Ashton",
            "image": "/fsDeJvBb1TlE9cmMPuizvxSAyHh.jpg",
            "birth_date": "1984-07-21",
            "biography": "Zawedde Emma Ashton (born 25 July 1984) is a British actress, playwright and narrator. She is best known for her roles in the comedy dramas Fresh Meat and Not Safe for Work, the Netflix horror thriller film Velvet Buzzsaw and for her portrayal of Joyce Carol Vincent in Dreams of a Life (2011). She will join the Marvel Cinematic Universe as Dar-Benn in The Marvels (2023)."
        },
        {
            "id": 2231,
            "name": "Samuel L. Jackson",
            "image": "/nCJJ3NVksYNxIzEHcyC1XziwPVj.jpg",
            "birth_date": "1948-12-21",
            "biography": "Samuel Leroy Jackson (born December 21, 1948) is an American actor and producer. One of the most widely recognized actors of his generation, the films in which he has appeared have collectively grossed over $27 billion worldwide, making him the second highest-grossing actor of all time. The Academy of Motion Picture Arts and Sciences gave him an Academy Honorary Award in 2022 as \"A cultural icon whose dynamic work has resonated across genres and generations and audiences worldwide\".\n\nJackson started his career on stage making his professional theatre debut in Mother Courage and her Children in 1980 at The Public Theatre. From 1981 to 1983 he originated the role of Private Louis Henderson in A Soldier's Play Off-Broadway. He also originated the role of Boy Willie in August Wilson's The Piano Lesson in 1987 at the Yale Repertory Theatre. He returned to the play in the 2022 Broadway revival playing Doaker Charles. Jackson early film roles include Coming to America (1988), Goodfellas (1990), Patriot Games (1992), Juice (1992), True Romance (1993), and Jurassic Park (1993), Menace II Society (1993), and Fresh (1994). His collaborations with Spike Lee led to greater prominence with films such as School Daze (1988), Do the Right Thing (1989), Mo' Better Blues (1990), Jungle Fever (1991), Oldboy (2013), and Chi-Raq (2015).\n\nJackson's breakout role was in Quentin Tarantino's Pulp Fiction (1994) which earned him a BAFTA Award win and a nomination for the Academy Award for Best Supporting Actor. He further collaborated with Tarantino, acting in Jackie Brown (1997), Django Unchained (2012), and The Hateful Eight (2015). He's known for having appeared in a number of big-budget films, including Die Hard with a Vengeance (1995), A Time to Kill (1996), The Long Kiss Goodnight (1996), The Negotiator (1997), Deep Blue Sea (1999), Unbreakable (2000), Shaft (2000) and its reboot (2019), XXX (2002), S.W.A.T. (2003), Coach Carter (2005), Snakes on a Plane (2006), Kingsman: The Secret Service (2014), Kong: Skull Island (2017), and Glass (2019).\n\nHe also gained widespread recognition as the Jedi Mace Windu in the Star Wars prequel trilogy (1999–2005), later voicing the role in the animated film Star Wars: The Clone Wars (2008) and the video game Lego Star Wars: The Clone Wars (2011). With his permission, his likeness was used for the Ultimate version of the Marvel Comics character Nick Fury; he subsequently played Fury in 11 Marvel Cinematic Universe films, beginning with a cameo appearance in Iron Man (2008), as well as guest-starring in the television series Agents of S.H.I.E.L.D. He will reprise this role in the upcoming Disney+ series Secret Invasion, which is set to premiere on June 21, 2023. Jackson has provided his voice for several animated films, documentaries, television series, and video games, including Lucius Best / Frozone in the Pixar films The Incredibles (2004) and Incredibles 2 (2018)."
        },
        {
            "id": 480,
            "name": "Gary Lewis",
            "image": "/cOaibfAluUeWPtcSOjedfGXn9ym.jpg",
            "birth_date": "1958-11-30",
            "biography": "From Wikipedia, the free encyclopedia\n\nGary Lewis (born Gary Stevenson on 30 November 1958) is a Scottish actor. He has had parts in Billy Elliot, Gangs of New York, Eragon and Three and Out, as well as a major role in the television docudrama, Supervolcano.\n\nDescription above from the Wikipedia article Gary Lewis (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 578,
            "name": "Ridley Scott",
            "image": "/zABJmN9opmqD4orWl3KSdCaSo7Q.jpg",
            "birth_date": "1937-11-30",
            "biography": "Sir Ridley Scott (born November 30, 1937) is an English filmmaker. He was raised in an Army family, meaning that for most of his early life, his father — an officer in the Royal Engineers — was absent. Ridley's older brother, Frank, joined the Merchant Navy when he was still young and the pair had little contact. During this time the family moved around, living in (among other areas) Cumbria, Wales and Germany. He has a younger brother, Tony, also a film director. After the Second World War, the Scott family moved back to their native north-east England, eventually settling in Teesside (whose industrial landscape would later inspire similar scenes in Blade Runner). He enjoyed watching films, and his favourites include Lawrence of Arabia, Citizen Kane and Seven Samurai. Scott studied in Teesside from 1954 to 1958, at Grangefield Grammar School and later in West Hartlepool College of Art, graduating with a Diploma in Design. He progressed to an M.A. in graphic design at the Royal College of Art from 1960 to 1962.\n\nAt the RCA he contributed to the college magazine, ARK and helped to establish its film department. For his final show, he made a black and white short film, Boy and Bicycle, starring his younger brother, Tony Scott, and his father. The film's main visual elements would become features of Scott's later work; it was issued on the 'Extras' section of The Duellists DVD. After graduation in 1963, he secured a job as a trainee set designer with the BBC, leading to work on the popular television police series Z-Cars and the science fiction series Out of the Unknown. Scott was an admirer of Stanley Kubrick early in his development as a director. For his entry to the BBC traineeship, Scott remade Paths of Glory as a short film.\n\nHe was assigned to design the second Doctor Who serial, The Daleks, which would have entailed realising the famous alien creatures. However, shortly before Scott was due to start work, a schedule conflict meant that he was replaced on the serial by Raymond Cusick.\n\nAt the BBC, Scott was placed into a director training programme and, before he left the corporation, had directed episodes of Z-Cars, its spin-off, Softly, Softly, and adventure series Adam Adamant Lives!\n\nIn 1968, Ridley and Tony Scott founded Ridley Scott Associates (RSA), a film and commercial production company.Five members of the Scott family are directors, all working for RSA. Brother Tony has been a successful film director for more than two decades; sons, Jake and Luke are both acclaimed commercials directors as is his daughter, Jordan Scott. Jake and Jordan both work from Los Angeles and Luke is based in London.\n\nIn 1995, Shepperton Studios was purchased by a consortium headed by Ridley and Tony Scott, which extensively renovated the studios while also expanding and improving its grounds.  "
        },
        {
            "id": 4139,
            "name": "Tom Skerritt",
            "image": "/8iTZjd5W1EFKg3NRNsKht0akdGB.jpg",
            "birth_date": "1933-08-25",
            "biography": "Thomas Roy Skerritt (born August 25, 1933) is an American actor who has appeared in more than forty films and more than two hundred television episodes since 1962. He is known for his film roles in M*A*S*H, Alien, The Dead Zone, Top Gun, A River Runs Through It, Up in Smoke, and the television series Picket Fences. Skerritt has earned several nominations and awards, including a Primetime Emmy Award for Outstanding Lead Actor in a Drama Series in 1993 for Picket Fences.  Description above from the Wikipedia article Tom Skerritt, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 10205,
            "name": "Sigourney Weaver",
            "image": "/wTSnfktNBLd6kwQxgvkqYw6vEon.jpg",
            "birth_date": "1949-10-08",
            "biography": "Susan Alexandra \"Sigourney\" Weaver (born October 8, 1949) is an American actress. Weaver is considered to be a pioneer of action heroines in science fiction films. She is known for her role as Ellen Ripley in the Alien franchise, which earned her an Academy Award nomination in 1986 and is often regarded as one of the most significant female protagonists in cinema history.\n\nA seven-time Golden Globe Award nominee, Weaver won both Best Actress in Drama and Best Supporting Actress in 1988 for her work in the films Gorillas in the Mist and Working Girl, becoming the first person to win two acting Golden Globes in the same year. She also received Academy Award nominations for both films. For her role in the film The Ice Storm (1997), she won the BAFTA Award for Best Actress ina Supporting Role. She also received a Tony Award nomination for her work in the 1984 Broadway play Hurlyburly.\n\nWeaver's other film roles include Ghostbusters (1984), Ghostbusters II (1989), Dave (1993), Galaxy Quest (1999), Holes (2003), WALL-E (2008), Avatar (2009), Prayers for Bobby (2009), Paul (2011), The Cabin in the Woods (2012), and A Monster Calls (2016); and the television miniseries Political Animals (2012) and The Defenders (2017).\n\nDescription above from the Wikipedia article Sigourney Weaver, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 5047,
            "name": "Veronica Cartwright",
            "image": "/4qudrTfSzPOWoZMA3IfkjrNoI6c.jpg",
            "birth_date": "1949-04-20",
            "biography": "Veronica Cartwright (born April 20, 1949) is a British-born American actress. She is known for appearing in science fiction and horror films, and has earned numerous accolades, including three Primetime Emmy Award nominations. Her younger sister is actress Angela Cartwright.\n\nAs a child actress, Cartwright appeared in supporting roles in The Children's Hour and The Birds, the latter of which was her first commercial success. She made her transition into mainstream, mature roles with 1978's Invasion of the Body Snatchers. The following year, she played Lambert in the science-fiction horror film Alien, which earned her recognition and a Saturn Award for Best Supporting Actress. She additionally appeared in the films The Right Stuff and The Witches of Eastwick which earned her praise, and in the 1990s, received three nominations for the Primetime Emmy Award for Outstanding Guest Actress in a Drama Series, one of which was for her role on ER and two of which were for her role in The X-Files.\n\nFrom Wikipedia, the free encyclopedia"
        },
        {
            "id": 5048,
            "name": "Harry Dean Stanton",
            "image": "/197UiLVdxPOv8196sqmUpJzOQB5.jpg",
            "birth_date": "1926-07-14",
            "biography": "Harry Dean Stanton (July 14, 1926 – September 15, 2017) was an American actor. In a career that spanned more than six decades, Stanton played supporting roles in films including Cool Hand Luke (1967), Kelly's Heroes (1970), Dillinger (1973), The Godfather Part II (1974), Alien (1979), Escape from New York (1981), Christine (1983), Repo Man (1984), One Magic Christmas (1985), Pretty in Pink (1986), The Last Temptation of Christ (1988), Wild at Heart (1990), The Straight Story (1999), The Green Mile (1999), The Man Who Cried (2000), Alpha Dog (2006), and Inland Empire (2006). He had rare lead roles in Paris, Texas (1984) and in Lucky (2017).\n\nDescription above from the Wikipedia article Harry Dean Stanton, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 5049,
            "name": "John Hurt",
            "image": "/kFNlnnjCm7MsRNJ5yzZEH2YJIPC.jpg",
            "birth_date": "1940-01-22",
            "biography": "Sir John Vincent Hurt (January 22, 1940 – January 25, 2017) was an English actor whose career spanned over five decades. He came to prominence for his role as Richard Rich in the film A Man for All Seasons (1966) and gained BAFTA Award nominations for his portrayals of Timothy Evans in 10 Rillington Place (1971) and Quentin Crisp in television film The Naked Civil Servant (1975) – winning his first BAFTA for the latter. He played Caligula in the BBC TV series I, Claudius (1976). Hurt's performance in the prison drama Midnight Express (1978) brought him international renown and earned Golden Globe and BAFTA Awards, along with an Academy Award nomination. His BAFTA-nominated portrayal of astronaut Kane, in the science-fiction horror film Alien (1979), notably included a scene where an alien creature burst out of his chest, named by several publications as one of the most memorable moments in cinema history.\n\nHurt earned his third competitive BAFTA, along with his second Oscar and Golden Globe nominations, as Joseph Merrick in David Lynch's biopic The Elephant Man (1980). Other significant roles during the 1980s included Bob Champion in biopic Champions (1984), Mr. Braddock in the Stephen Frears drama The Hit (1984), Winston Smith in Nineteen Eighty-Four (1984) and Stephen Ward in the drama depicting the Profumo affair, Scandal (1989). Hurt was again BAFTA-nominated for his work in Irish drama The Field (1990) and played the primary villain, James Graham, in the epic adventure Rob Roy (1995). His later films include the Harry Potter film series (2001–11), the Hellboy films (2004 and 2008), supernatural thriller The Skeleton Key (2005), western The Proposition (2005), political thriller V for Vendetta (2005), action adventure Indiana Jones and the Kingdom of the Crystal Skull (2008), sci-fi action Outlander (2008) and the Cold War espionage film Tinker Tailor Soldier Spy (2011). Hurt reprised his role as Quentin Crisp in An Englishman in New York (2009), which brought his seventh BAFTA nomination. He portrayed the War Doctor in the BBC TV series Doctor Who's 50th anniversary special, \"The Day of the Doctor\", in 2013.\n\nHurt was regarded as one of Britain's finest actors; director David Lynch described him as \"simply the greatest actor in the world\". He possessed what was described as the \"most distinctive voice in Britain\", likened by The Observer to \"nicotine sieved through dirty, moonlit gravel\". His voice acting career encompassed films such as Watership Down (1978), The Lord of the Rings (1978), The Plague Dogs (1982), The Black Cauldron (1985), Dogville (2003) and Planet Dinosaur (2011) as well as BBC TV series Merlin (2008–2012). In 2012, he was honoured with the Lifetime Achievement BAFTA Award, in recognition of his \"outstanding contribution to cinema\". He was knighted in 2015 for his services to drama."
        },
        {
            "id": 65,
            "name": "Ian Holm",
            "image": "/tz81JSiPdcLM7b624W1BcYdxd4D.jpg",
            "birth_date": "1931-09-12",
            "biography": "Sir Ian Holm Cuthbert CBE (12 September 1931 – 19 June 2020) was an English actor. After beginning his career on the British stage as a leading member of the Royal Shakespeare Company, he became a successful and prolific performer on television and in films. He received numerous accolades including two BAFTA Awards and a Tony Award, along with nominations for an Academy Award and two Emmy Awards. He was made a Commander of the Order of the British Empire (CBE) in 1989 by Queen Elizabeth II.\n\nHolm won the 1967 Tony Award for Best Featured Actor for his performance as Lenny in the Harold Pinter play The Homecoming. He won the Laurence Olivier Award for Best Actor for his performance in the title role in the 1998 West End production of King Lear. For his television roles he received two Primetime Emmy Award nominations for King Lear (1998), and the HBO film The Last of the Blonde Bombshells (2003).\n\nHe gained acclaim for his role in The Bofors Gun (1968) winning the BAFTA Award for Best Actor in a Supporting Role. He was nominated for an Academy Award for Best Supporting Actor and a BAFTA Award win for his role as athletics trainer Sam Mussabini in Chariots of Fire (1981). Other notable films he appeared in include Alien (1979), Brazil (1985), Henry V (1989), The Madness of King George (1994), The Fifth Element (1997), The Sweet Hereafter (1997), and The Aviator (2004). He gained wider appreciation for his role as the elderly Bilbo Baggins in Peter Jackson's The Lord of the Rings and The Hobbit trilogies. He also voiced Chef Skinner in the Pixar animated film Ratatouille (2007).\n\nDescription above from the Wikipedia article Ian Holm, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 1521437,
            "name": "Rebekah McKendry",
            "image": "/Ai8M5FDeeFqnULXyIsElrIVyc4K.jpg",
            "birth_date": "1978-10-08",
            "biography": "Rebekah McKendry is American film director, producer, film journalist, podcaster and academic. She is best known for her work on Glorious (2022), All the Creatures Were Stirring (2017), and as a co-host of the horror-themed podcast Colors of the Dark."
        },
        {
            "id": 1780952,
            "name": "Gino Anania",
            "image": "/gIdGuxcvhdwcI7TVKkRto7qi54c.jpg",
            "birth_date": null,
            "biography": ""
        },
        {
            "id": 2425167,
            "name": "Verity Marks",
            "image": "/talMbdr17VcIWayyPeeIcUCX4wK.jpg",
            "birth_date": null,
            "biography": ""
        },
        {
            "id": 2537199,
            "name": "Alec Carlos",
            "image": "/pJpbBcA79cRuDVmq81KWhYxlz4f.jpg",
            "birth_date": null,
            "biography": ""
        },
        {
            "id": 1742672,
            "name": "Nazariy Demkowicz",
            "image": "/kUAgCQI8DFtw6HV4cJwGliQmDAW.jpg",
            "birth_date": null,
            "biography": ""
        },
        {
            "id": 3671057,
            "name": "Liam Stewart-Kanigan",
            "image": "/qGVVX9iWmOp9Cadmqd1lUZG1y5B.jpg",
            "birth_date": null,
            "biography": ""
        },
        {
            "id": 3824147,
            "name": "Madison MacIsaac",
            "image": "/nHcNlwsbdM4C9463HkQoqE6aPhU.jpg",
            "birth_date": "2002-05-09",
            "biography": "Born and raised in the Midwestern prairies of Winnipeg, Manitoba, Madison MacIsaac is a Canadian actress known for her supporting lead roles in feature films including Elevator Games (2024), and as part of Universal Studios' Bring it On franchise, in Bring it On: Cheer or Die (2022). Her roles have showcased a range of comedic styles, from dry sarcasm to bubbly cluelessness. Madison took an early interest in the art of storytelling when, at the age of 14, she directed her school's musical production of Beauty and the Beast. It was this collaboration with the cast that sparked her intrigue with the art of performing. She began taking acting classes, both in Vancouver and in her hometown, where she launched her professional acting career in 2020. When Madison is not training or on set, she enjoys travelling and taking dance classes, with a particular fondness for ballet."
        },
        {
            "id": 101666,
            "name": "Paul King",
            "image": "/hDixADZQOBP0E3G9ZxC4kuNHO0.jpg",
            "birth_date": "1960-11-20",
            "biography": "Paul King is a writer and director. He works in television, film, and theatre, and specializes in comedy.\n\nHe graduated from St Catharine's College, Cambridge University with first-class honors in English in 1999. There he met Richard Ayoade, Matthew Holness and Alice Lowe, and went on to direct them at the Edinburgh Festival in \"Garth Marenghi's FrightKnight\" (nominated for the Perrier Award in 2000), and \"Netherhead\" (Perrier Award winner 2001). King worked as Associate Director on the subsequent TV transfer, Garth Marenghi's Darkplace, a six-part series for Channel 4. In 2002, King garnered another Perrier Award nomination for directing Noel Fielding's Edinburgh Festival show, \"Voodoo Hedgehog\".\n\nPaul King is also the director for The Mighty Boosh. He has directed all three series (earning a BAFTA nomination as Best New Director in 2004) and their live tour shows in 2006 and 2008. King was originally brought in after the director of the pilot, Steve Bendelack, was unavailable to direct the first series. He also directed Matt Lucas and David Walliams' 2011 airport mockumentary Come Fly With Me.\n\nKing wrote his first feature film, Bunny and the Bull, in 2009, which he also directed. The film stars Simon Farnaby and Edward Hogg, with cameos from Noel Fielding, Richard Ayoade, and Julian Barratt.\n\nDescription above from the Wikipedia article Paul King, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 1190668,
            "name": "Timothée Chalamet",
            "image": "/BE2sdjpgsa2rNTFa66f7upkaOP.jpg",
            "birth_date": "1995-12-27",
            "biography": "Timothée Hal Chalamet (born December 27, 1995) is an American actor.\n\nHe began his career appearing in the drama series Homeland in 2012. Two years later, he made his film debut in the comedy-drama Men, Women & Children and appeared in Christopher Nolan's science fiction film Interstellar. He came into attention in Luca Guadagnino's coming-of-age film Call Me by Your Name (2017). Alongside supporting roles in Greta Gerwig's films Lady Bird (2017) and Little Women (2019), he took on starring roles in Beautiful Boy (2018) and Dune (2021)."
        },
        {
            "id": 1939373,
            "name": "Calah Lane",
            "image": "/rhEcrfvtkIuzjOvt010xHiVHWXY.jpg",
            "birth_date": "2009-04-20",
            "biography": "Calah Francie Lane (born April 20, 2009) is an American teen actress, singer, and dancer. Her breakthrough was her role as main character Noodle opposite Timothée Chalamet in the Warner Bros. production Wonka (2023), directed by Paul King, in which she was nominated for a 2023 Critics' Choice Award in the category Best Young Actor/Actress."
        },
        {
            "id": 298410,
            "name": "Keegan-Michael Key",
            "image": "/vAR5gVXRG2Cl6WskXT99wgkAoH8.jpg",
            "birth_date": "1971-03-22",
            "biography": "Keegan-Michael Key (born March 22, 1971, height 6' 1\" (1,85 m)) is an American actor and comedian best known for starring in the Comedy Central sketch series Key & Peele and for his six seasons as a cast member on MADtv.\n\nEarly life Key was born in Southfield, Michigan and raised in Detroit. His father is African-American and his mother is European-American. He was adopted as a child. In 1989 he graduated from Shrine Catholic High School in Royal Oak, Michigan. Key attended the University of Detroit as an undergraduate and earned his Master of Fine Arts at the Pennsylvania State University School of Theatre. While at The University of Detroit Mercy, he was a brother of Phi Kappa Theta."
        },
        {
            "id": 3291,
            "name": "Hugh Grant",
            "image": "/tUHkXYdwm405DjBm2IpPxGjYkjj.jpg",
            "birth_date": "1960-09-09",
            "biography": "Hugh John Mungo Grant (born 9 September 1960) is an English actor and film producer. He has received a Golden Globe Award, a BAFTA, and an Honorary César. His movies have also earned more than $2.4 billion from 25 theatrical releases worldwide. Grant achieved international stardom after appearing in Richard Curtis's sleeper hit Four Weddings and a Funeral (1994). He used this breakthrough role as a frequent cinematic persona during the 1990s to deliver comic performances in mainstream films like Mickey Blue Eyes (1999) and Notting Hill (1999). By the turn of the century, he had established himself as a leading man skilled with a satirical comic talent. Since the 2000s, Grant has expanded his oeuvre with critically acclaimed turns as a cad in Bridget Jones's Diary (2001), About A Boy (2002), Love Actually (2003), and American Dreamz (2006).\n\nWithin the film industry, Grant is cited as an anti-movie star who approaches his roles like a character actor, with the ability to make acting look effortless. Hallmarks of his comic skills include a nonchalant touch of irony/sarcasm and studied physical mannerisms as well as his precisely-timed dialogue delivery and facial expressions. The entertainment media's coverage of Grant's life off the big screen has often overshadowed his work as a thespian. He has been vocal about his disrespect for the profession of acting, his disdain towards the culture of celebrity, and hostility towards the media. In a career spanning 20 years, Grant has repeatedly claimed that acting is not a true calling but just a job he fell into."
        },
        {
            "id": 19868,
            "name": "Paterson Joseph",
            "image": "/n8kf0aowLTcPSt72k0eC4ZShe3s.jpg",
            "birth_date": "1964-06-22",
            "biography": "Paterson Joseph (born June 22, 1964) is a British actor. He appeared in the Royal Shakespeare Company productions of King Lear and Love's Labour's Lost in 1990. On television he is known for his roles in Casualty, as Alan Johnson in Channel 4 sitcom Peep Show, Green Wing, Survivors, Boy Meets Girl, as DI Wes Layton in Law & Order: UK, and as Connor Mason in Timeless. His film roles include The Beach, Æon Flux and The Other Man."
        },
        {
            "id": 39187,
            "name": "Olivia Colman",
            "image": "/4ZwZ66zXZyX26Kf2wfeMt1tQZQf.jpg",
            "birth_date": "1974-01-30",
            "biography": "Sarah Caroline Sinclair CBE (January 30, 1974), known professionally as Olivia Colman, is an English actress. Known for her comedic and dramatic roles in film and television, she has received various accolades, including an Academy Award, a British Academy Film Award, two Emmy Awards, three British Academy Television Awards and three Golden Globe Awards.\n\nShe was acclaimed for her performance in the ITV crime-drama series Broadchurch (2013–2017), for which she received a British Academy Television Award for Best Actress. She played Queen Elizabeth II from 2019 to 2020 in the Netflix period-drama series The Crown, for which she received a Golden Globe Award and a Primetime Emmy Award for Outstanding Lead Actress in a Drama Series.\n\nFor her portrayal of Anne, Queen of Great Britain in the period black-comedy film The Favourite (2018), Colman received the Academy Award for Best Actress. She received additional Academy Award nominations for her performances in The Father (2020) and The Lost Daughter (2021). Other notable film and television credits include Hot Fuzz (2007), Tyrannosaur (2011), The Iron Lady (2011), Hyde Park on Hudson (2012), Locke (2013), The Lobster (2015), Fleabag (2016-2019), Murder on the Orient Express (2017), The Mitchells vs. the Machines (2021), Landscapers (2021), Empire of Light (2022), Puss in Boots: The Last Wish (2022), Secret Invasion (2023), Wonka (2023), Wicked Little Letters (2023) and Paddington in Peru (2024)."
        },
        {
            "id": 240,
            "name": "Stanley Kubrick",
            "image": "/yFT0VyIelI9aegZrsAwOG5iVP4v.jpg",
            "birth_date": "1928-07-26",
            "biography": "Stanley Kubrick (July 26, 1928 – March 7, 1999) was an American film director, writer, producer, and photographer who lived in England during most of the last four decades of his career. Kubrick was noted for the scrupulous care with which he chose his subjects, his slow method of working, the variety of genres he worked in, his technical perfectionism, and his reclusiveness about his films and personal life. He maintained almost complete artistic control, making movies according to his own whims and time constraints, but with the rare advantage of big-studio financial support for all his endeavors. Kubrick's films are characterized by a formal visual style and meticulous attention to detail—his later films often have elements of surrealism and expressionism that eschews structured linear narrative. His films are repeatedly described as slow and methodical, and are often perceived as a reflection of his obsessive and perfectionist nature. A recurring theme in his films is man's inhumanity to man. While often viewed as expressing an ironic pessimism, a few critics feel his films contain a cautious optimism when viewed more carefully.\n\nThe film that first brought him attention to many critics was Paths of Glory (1957), the first of three films of his about the dehumanizing effects of war. Many of his films at first got a lukewarm reception, only to be years later acclaimed as masterpieces that had a seminal influence on many later generations of film-makers. Considered especially groundbreaking was 2001: A Space Odyssey (1968) noted for being both one of the most scientifically realistic and visually innovative science-fiction films ever made while maintaining an enigmatic non-linear storyline. He voluntarily withdrew his film A Clockwork Orange (1971) from England, after it was accused of inspiring copycat crimes which in turn resulted in threats against Kubrick's family. His films were largely successful at the box-office, although Barry Lyndon (1975) performed poorly in the United States. Living authors Anthony Burgess and Stephen King were both unhappy with Kubrick's adaptations of their novels A Clockwork Orange and The Shining (1980) respectively, and both authors were engaged with subsequent adaptations. All of Kubrick's films from the mid-1950s to his death except for The Shining were nominated for Oscars, Golden Globes, or BAFTAs. Although he was nominated for an Academy Award as a screenwriter and director on several occasions, his only personal win was for the special effects in 2001: A Space Odyssey.\n\nEven though all of his films, apart from the first two, were adapted from novels or short stories, his works have been described by Jason Ankeny and others as \"original and visionary\". Although some critics, notably Andrew Sarris and Pauline Kael, frequently disparaged Kubrick's work, Ankeny describes Kubrick as one of the most \"universally acclaimed and influential directors of the postwar era\" with a \"standing unique among the filmmakers of his day.\""
        },
        {
            "id": 245,
            "name": "Keir Dullea",
            "image": "/dL9i0nCk2fCgInZNaYVjGck2IBp.jpg",
            "birth_date": "1936-05-30",
            "biography": "Keir Dullea (born May 30, 1936) is an American actor best known for the character of astronaut David Bowman, whom he portrayed in the 1968 film 2001: A Space Odyssey and in 1984's 2010: The Year We Make Contact, as well as his roles in the films Bunny Lake is Missing (1965) and Black Christmas (1974)."
        },
        {
            "id": 246,
            "name": "Gary Lockwood",
            "image": "/lQBqZKpMxGslopZRvFanIWL4pSl.jpg",
            "birth_date": "1937-02-21",
            "biography": "Gary Lockwood (born February 21, 1937) is an American actor perhaps best known for his iconic 1968 role as the astronaut Dr. Frank Poole in 2001: A Space Odyssey. He is father of the actress Samantha Lockwood. Both currently live in Los Angeles."
        },
        {
            "id": 247,
            "name": "William Sylvester",
            "image": "/gDzQVVDyzTMLuyK3iSrorDt1Utf.jpg",
            "birth_date": "1922-01-31",
            "biography": "William Sylvester (January 31, 1922 – January 25, 1995) was an American TV and film actor. His most famous film credit was Dr. Heywood Floyd in Stanley Kubrick's 2001 A Space Odyssey (1968). Born in Oakland, California and married at one time to the British actress Veronica Hurst, he moved to England after the Second World War and became a staple of British B films at a time when American and Canadian actors were much in demand in order to give indigenous films some appeal in the US.\n\nAs a result, he gained top billing in one of his very first films, House of Blackmail (1953), directed by the veteran filmmaker Maurice Elvey, for whom he also made What Every Woman Wants the following year. He also starred in such minor films as The Stranger Came Home (1954, for Hammer), Dublin Nightmare (1958), Offbeat (1960), Information Received (1961), Incident at Midnight, Ring of Spies and Blind Corner (all 1963). There were also lead roles in four British horror films: Gorgo (1960), Devil Doll (1963), Devils of Darkness (1964) and The Hand of Night (1966). Among his many TV credits were a 1959 BBC version of Shakespeare's Julius Caesar (playing Mark Antony), The Saint, The Baron, The High Chaparral, Harry O and The Six Million Dollar Man.\n\nHis later films included You Only Live Twice (1967) and, back in the USA after his prominent role for Kubrick, Busting (1973), The Hindenburg (1975) and Heaven Can Wait (1978). He died in Sacramento, California in 1995, aged 72."
        },
        {
            "id": 253,
            "name": "Douglas Rain",
            "image": "/blDCxSTUP5U9EdKOmhGtRvhby2c.jpg",
            "birth_date": "1928-03-13",
            "biography": "Douglas Rain (March 13, 1928 - November 11, 2018) was a Canadian actor and narrator. He was primarily a stage actor, but his best known film role was as the voice of the HAL 9000 computer in 2001: A Space Odyssey (1968) and its sequel 2010 (1984).\n\nRain was born in Winnipeg, Manitoba. He studied acting at the Banff School of Fine Arts in Banff, Alberta as well as in London at the Old Vic School. As a stage actor, his long association with the Stratford Festival of Canada that spans more than four decades. He has performed in many diverse roles on stage, most notably recognized for his performance at Stratford, Ontario in Henry V which was made into a television production in 1966.\n\nRain was also nominated for Broadway's 1972 Tony Award as Best Supporting or Featured Actor (Dramatic) for his performance in Vivat! Vivat Regina!"
        },
        {
            "id": 248,
            "name": "Daniel Richter",
            "image": "/cq8Fprv33RgYPwu39cGx6fxk5Qp.jpg",
            "birth_date": "1939-06-15",
            "biography": ""
        },
        {
            "id": 249,
            "name": "Leonard Rossiter",
            "image": "/qXjGUJ2TjO3ltiEYMEJ658VeqkA.jpg",
            "birth_date": "1926-10-21",
            "biography": "From Wikipedia, the free encyclopedia.  Leonard Rossiter (21 October 1926 – 5 October 1984) was an English actor known for his roles as Rupert Rigsby, in the British comedy television series Rising Damp (1974–78), and Reginald Iolanthe Perrin, in The Fall and Rise of Reginald Perrin (1976–79). He also had a long and distinguished career in the theatre and gained some notoriety for a series of Cinzano commercials (1978–1983), with Joan Collins.\n\nDescription above from the Wikipedia article Leonard Rossiter, licensed under CC-BY-SA,full list of contributors on Wikipedia."
        },
        {
            "id": 122423,
            "name": "Yorgos Lanthimos",
            "image": "/kwKfSubzU8B0uLCEiPvY1mGOVwZ.jpg",
            "birth_date": "1973-09-23",
            "biography": "Yorgos Lanthimos was born in Pangrati, Athens. He was raised mainly by his mother. His father, Antonis Lanthimos, was a professional basketball player who played for Pagrati B.C. and the Greece national basketball team, and was also a basketball instructor at the Moraitis School. Having graduated from the Moraitis School, Lanthimos went on to study Business Administration and played for a period in Pagrati B.C. He eventually dropped out and went on to study Directing for Film and Television at the Hellenic Cinema and Television School Stavrakos (HCTSS) in Athens. He has directed a number of dance videos in collaboration with Greek choreographers, in addition to TV commercials, music videos, short films and theater plays. \"Kinetta\", his first feature film, played at Toronto and Berlin film festivals to critical acclaim. His second feature \"Dogtooth\", won the \"Un Certain Regard prize\" at the 2009 Cannes film festival, followed by numerous awards at festivals worldwide. It was nominated for a Best Foreign Language Film Academy Award (Oscar) in 2011. \"Alps\" won the \"Osella for best screenplay\" at the 2011 Venice film festival and Best Film at the Sydney film festival in 2012. His first English language film The Lobster was presented in Competition at the 68th Cannes Film Festival. Moreover, \"The Lobster\" was nominated for the (Oscar about the) Best Original Screenplay by the Academy and won Best Screenplay and Best Costume Design at the European Film Awards of 2015. His fifth project \"The Killing of a Sacred Deer\" was also presented in Competition at the 70th Cannes Film Festival where it won the award for the best Screenplay. His sixth feature \"The Favourite\" premiered at the 75th Venice International Film Festival, where it won the Grand Jury Prize and the Volpi Cup for Best Actress for Colman. His seventh feature \"Poor Things\" is a science-fiction romantic comedy based on the same-name 1992 novel by Alasdair Gray. It premiered at the 80th Venice International Film Festival on September 1, 2023, where it won the Golden Lion."
        },
        {
            "id": 54693,
            "name": "Emma Stone",
            "image": "/eWjkPYeXxPhE2F9J3Ui6E9OWVXy.jpg",
            "birth_date": "1988-11-06",
            "biography": "Emily Jean \"Emma\" Stone (born November 6, 1988) is an American actress. The recipient of numerous accolades, including two Academy Awards and two Golden Globe Award, she was the world's highest-paid actress in 2017.\n\nBorn and raised in Scottsdale, Arizona, Stone began acting as a child, in a theater production of The Wind in the Willows in 2000. As a teenager, she relocated to Los Angeles with her mother and made her television debut in In Search of the New Partridge Family (2004), a reality show that produced only an unsold pilot. After small television roles, she made her film debut in Superbad (2007), and received positive media attention for her role in Zombieland (2009). The 2010 teen comedy Easy A was Stone's first starring role, earning her nominations for the BAFTA Rising Star Award and a Golden Globe Award for Best Actress.\n\nStone gained wider recognition as Gwen Stacy in the 2012 superhero film The Amazing Spider-Man, and its 2014 sequel. She was nominated for the Academy Award for Best Supporting Actress for playing a recovering drug addict in the black comedy Birdman (2014), and her Broadway debut came in a revival of the musical Cabaret (2014–2015). She won the Academy Award for Best Actress for playing an aspiring actress in the romantic musical La La Land (2016). Stone received a third Academy Award nomination for her portrayal of Abigail Masham in the historical comedy-drama The Favourite (2018)."
        },
        {
            "id": 103,
            "name": "Mark Ruffalo",
            "image": "/z3dvKqMNDQWk3QLxzumloQVR0pv.jpg",
            "birth_date": "1967-11-22",
            "biography": "Mark Alan Ruffalo (born November 22, 1967) is an American actor and producer. He began acting in the early 1990s and first gained recognition for his work in Kenneth Lonergan's play This Is Our Youth (1998) and drama film You Can Count on Me (2000). He went on to star in the romantic comedies 13 Going on 30 (2004) and Just like Heaven (2005) and the thrillers In the Cut (2003), Zodiac (2007) and Shutter Island (2010). He received a Tony Award nomination for his supporting role in the Broadway revival of Awake and Sing! in 2006. Ruffalo gained international recognition for playing Bruce Banner / Hulk in superhero films set in the Marvel Cinematic Universe, including The Avengers (2012), Avengers: Infinity War (2018), and Avengers: Endgame (2019).\n\nRuffalo gained nominations for the Academy Award for Best Supporting Actor for playing a sperm-donor in the comedy-drama The Kids Are All Right (2010), Dave Schultz in the biopic Foxcatcher (2014), and Michael Rezendes in the drama Spotlight (2015). He won the Screen Actors Guild Award for Best Actor in a TV Movie for playing a gay writer and activist in the television drama film The Normal Heart (2015), and the Primetime Emmy Award for Outstanding Lead Actor in a Limited Series or Movie for his dual role as identical twins in the miniseries I Know This Much Is True (2020). Ruffalo is one of the few performers to receive all four EGOT nominations."
        },
        {
            "id": 5293,
            "name": "Willem Dafoe",
            "image": "/ui8e4sgZAwMPi3hzEO53jyBJF9B.jpg",
            "birth_date": "1955-07-22",
            "biography": "William James \"Willem\" Dafoe (born July 22, 1955) is an American actor. He is the recipient of various accolades, including the Volpi Cup for Best Actor, in addition to receiving nominations for four Academy Awards, four Screen Actors Guild Awards, three Golden Globe Awards, and a British Academy Film Award. He frequently collaborates with filmmakers Paul Schrader, Abel Ferrara, Lars von Trier, Julian Schnabel,  Wes Anderson, and Robert Eggers.\n\nDafoe was an early member of experimental theater company The Wooster Group. He made his film debut in Heaven's Gate (1980), but was fired during production. He had his first leading role in the outlaw biker film The Loveless (1982) and then played the main antagonist in Streets of Fire (1984) and To Live and Die in L.A. (1985). He received his first Academy Award nomination (as Best Supporting Actor) for his role as Sergeant Elias Grodin in Oliver Stone's war film Platoon (1986). In 1988, Dafoe played Jesus in Martin Scorsese's The Last Temptation of Christ and costarred in Mississippi Burning, both of which were controversial.\n\nAfter receiving his second Academy Award nomination (as Best Supporting Actor) for portraying Max Schreck in Shadow of the Vampire (2000), Dafoe portrayed the supervillain Norman Osborn / Green Goblin in the superhero film Spider-Man (2002), a role he reprised in its sequels Spider-Man 2 (2004) and Spider-Man 3 (2007), and the Marvel Cinematic Universe film Spider-Man: No Way Home (2021) earning him the Guinness World Record for the \"longest career as a live-action Marvel character\". He also portrayed the villains in Once Upon a Time in Mexico (2003) and XXX: State of the Union (2005), as well as Carson Clay in the film Mr. Bean's Holiday (2007). In 2009, he starred in the experimental film Antichrist, one of his three films with Lars von Trier. Dafoe then appeared in The Fault in Our Stars, John Wick, The Grand Budapest Hotel (all 2014), The Great Wall (2016), Murder on the Orient Express (2017), The Florida Project (2017) (for which he received his third Academy Award nomination in the Best Supporting Actor category), The Lighthouse (2019), The French Dispatch, and Nightmare Alley (both 2021). He portrayed Nuidis Vulko in the DC Extended Universe films Aquaman (2018), Zack Snyder's Justice League (2021) and Aquaman and the Lost Kingdom (2022).\n\nDafoe has portrayed several real-life figures, including T. S. Eliot in Tom & Viv (1994), Pier Paolo Pasolini in Pasolini (2014), Vincent van Gogh in At Eternity's Gate (2018) (for which he received an Academy Award for Best Actor nomination, his first in that category), and Leonhard Seppala in Togo (2019)."
        },
        {
            "id": 1382987,
            "name": "Ramy Youssef",
            "image": "/7ASVvzrU2cdhuIotzeKnqQVNNUM.jpg",
            "birth_date": "1991-03-26",
            "biography": "Ramy Youssef (born March 26, 1991) is an American stand-up comedian, actor, and writer of Egyptian descent. Youssef made his acting debut in the Nick@Nite sitcom See Dad Run. In 2019, Youssef made his breakthrough with Ramy, a show Youssef created, produced and starred in. Youssef received a Golden Globe Award for Best Actor in a Television Series for his performance."
        },
        {
            "id": 984629,
            "name": "Christopher Abbott",
            "image": "/7H5oo9jJSgrTNSvuD5IPA4gnOYW.jpg",
            "birth_date": "1986-02-10",
            "biography": "Christopher Jacob Abbott (born February 10, 1986) is an American actor. Abbott made his feature film debut in Martha Marcy May Marlene (2011). Abbott's other notable films include Hello I Must Be Going (2012), The Sleepwalker (2014) and A Most Violent Year (2014). In 2015, Abbott starred as the title character in the critically acclaimed film James White.\n\nAbbott is mostly known for his role as Charlie Dattolo in the HBO comedy-drama series Girls. Abbott has also had an extensive career on stage, having performed in both Broadway and Off-Broadway productions."
        },
        {
            "id": 2331794,
            "name": "Suzy Bemba",
            "image": "/1JT97VgV2l6jNpFeYXZ8SQu3BOr.jpg",
            "birth_date": "2000-06-22",
            "biography": "Suzy Bemba is an actress, known for Poor Things (2023), L'Opéra (2021) and Kandisha (2020)"
        },
        {
            "id": 2138168,
            "name": "Alberto Corredor",
            "image": "/zpZ8OmkUgZ1yVNK1AXLbyytSKl4.jpg",
            "birth_date": null,
            "biography": ""
        },
        {
            "id": 2146942,
            "name": "Freya Allan",
            "image": "/cjsSdfv9U8PboNG1SNfnvd5558T.jpg",
            "birth_date": "2001-09-06",
            "biography": "Freya Allan (born 6 September 2001) is an English actress, known for her role as Princess Cirilla of Cintra in the Netflix series The Witcher."
        },
        {
            "id": 225692,
            "name": "Jeremy Irvine",
            "image": "/nPeBcyemdjH7zu8fL8gu9O0lnsb.jpg",
            "birth_date": "1990-06-18",
            "biography": "Jeremy William Fredric Smith (born 18 June 1990), better known as Jeremy Irvine, is an English actor who made his film debut in the epic war film War Horse (2011). In 2012, he portrayed Philip \"Pip\" Pirrip in the film adaptation of Great Expectations, and earned widespread critical acclaim for his role in the independent film Now Is Good (2012).\n\nDescription above from the Wikipedia article Jeremy Irvine licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 2364040,
            "name": "Ruby Barker",
            "image": "/jUhPzsPmBrflNrEMoQmKuonSMu1.jpg",
            "birth_date": "1996-12-23",
            "biography": "Ruby Barker (born 23 December 1996) is a British actress. She is best known for playing Marina in the Netflix period drama Bridgerton (2020–present). In 2020, she was awarded Best Actress at the British Urban Film Festival for her starring role in the film How to Stop a Recurring Dream."
        },
        {
            "id": 3064,
            "name": "Peter Mullan",
            "image": "/7Y6oHcv719kfYxpWcYAE7wXzE7C.jpg",
            "birth_date": "1959-11-02",
            "biography": "Peter Mullan (born 2 November 1959) is a Scottish stage, film and television actor and director, best known for playing supporting roles in feature films such as \"Braveheart\" and \"Trainspotting\", and for starring as the titular character Joe Kavanagh in \"My Name Is Joe\"."
        },
        {
            "id": 1141591,
            "name": "Anne Müller",
            "image": "/hWtkVGRlNJFhyghijitfm949E1x.jpg",
            "birth_date": "1982-01-01",
            "biography": ""
        },
        {
            "id": 1561755,
            "name": "Svenja Jung",
            "image": "/jwfBAtZc6Xliv4hlbliCBCGMiHh.jpg",
            "birth_date": "1993-05-28",
            "biography": "The actress Svenja Jung was born on May 28, 1993 in Weroth and grew up there in the southern Westerwald. In 2012 she successfully passed her Abitur and then spent six months in Australia. Here, Svenja Jung kept his head above water with various jobs. Back in Germany, Jung began working seriously on her career as an actress. Even before she graduated from high school, she had taken additional acting classes. From 2010 to 2012, Svenja Jung studied at the Juniorhouse in Cologne and from 2011 to 2012 attended the Koblenz drama school. In a commercial for Nestlé, Svenja Jung was seen as a \"hero girl\". This was followed by smaller roles in TV series. In \"Heldt\" Svenja Jung played the role of Mandy. Thanks to her convincing performance, she landed her first leading role in 2014. In the series \"Unter Uns\" she played Lisa Brück. The dual role as police officer and escort lady demanded a lot of empathy from the young actress. With her performance, Svenja Jung proved that she has something to offer as an actor. Svenja Jung plays the leading role in the subsequent film adaptation of \"Fucking Berlin.\""
        },
        {
            "id": 125738,
            "name": "Daniel Espinosa",
            "image": "/rq6TkUBkSXvOrmKEjG5lt8kuhF4.jpg",
            "birth_date": "1977-03-23",
            "biography": "Jorge Daniel Espinosa (born 23 March 1977) is a Swedish film director from Trångsund, Stockholm of Chilean origin. He attended the National Film School of Denmark and graduated in 2001. His third feature film, Easy Money, was the Swedish film with most admissions in Sweden in 2010."
        },
        {
            "id": 7499,
            "name": "Jared Leto",
            "image": "/ca3x0OfIKbJppZh8S1Alx3GfUZO.jpg",
            "birth_date": "1971-12-26",
            "biography": "Jared Joseph Leto (/ˈlɛtoʊ/; born December 26, 1971) is an American actor and musician. After starting his career with television appearances in the early 1990s, he achieved recognition for his role as Jordan Catalano on the television series My So-Called Life (1994). He made his film debut in How to Make an American Quilt (1995) and received critical praise for his performance in Prefontaine (1997).\n\nAfter supporting roles in The Thin Red Line (1998), Fight Club (1999), Girl, Interrupted (1999) and American Psycho (2000), and the lead role in Urban Legend (1998), he earned critical acclaim for portraying heroin addict Harry Goldfarb in Requiem for a Dream (2000). He began focusing increasingly on music, then returned to acting with Panic Room (2002), Alexander (2004), Lord of War (2005), Lonely Hearts (2006), Chapter 27 (2007), and Mr. Nobody (2009). His performance as a transgender woman in Dallas Buyers Club (2013) earned him an Academy Award, a Golden Globe Award, and a Screen Actors Guild Award for Best Supporting Actor. He starred in Suicide Squad (2016), Blade Runner 2049 (2017), The Little Things (2021) and House of Gucci (2021), of which the latter two earned him nominations for a Golden Globe Award and Screen Actors Guild Award for Best Supporting Actor.\n\nLeto is the lead vocalist, multi-instrumentalist and main songwriter for Thirty Seconds to Mars, a band he formed with his older brother Shannon Leto. Their debut album, 30 Seconds to Mars (2002), released to positive reviews but limited commercial success. The band achieved worldwide fame with the release of their second album A Beautiful Lie (2005). Their following releases, This Is War (2009), and Love, Lust, Faith and Dreams (2013), received further critical success, and their fifth album, America (2018), marked new commercial success. As of September 2014, they have sold over 15 million albums worldwide.\n\nLeto is considered a method actor, known for his constant devotion to and research of his roles. He often remains completely in character for the duration of shooting schedules of his films, even to the point of adversely affecting his health. He is also known to be selective about his film roles.\n\nDescription above from the Wikipedia article Jared Leto, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 136532,
            "name": "Matt Smith",
            "image": "/b3AYe7kkImkB35CoYwlUqHnJGF8.jpg",
            "birth_date": "1982-10-28",
            "biography": "Matthew Robert Smith (born 28 October 1982) is an English actor. He is best known for his roles as the eleventh incarnation of the Doctor in the BBC series Doctor Who (2010–2013), Daemon Targaryen in the HBO series House of the Dragon (2022–present) and Prince Philip in the Netflix series The Crown (2016–2017), the latter of which earned him a Primetime Emmy Award nomination.\n\nSmith initially aspired to be a professional footballer, but spondylolysis forced him out of the sport. After joining the National Youth Theatre and studying drama and creative writing at the University of East Anglia, he became an actor in 2003, performing in plays including Murder in the Cathedral, Fresh Kills, The History Boys and On the Shore of the Wide World in London theatres. Extending his repertoire into West End theatre, he has since performed in the stage adaptation of Swimming with Sharks with Christian Slater, followed a year later by a critically acclaimed performance as Henry in That Face.\n\nSmith's first television role came in 2006 as Jim Taylor in the BBC adaptations of Philip Pullman's The Ruby in the Smoke and The Shadow in the North, while his first major role in television came as Danny in the 2007 BBC series Party Animals. Smith portrayed the eleventh incarnation of the Doctor in Doctor Who from 2010 to 2013, becoming the youngest person to portray the character. In film, he portrayed a dual role in Womb (2010), the physical forms of Skynet in Terminator Genisys (2015), 1960s pimp Jack in Last Night in Soho (2021), and Milo in Morbius (2022)."
        },
        {
            "id": 1371297,
            "name": "Adria Arjona",
            "image": "/2xAwAxrjZrgfyrNYToBIjg1ZeRB.jpg",
            "birth_date": "1992-04-25",
            "biography": "Adria Arjona (born April 25, 1992) is a Puerto Rican actress. She is the oldest daughter of Guatemalan singer-songwriter Ricardo Arjona and Puerto Rican model Leslie Torres."
        },
        {
            "id": 15440,
            "name": "Jared Harris",
            "image": "/8GvXtLomIdCjROjlwKQYURKJwIq.jpg",
            "birth_date": "1961-08-24",
            "biography": "Jared Francis Harris is a British actor who has appeared in film, television, and theater. He is the son of the late Irish actor Richard Harris and the Welsh actress Elizabeth Rees-Williams.\n\nHarris was born in Hammersmith, London, in 1961. He studied drama and literature at Duke University in North Carolina, and then went on to train at the Royal Central School of Speech and Drama in London.\n\nHarris made his film debut in 1989 with a small role in the film The Rachel Papers. He went on to appear in a number of films, including The Last of the Mohicans (1992), Natural Born Killers (1994), Smoke (1995), Happiness (1998), and How to Kill Your Neighbor's Dog (2000).\n\nIn 2007, Harris began a recurring role as Lane Pryce in the AMC television series Mad Men. He was nominated for a Primetime Emmy Award for Outstanding Supporting Actor in a Drama Series for his performance.\n\nHarris has also had notable roles in television series such as Fringe, The Crown, and The Expanse. In 2019, he won the British Academy Television Award for Best Actor for his performance as Valery Legasov in the HBO miniseries Chernobyl.\n\nOn stage, Harris has appeared in productions of The Crucible, The Cherry Orchard, and The Homecoming. He has also directed several stage productions, including The Glass Menagerie and The Birthday Party."
        },
        {
            "id": 90534,
            "name": "Al Madrigal",
            "image": "/p4vN80EGGlzLb5J7G8Ss3n9K2pc.jpg",
            "birth_date": "1971-07-04",
            "biography": "Alessandro Liborio Madrigal (born July 4, 1971) is an American comedian, writer, actor and producer. He is a co-founder of the All Things Comedy podcast network, alongside Bill Burr. He rose to fame on The Daily Show with Jon Stewart as a regular correspondent for five seasons. Outside of the standup world, he is known for his co-starring roles in the film Night School, Showtime's dark comedy I'm Dying Up Here, NBC's About A Boy, as well as CBS sitcoms Gary Unmarried and Welcome to The Captain. He has also performed on Conan and The Tonight Show Starring Jimmy Fallon.\n\nHe appeared in the sports drama The Way Back, starring Ben Affleck and directed by Gavin O’Connor. He appears in the Sony's Spider-Man Universe film Morbius as Alberto \"Al\" Rodriguez.\n\nDescription above from the Wikipedia article Al Madrigal, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 8169,
            "name": "Tyrese Gibson",
            "image": "/1K315wBQBvDBuZMlzoozuGsqFXZ.jpg",
            "birth_date": "1978-12-30",
            "biography": "Tyrese Darnell Gibson (born December 30, 1978), also known mononymously as Tyrese, is an American Grammy-nominated R&B singer, songwriter, actor, author, television producer, former fashion model and MTV VJ. He is best known for his role as Roman Pearce in the The Fast and the Furious series."
        },
        {
            "id": 11218,
            "name": "Alfonso Cuarón",
            "image": "/eoCHiXaQzGgx9RiwXnt3k239FLc.jpg",
            "birth_date": "1961-11-28",
            "biography": "Alfonso Cuarón Orozco (born 28 November 1961) is a Mexican filmmaker. Cuarón is the first Mexico-born filmmaker to win the Academy Award for Best Director. He has been nominated for Academy Awards in six different categories, a record he shares with Walt Disney and George Clooney.\n\nCuarón has received 10 Academy Award nominations, winning four including Best Director for Gravity (2013) and Roma (2018), Best Film Editing for Gravity, and Best Cinematography for Roma. His other notable films from a variety of genres include the family drama A Little Princess (1995), the romantic drama Great Expectations (1998), the coming of age road film Y tu mamá también (2001), the fantasy film Harry Potter and the Prisoner of Azkaban (2004), and the science fiction dystopian thriller Children of Men (2006)."
        },
        {
            "id": 18277,
            "name": "Sandra Bullock",
            "image": "/1v7ICpAYIRUJcfDEdB6OSaG33H.jpg",
            "birth_date": "1964-07-26",
            "biography": "Sandra Annette Bullock (born July 26, 1964) is an American actress and producer. She rose to fame in the 1990s with roles in films such as Demolition Man (1993), Speed (1994), The Net (1995), While You Were Sleeping (1995), A Time to Kill (1996), and Hope Floats (1998). In the new millennium, Bullock starred in Miss Congeniality (2000), Two Weeks Notice (2002), The Lake House (2006), and the critically acclaimed Crash (2004).\n\nBullock was awarded the Broadcast Film Critics Association Award for Best Actress, Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role, Golden Globe Award for Best Actress – Motion Picture Drama, and the Academy Award for Best Actress for her role as Leigh Anne Tuohy in The Blind Side.\n\nThe scar above her left eye was caused when she fell into a creek as a child."
        },
        {
            "id": 1461,
            "name": "George Clooney",
            "image": "/4s3wI0bqOP7K3hhcmKqV6m3GYiQ.jpg",
            "birth_date": "1961-05-06",
            "biography": "George Timothy Clooney (born May 6, 1961) is an American actor and filmmaker. He is the recipient of numerous accolades, including a British Academy Film Award, four Golden Globe Awards, and two Academy Awards, one for his acting and the other as a producer. In 2018, he was the recipient of the AFI Life Achievement Award, and in 2022, he was felicitated at the Kennedy Center Honors for a \"lifetime of contributions to American culture.\"\n\nDescription above from the Wikipedia article George Clooney, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 228,
            "name": "Ed Harris",
            "image": "/aAu9lJ02jlg0GAvv2vVnpJSDV1Y.jpg",
            "birth_date": "1950-11-28",
            "biography": "Ed Harris is an American stage, film and television actor, writer, producer and director, best known for playing supporting characters in feature films such as \"Apollo 13\", \"A Beautiful Mind\", and \"The Truman Show\", as well as many recurring and starring roles in television shows, among them the portrayal of The Man in Black in HBO's \"Westworld\". He holds a BFA in Drama from the California Institute of the Arts, Valencia, USA."
        },
        {
            "id": 1223440,
            "name": "Orto Ignatiussen",
            "image": "/jpbMzoXaPjgZGjNOtGAxnZSO3Pz.jpg",
            "birth_date": null,
            "biography": ""
        },
        {
            "id": 58587,
            "name": "Phaldut Sharma",
            "image": "/iJKcwRJXEcZngnvseylidVHCg6j.jpg",
            "birth_date": null,
            "biography": "Phaldut \"Paul\" Sharma, also known as Paul Sharma, is a UK-based actor and dancer. He is known for his roles in Gavin and Stacey as Achmed and Eastenders as AJ Ahmed ."
        },
        {
            "id": 1223442,
            "name": "Amy Warren",
            "image": "/6HVjs4uho7gGEfRobKrwbqFeF37.jpg",
            "birth_date": "1968-02-24",
            "biography": ""
        },
        {
            "id": 1150,
            "name": "Brian De Palma",
            "image": "/t29YojZlOEqNSWvfmY0DDYh3vnb.jpg",
            "birth_date": "1940-09-11",
            "biography": "Brian Russell De Palma is an American film director and writer. In a career spanning over 40 years, he is probably best known for his suspense and crime thriller films, including such box office successes as Carrie, Dressed to Kill, Scarface, The Untouchables, and Mission: Impossible.\n\nThroughout the 1970s and early 1980s, De Palma worked repeatedly with actors Jennifer Salt, Amy Irving, Nancy Allen (his wife from 1979 to 1983), Gary Sinise, John Lithgow, William Finley, Charles Durning, Gerrit Graham, cinematographers Stephen H. Burum and Vilmos Zsigmond (see List of noted film director and cinematographer collaborations), set designer Jack Fisk, and composers Bernard Herrmann and Pino Donaggio. De Palma is credited with fostering the careers of or outright discovering Robert De Niro, Jill Clayburgh, John C. Reilly, John Leguizamo, Andy Garcia and Margot Kidder."
        },
        {
            "id": 1158,
            "name": "Al Pacino",
            "image": "/2dGBb1fOcNdZjtQToVPFxXjm4ke.jpg",
            "birth_date": "1940-04-25",
            "biography": "Alfredo James Pacino (born April 25, 1940) is an American actor and filmmaker. In a career spanning over five decades, he has received many awards and nominations, including an Academy Award, two Tony Awards, and two Primetime Emmy Awards. He is one of the few performers to have received the Triple Crown of Acting. He has also been honored with the AFI Life Achievement Award, the Cecil B. DeMille Award, and the National Medal of Arts.\n\nA method actor and former student of the HB Studio and the Actors Studio, where he was taught by Charlie Laughton and Lee Strasberg, Pacino's film debut came at the age of 29 with a minor role in Me, Natalie (1969). He gained favorable notice for his first lead role as a heroin addict in The Panic in Needle Park (1971). Wide acclaim and recognition came with his breakthrough role as Michael Corleone in Francis Ford Coppola's The Godfather (1972), for which he received his first Oscar nomination, and he would reprise the role in the sequels The Godfather Part II (1974) and The Godfather Part III (1990).\n\nHis portrayal of Michael Corleone is regarded as one of the greatest in film history. Pacino received nominations for the Academy Award for Best Actor for Serpico (1973), The Godfather Part II, Dog Day Afternoon (1975), and ...And Justice for All (1979), ultimately winning it for playing a blind military veteran in Scent of a Woman (1992). For his performances in The Godfather, Dick Tracy (1990), Glengarry Glen Ross (1992), and The Irishman (2019), he earned Best Supporting Actor Oscar nominations.\n\nOther notable portrayals include Tony Montana in Scarface (1983), Carlito Brigante in Carlito's Way (1993), Benjamin Ruggiero in Donnie Brasco (1997), and Lowell Bergman in The Insider (1999). He has also starred in the thrillers Heat (1995), The Devil's Advocate (1997), Insomnia (2002), and appeared in Once Upon a Time in Hollywood (2019). On television, Pacino has acted in several productions for HBO, including Angels in America (2003) and the Jack Kevorkian biopic You Don't Know Jack (2010), winning a Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie for each. Pacino currently stars in the Amazon Video web television series Hunters (2020–present).\n\nHe has also had an extensive career on stage. He is a two-time Tony Award winner, in 1969 and 1977, for his performances in Does a Tiger Wear a Necktie? and The Basic Training of Pavlo Hummel. Pacino made his filmmaking debut with Looking for Richard (1996), directing and starring in this documentary about Richard III; Pacino had played the lead role on stage in 1977. He has also acted as Shylock in a 2004 feature film adaptation and 2010 stage production of The Merchant of Venice. Pacino directed and starred in Chinese Coffee (2000), Wilde Salomé (2011), and Salomé (2013). Since 1994, he has been the joint president of the Actors Studio.​\n\nFrom Wikipedia, the free encyclopedia"
        },
        {
            "id": 1159,
            "name": "Steven Bauer",
            "image": "/eMSeKPgfilE2v5VcmwSt5pxbp0x.jpg",
            "birth_date": "1956-12-02",
            "biography": "Steven Bauer (born December 2, 1956) is a Cuban-American actor. He is known for his role as Manny Ribera in the 1983 film Scarface, and his role on the bilingual PBS show Que Pasa, USA."
        },
        {
            "id": 1160,
            "name": "Michelle Pfeiffer",
            "image": "/oGUmQBU87QXAsnaGleYaAjAXSlj.jpg",
            "birth_date": "1958-04-29",
            "biography": "Michelle Marie Pfeiffer (born April 29, 1958) is an American actress and producer. She has received many accolades, including a Golden Globe Award, and three nominations for Academy Award.\n\nPfeiffer began to pursue an acting career in 1978 and had her first leading role in the musical film Grease 2 (1982). Frustrated with being typecast as the token pretty girl, she actively pursued more serious material and had her breakthrough role as gangster moll Elvira Hancock in the crime film Scarface (1983). Further success came with leading roles in the fantasy feature The Witches of Eastwick (1987) and the comedy Married to the Mob (1988). Her roles in Dangerous Liaisons (1988) and The Fabulous Baker Boys (1989) garnered her two consecutive Academy Award nominations, for Best Supporting Actress and Best Actress, respectively; her portrayal of lounge singer Susie Diamond in the latter is one of the most acclaimed of her career.\n\nPfeiffer went on to star as Catwoman / Selina Kyle in Tim Burton's superhero film Batman Returns (1992), following which she won the Silver Bear for Best Actress and earned a third Academy Award nomination for playing a troubled housewife in Love Field (1992). She continued to gain praise for her performances in the dramas The Age of Innocence (1993) and White Oleander (2002), and the horror films Wolf (1994) and What Lies Beneath (2000). During this time, she also produced a series of films under her production company Via Rosa Productions. After a hiatus from acting in 2002, she returned with the musical Hairspray (2007). She received her first Emmy Award nomination for portraying Ruth Madoff in the HBO television film The Wizard of Lies (2017), she went on to feature in the ensemble films Murder on the Orient Express (2017) and debuted in the Marvel Cinematic Universe as Janet Van Dyne in Ant-Man and the Wasp (2018). Since then, she has reprised her role in Avengers: Endgame (2019) and Ant-Man and the Wasp: Quantumania (2023).\n\nDescription above from the Wikipedia article Michelle Pfeiffer, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 1161,
            "name": "Mary Elizabeth Mastrantonio",
            "image": "/vbZ1E557K5oj34xLHR5ErO8wPCi.jpg",
            "birth_date": "1958-11-17",
            "biography": "Mary Elizabeth Mastrantonio (born November 17, 1958) is an American actress and singer known for her role in The Color of Money, The Abyss, Scarface, and Robin Hood: Prince of Thieves."
        },
        {
            "id": 1162,
            "name": "Robert Loggia",
            "image": "/mRSUgJnfprCNw83pyVfpfW7ryfK.jpg",
            "birth_date": "1930-01-03",
            "biography": "Salvatore \"Robert\" Loggia (January 3, 1930 – December 4, 2015) was an American actor. He was nominated for the Academy Award for Best Supporting Actor for Jagged Edge (1985) and won the Saturn Award for Best Supporting Actor for Big (1988).\n\nIn a career spanning over sixty years, Loggia performed in many films, including The Greatest Story Ever Told (1965), three Pink Panther films, An Officer and a Gentleman (1982), Scarface (1982), Prizzi's Honor (1985), Oliver & Company (1988), Innocent Blood (1992), Independence Day (1996), Lost Highway (1997), Return to Me (2000), and Tim and Eric's Billion Dollar Movie (2012).\n\nDescription above from the Wikipedia article Robert Loggia, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 1163,
            "name": "Miriam Colon",
            "image": "/oW8N63FyKbcOK4eWbnpXPjcTzk4.jpg",
            "birth_date": "1936-08-20",
            "biography": "From Wikipedia, the free encyclopedia\n\nMíriam Colón (born August 20, 1936) is a Puerto Rican actress and the founder and director of the Puerto Rican Traveling Theater in New York City.\n\nDescription above from the Wikipedia article Míriam Colón, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 40,
            "name": "Orson Welles",
            "image": "/e9lGmqQq3EsHeUQgQLByo275hcc.jpg",
            "birth_date": "1915-05-06",
            "biography": "George Orson Welles (May 6, 1915 – October 10, 1985), best known as Orson Welles, was an American film director, actor, theatre director, screenwriter, and producer, who worked extensively in film, theatre, television and radio. Noted for his innovative dramatic productions as well as his distinctive voice and personality, Welles is widely acknowledged as one of the most accomplished dramatic artists of the twentieth century, especially for his significant and influential early work—despite his notoriously contentious relationship with Hollywood. His distinctive directorial style featured layered, nonlinear narrative forms, innovative uses of lighting such as chiaroscuro, unique camera angles, sound techniques borrowed from radio, deep focus shots, and long takes. Welles's long career in film is noted for his struggle for artistic control in the face of pressure from studios. Many of his films were heavily edited and others left unreleased. He has been praised as a major creative force and as \"the ultimate auteur.\"\n\nAfter directing a number of high-profile theatrical productions in his early twenties, including an innovative adaptation of Macbeth and The Cradle Will Rock, Welles found national and international fame as the director and narrator of a 1938 radio adaptation of H. G. Wells's novel The War of the Worlds performed for the radio drama anthology series Mercury Theatre on the Air. It was reported to have caused widespread panic when listeners thought that an invasion by extraterrestrial beings was occurring. Although these reports of panic were mostly false and overstated, they rocketed Welles to instant notoriety.\n\nCitizen Kane (1941), his first film with RKO, in which he starred in the role of Charles Foster Kane, is often considered the greatest film ever made. Several of his other films, including The Magnificent Ambersons (1942), The Lady from Shanghai (1947), Touch of Evil (1958), Chimes at Midnight (1965), and F for Fake (1974), are also widely considered to be masterpieces.\n\nIn 2002, he was voted the greatest film director of all time in two separate British Film Institute polls among directors and critics, and a wide survey of critical consensus, best-of lists, and historical retrospectives calls him the most acclaimed director of all time. Andrew Sarris in his influential book of film criticism The American Cinema: Directors and Directions 1929–1968 included him in the \"pantheon\" of the 14 greatest film directors who had worked in the United States. Well known for his baritone voice, Welles was also an extremely well regarded actor and was voted number 16 in AFI's 100 Years... 100 Stars list of the greatest American film actors of all time. He was also a celebrated Shakespearean stage actor and an accomplished magician, starring in troop variety shows in the war years."
        },
        {
            "id": 40,
            "name": "Orson Welles",
            "image": "/e9lGmqQq3EsHeUQgQLByo275hcc.jpg",
            "birth_date": "1915-05-06",
            "biography": "George Orson Welles (May 6, 1915 – October 10, 1985), best known as Orson Welles, was an American film director, actor, theatre director, screenwriter, and producer, who worked extensively in film, theatre, television and radio. Noted for his innovative dramatic productions as well as his distinctive voice and personality, Welles is widely acknowledged as one of the most accomplished dramatic artists of the twentieth century, especially for his significant and influential early work—despite his notoriously contentious relationship with Hollywood. His distinctive directorial style featured layered, nonlinear narrative forms, innovative uses of lighting such as chiaroscuro, unique camera angles, sound techniques borrowed from radio, deep focus shots, and long takes. Welles's long career in film is noted for his struggle for artistic control in the face of pressure from studios. Many of his films were heavily edited and others left unreleased. He has been praised as a major creative force and as \"the ultimate auteur.\"\n\nAfter directing a number of high-profile theatrical productions in his early twenties, including an innovative adaptation of Macbeth and The Cradle Will Rock, Welles found national and international fame as the director and narrator of a 1938 radio adaptation of H. G. Wells's novel The War of the Worlds performed for the radio drama anthology series Mercury Theatre on the Air. It was reported to have caused widespread panic when listeners thought that an invasion by extraterrestrial beings was occurring. Although these reports of panic were mostly false and overstated, they rocketed Welles to instant notoriety.\n\nCitizen Kane (1941), his first film with RKO, in which he starred in the role of Charles Foster Kane, is often considered the greatest film ever made. Several of his other films, including The Magnificent Ambersons (1942), The Lady from Shanghai (1947), Touch of Evil (1958), Chimes at Midnight (1965), and F for Fake (1974), are also widely considered to be masterpieces.\n\nIn 2002, he was voted the greatest film director of all time in two separate British Film Institute polls among directors and critics, and a wide survey of critical consensus, best-of lists, and historical retrospectives calls him the most acclaimed director of all time. Andrew Sarris in his influential book of film criticism The American Cinema: Directors and Directions 1929–1968 included him in the \"pantheon\" of the 14 greatest film directors who had worked in the United States. Well known for his baritone voice, Welles was also an extremely well regarded actor and was voted number 16 in AFI's 100 Years... 100 Stars list of the greatest American film actors of all time. He was also a celebrated Shakespearean stage actor and an accomplished magician, starring in troop variety shows in the war years."
        },
        {
            "id": 7664,
            "name": "Joseph Cotten",
            "image": "/djfCB0jPOgmq3w7RD3BMLzWsAu8.jpg",
            "birth_date": "1905-05-15",
            "biography": "Joseph Cheshire Cotten (May 15, 1905 – February 6, 1994) was an American actor of stage and film. Cotten achieved prominence on Broadway, starring in the original productions of The Philadelphia Story and Sabrina Fair. He is associated with Orson Welles, leading to appearances in Citizen Kane (1941), The Magnificent Ambersons (1942), Journey into Fear (1943), for which Cotten was also credited with the screenplay, and The Third Man (1949). He was a star in his own right with films such as Shadow of a Doubt (1943), Love Letters (1945), Portrait of Jennie (1948), and The Third Man (1949)."
        },
        {
            "id": 11029,
            "name": "Dorothy Comingore",
            "image": "/1vABUVxz3h2fxt5NOjwpMj4KSF4.jpg",
            "birth_date": "1913-08-24",
            "biography": "From Wikipedia, the free encyclopedia\n\nMary Louise Comingore, best known professionally as Dorothy Comingore (August 24, 1913 – December 30, 1971), was an American film actress. She is best known for starring as Susan Alexander Kane in Citizen Kane (1941), the critically acclaimed debut film of Orson Welles. In earlier films she was credited as Linda Winters, and she had appeared on the stage as Kay Winters. Her career ended when she was caught up in the Hollywood blacklist. She declined to answer questions when she was called before the House Un-American Activities Committee in 1952."
        },
        {
            "id": 14518,
            "name": "Ray Collins",
            "image": "/usQN1n6UMPwYrTuTKdiSxUj8Qwa.jpg",
            "birth_date": "1889-12-09",
            "biography": "​From Wikipedia, the free encyclopedia\n\nRay Bidwell Collins (December 10, 1889 – July 11, 1965) was an American character actor in stock and Broadway theatre, radio, films, and television. With 900 stage roles to his credit, he became one of the most successful actors in the developing field of radio drama.\n\nA friend and associate of Orson Welles for many years, Collins went to Hollywood with the Mercury Theatre company and made his feature-film debut in Citizen Kane, as Kane's ruthless political rival.\n\nCollins appeared in more than 75 films and had one of his best-remembered roles on television, as the irascible Lieutenant Arthur Tragg on the television series Perry Mason."
        },
        {
            "id": 11028,
            "name": "George Coulouris",
            "image": "/cB87rJWOsstpwhBXk6nqqZ9SEJg.jpg",
            "birth_date": "1903-10-01",
            "biography": "George Coulouris was a British stage, film and television actor."
        },
        {
            "id": 11025,
            "name": "Agnes Moorehead",
            "image": "/7o36YiQhngUEZ6eZUNQwFh8cbV7.jpg",
            "birth_date": "1900-12-04",
            "biography": "Agnes Robertson Moorehead (December 6, 1900 – April 30, 1974) was an American actress. Although she began with the Mercury Theatre, appeared in more than seventy films beginning with Citizen Kane and on dozens of television shows during a career that spanned more than thirty years, Moorehead is most widely known to modern audiences for her role as the witch Endora in the series Bewitched.\n\nWhile rarely playing leads in films, Moorehead's skill at character development and range earned her one Emmy Award and two Golden Globe awards in addition to four Academy Award and six Emmy Award nominations. Moorehead's transition to television won acclaim for drama and comedy. She could play many different types, but often portrayed haughty, arrogant characters.\n\nDescription above from the Wikipedia article Agnes Moorehead, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        }
    ],
    "roles": [
        {
            "1094844": {
                "74036": "Hamilton",
                "1333845": "Zara",
                "99684": "Pierce",
                "1155659": "Joel",
                "2234620": "Volodrezjkan Soldier",
                "1800933": "Arnott"
            }
        },
        {
            "940551": {
                "466505": "Mack Mallard (voice)",
                "9281": "Pam Mallard (voice)",
                "1736671": "Dax Mallard (voice)",
                "4031156": "Gwen Mallard (voice)",
                "1625558": "Chump (voice)",
                "10556": "Erin (voice)"
            }
        },
        {
            "872585": {
                "2037": "J. Robert Oppenheimer",
                "5081": "Kitty Oppenheimer",
                "1892": "Leslie Groves",
                "3223": "Lewis Strauss",
                "1373737": "Jean Tatlock",
                "2299": "Ernest Lawrence"
            }
        },
        {
            "385687": {
                "12835": "Dominic Toretto",
                "17647": "Letty Ortiz",
                "8169": "Roman Pearce",
                "8171": "Tej Parker",
                "56446": "Jakob Toretto",
                "1251069": "Ramsey"
            }
        },
        {
            "938614": {
                "83854": "Jack Delroy",
                "187400": "June Ross-Mitchell",
                "62486": "Carmichael Haig",
                "230609": "Christou",
                "2554414": "Lilly D'Abo",
                "3964519": "Gus McConnell"
            }
        },
        {
            "346698": {
                "234352": "Barbie",
                "30614": "Ken",
                "59174": "Gloria",
                "1767250": "Sasha",
                "1455336": "Barbie",
                "1240487": "Barbie"
            }
        },
        {
            "298618": {
                "132157": "Barry Allen / The Flash",
                "2542319": "Kara Zor-El / Supergirl",
                "2232": "Bruce Wayne / Batman",
                "335": "General Zod",
                "17402": "Henry Allen",
                "16971": "Nora Allen"
            }
        },
        {
            "577922": {
                "1117313": "The Protagonist",
                "11288": "Neil",
                "1133349": "Kat",
                "11181": "Andrei Sator",
                "78921": "Priya",
                "1227717": "Mahir"
            }
        },
        {
            "760104": {
                "1137824": "Maxine / Pearl",
                "974169": "Lorraine",
                "29221": "Bobby-Lynne",
                "484359": "Jackson",
                "26291": "Wayne",
                "132220": "RJ"
            }
        },
        {
            "609681": {
                "60073": "Carol Danvers / Captain Marvel",
                "970219": "Monica Rambeau",
                "2798462": "Kamala Khan / Ms. Marvel",
                "118034": "Dar-Benn",
                "2231": "Nick Fury",
                "480": "Emperor Dro'ge"
            }
        },
        {
            "348": {
                "4139": "Dallas",
                "10205": "Ripley",
                "5047": "Lambert",
                "5048": "Brett",
                "5049": "Kane",
                "65": "Ash"
            }
        },
        {
            "1015303": {
                "1780952": "Ryan Keaton",
                "2425167": "Chloe Young",
                "2537199": "Kris Russo",
                "1742672": "Matty Davis",
                "3671057": "Kevin",
                "3824147": "Izzy Simpson"
            }
        },
        {
            "787699": {
                "1190668": "Willy Wonka",
                "1939373": "Noodle",
                "298410": "Chief of Police",
                "3291": "Oompa Loompa",
                "19868": "Arthur Slugworth",
                "39187": "Mrs. Scrubbit"
            }
        },
        {
            "62": {
                "245": "Dr. David Bowman",
                "246": "Dr. Frank Poole",
                "247": "Dr. Heywood Floyd",
                "253": "HAL 9000 (voice)",
                "248": "Moonwatcher",
                "249": "Dr. Andrei Smyslov"
            }
        },
        {
            "792307": {
                "54693": "Bella Baxter",
                "103": "Duncan Wedderburn",
                "5293": "Godwin Baxter",
                "1382987": "Max McCandles",
                "984629": "Alfie Blessington",
                "2331794": "Toinette"
            }
        },
        {
            "845783": {
                "2146942": "Iris Lark",
                "225692": "Neil",
                "2364040": "Katie",
                "3064": "Owen Lark",
                "1141591": "Baghead",
                "1561755": "Sarah"
            }
        },
        {
            "526896": {
                "7499": "Dr. Michael Morbius / Morbius",
                "136532": "Milo / Lucien",
                "1371297": "Martine Bancroft",
                "15440": "Dr. Emil Nicholas",
                "90534": "Agent Alberto Rodriguez",
                "8169": "Agent Simon Stroud"
            }
        },
        {
            "49047": {
                "18277": "Dr. Ryan Stone",
                "1461": "Lt. Matt Kowalski",
                "228": "Mission Control (voice)",
                "1223440": "Aningaaq (voice)",
                "58587": "Shariff (voice)",
                "1223442": "Explorer Captain (voice)"
            }
        },
        {
            "111": {
                "1158": "Antonio 'Tony' Montana",
                "1159": "Manolo 'Manny' Ray",
                "1160": "Elvira",
                "1161": "Gina Montana",
                "1162": "Frank Lopez",
                "1163": "Mama Montana"
            }
        },
        {
            "15": {
                "40": "Charles Foster Kane",
                "7664": "Jedediah Leland",
                "11029": "Susan Alexander Kane",
                "14518": "Jim W. Gettys",
                "11028": "Walter Parks Thatcher",
                "11025": "Mary Kane"
            }
        }
    ],
    "directs": [
        {
            "id": 1654626,
            "movie": 1094844
        },
        {
            "id": 1092607,
            "movie": 940551
        },
        {
            "id": 525,
            "movie": 872585
        },
        {
            "id": 18865,
            "movie": 385687
        },
        {
            "id": 1083154,
            "movie": 938614
        },
        {
            "id": 45400,
            "movie": 346698
        },
        {
            "id": 1113116,
            "movie": 298618
        },
        {
            "id": 525,
            "movie": 577922
        },
        {
            "id": 101542,
            "movie": 760104
        },
        {
            "id": 1795072,
            "movie": 609681
        },
        {
            "id": 578,
            "movie": 348
        },
        {
            "id": 1521437,
            "movie": 1015303
        },
        {
            "id": 101666,
            "movie": 787699
        },
        {
            "id": 240,
            "movie": 62
        },
        {
            "id": 122423,
            "movie": 792307
        },
        {
            "id": 2138168,
            "movie": 845783
        },
        {
            "id": 125738,
            "movie": 526896
        },
        {
            "id": 11218,
            "movie": 49047
        },
        {
            "id": 1150,
            "movie": 111
        },
        {
            "id": 40,
            "movie": 15
        }
    ]
}