{
    "movie_details": [
        {
            "movie_id": 603,
            "language": "en",
            "title": "The Matrix",
            "genre": [
                "Action",
                "Science Fiction"
            ],
            "description": "Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth.",
            "poster": "/f89U3ADr1oiB1s9GkdPOEpXUk5H.jpg",
            "director": 9340,
            "release_date": "1999-03-31",
            "vote_average": 8.214
        },
        {
            "movie_id": 475557,
            "language": "en",
            "title": "Joker",
            "genre": [
                "Crime",
                "Thriller",
                "Drama"
            ],
            "description": "During the 1980s, a failed stand-up comedian is driven insane and turns to a life of crime and chaos in Gotham City while becoming an infamous psychopathic crime figure.",
            "poster": "/udDclJoHjfjb8Ekgsd4FDteOkCU.jpg",
            "director": 57130,
            "release_date": "2019-10-01",
            "vote_average": 8.162
        },
        {
            "movie_id": 348,
            "language": "en",
            "title": "Alien",
            "genre": [
                "Horror",
                "Science Fiction"
            ],
            "description": "During its return to the earth, commercial spaceship Nostromo intercepts a distress signal from a distant planet. When a three-member team of the crew discovers a chamber containing thousands of eggs on the planet, a creature inside one of the eggs attacks an explorer. The entire crew is unaware of the impending nightmare set to descend upon them when the alien parasite planted inside its unfortunate host is birthed.",
            "poster": "/vfrQk5IPloGg1v9Rzbh2Eg3VGyM.jpg",
            "director": 578,
            "release_date": "1979-05-25",
            "vote_average": 8.152
        },
        {
            "movie_id": 263115,
            "language": "en",
            "title": "Logan",
            "genre": [
                "Action",
                "Drama",
                "Science Fiction"
            ],
            "description": "In the near future, a weary Logan cares for an ailing Professor X in a hideout on the Mexican border. But Logan's attempts to hide from the world and his legacy are upended when a young mutant arrives, pursued by dark forces.",
            "poster": "/fnbjcRDYn6YviCcePDnGdyAkYsB.jpg",
            "director": 366,
            "release_date": "2017-02-28",
            "vote_average": 7.8
        },
        {
            "movie_id": 299537,
            "language": "en",
            "title": "Captain Marvel",
            "genre": [
                "Action",
                "Adventure",
                "Science Fiction"
            ],
            "description": "The story follows Carol Danvers as she becomes one of the universe’s most powerful heroes when Earth is caught in the middle of a galactic war between two alien races. Set in the 1990s, Captain Marvel is an all-new adventure from a previously unseen period in the history of the Marvel Cinematic Universe.",
            "poster": "/AtsgWhDnHTq68L0lLsUrCnM7TjG.jpg",
            "director": 53068,
            "release_date": "2019-03-06",
            "vote_average": 6.824
        },
        {
            "movie_id": 320288,
            "language": "en",
            "title": "Dark Phoenix",
            "genre": [
                "Science Fiction",
                "Action",
                "Adventure"
            ],
            "description": "The X-Men face their most formidable and powerful foe when one of their own, Jean Grey, starts to spiral out of control. During a rescue mission in outer space, Jean is nearly killed when she's hit by a mysterious cosmic force. Once she returns home, this force not only makes her infinitely more powerful, but far more unstable. The X-Men must now band together to save her soul and battle aliens that want to use Grey's new abilities to rule the galaxy.",
            "poster": "/cCTJPelKGLhALq3r51A9uMonxKj.jpg",
            "director": 11092,
            "release_date": "2019-06-05",
            "vote_average": 5.976
        },
        {
            "movie_id": 62,
            "language": "en",
            "title": "2001: A Space Odyssey",
            "genre": [
                "Science Fiction",
                "Mystery",
                "Adventure"
            ],
            "description": "Humanity finds a mysterious object buried beneath the lunar surface and sets off to find its origins with the help of HAL 9000, the world's most advanced super computer.",
            "poster": "/ve72VxNqjGM69Uky4WTo2bK6rfq.jpg",
            "director": 240,
            "release_date": "1968-04-02",
            "vote_average": 8.1
        },
        {
            "movie_id": 111,
            "language": "en",
            "title": "Scarface",
            "genre": [
                "Action",
                "Crime",
                "Drama"
            ],
            "description": "After getting a green card in exchange for assassinating a Cuban government official, Tony Montana stakes a claim on the drug trade in Miami. Viciously murdering anyone who stands in his way, Tony eventually becomes the biggest drug lord in the state, controlling nearly all the cocaine that comes through Miami. But increased pressure from the police, wars with Colombian drug cartels and his own drug-fueled paranoia serve to fuel the flames of his eventual downfall.",
            "poster": "/iQ5ztdjvteGeboxtmRdXEChJOHh.jpg",
            "director": 1150,
            "release_date": "1983-12-09",
            "vote_average": 8.168
        },
        {
            "movie_id": 284052,
            "language": "en",
            "title": "Doctor Strange",
            "genre": [
                "Action",
                "Adventure",
                "Fantasy"
            ],
            "description": "After his career is destroyed, a brilliant but arrogant surgeon gets a new lease on life when a sorcerer takes him under her wing and trains him to defend the world against evil.",
            "poster": "/7WfK17BXE6szXlm4WOxfswgbdsL.jpg",
            "director": 55499,
            "release_date": "2016-10-25",
            "vote_average": 7.423
        },
        {
            "movie_id": 490132,
            "language": "en",
            "title": "Green Book",
            "genre": [
                "Drama",
                "History"
            ],
            "description": "Tony Lip, a bouncer in 1962, is hired to drive pianist Don Shirley on a tour through the Deep South in the days when African Americans, forced to find alternate accommodations and services due to segregation laws below the Mason-Dixon Line, relied on a guide called The Negro Motorist Green Book.",
            "poster": "/7BsvSuDQuoqhWmU2fL7W2GOcZHU.jpg",
            "director": 7396,
            "release_date": "2018-11-16",
            "vote_average": 8.244
        },
        {
            "movie_id": 141,
            "language": "en",
            "title": "Donnie Darko",
            "genre": [
                "Fantasy",
                "Drama",
                "Mystery"
            ],
            "description": "After narrowly escaping a bizarre accident, a troubled teenager is plagued by visions of a large bunny rabbit that manipulates him to commit a series of crimes.",
            "poster": "/fhQoQfejY1hUcwyuLgpBrYs6uFt.jpg",
            "director": 1577,
            "release_date": "2001-01-19",
            "vote_average": 7.8
        },
        {
            "movie_id": 383498,
            "language": "en",
            "title": "Deadpool 2",
            "genre": [
                "Action",
                "Comedy",
                "Adventure"
            ],
            "description": "Wisecracking mercenary Deadpool battles the evil and powerful Cable and other bad guys to save a boy's life.",
            "poster": "/to0spRl1CMDvyUbOnbb4fTk3VAd.jpg",
            "director": 40684,
            "release_date": "2018-05-10",
            "vote_average": 7.487
        },
        {
            "movie_id": 381288,
            "language": "en",
            "title": "Split",
            "genre": [
                "Horror",
                "Thriller"
            ],
            "description": "Though Kevin has evidenced 23 personalities to his trusted psychiatrist, Dr. Fletcher, there remains one still submerged who is set to materialize and dominate all the others. Compelled to abduct three teenage girls led by the willful, observant Casey, Kevin reaches a war for survival among all of those contained within him — as well as everyone around him — as the walls between his compartments shatter apart.",
            "poster": "/lli31lYTFpvxVBeFHWoe5PMfW5s.jpg",
            "director": 11614,
            "release_date": "2017-01-19",
            "vote_average": 7.343
        },
        {
            "movie_id": 297802,
            "language": "en",
            "title": "Aquaman",
            "genre": [
                "Action",
                "Adventure",
                "Fantasy"
            ],
            "description": "Half-human, half-Atlantean Arthur Curry is taken on the journey of his lifetime to discover if he is worth of being a king.",
            "poster": "/zdw7Wf97vsQ0YnGomxDqfcEdUjX.jpg",
            "director": 2127,
            "release_date": "2018-12-07",
            "vote_average": 6.896
        },
        {
            "movie_id": 424139,
            "language": "en",
            "title": "Halloween",
            "genre": [
                "Horror",
                "Thriller"
            ],
            "description": "Laurie Strode comes to her final confrontation with Michael Myers, the masked figure who has haunted her since she narrowly escaped his killing spree on Halloween night four decades ago.",
            "poster": "/f7JAX5EGk4GgsEnus6OxyzwpFp7.jpg",
            "director": 64141,
            "release_date": "2018-10-18",
            "vote_average": 6.553
        },
        {
            "movie_id": 339846,
            "language": "en",
            "title": "Baywatch",
            "genre": [
                "Comedy",
                "Action",
                "Crime"
            ],
            "description": "Devoted lifeguard Mitch Buchannon butts heads with a brash new recruit. Together, they uncover a local criminal plot that threatens the future of the Bay.",
            "poster": "/6HE4xd8zloDqmjMZuhUCCw2UcY1.jpg",
            "director": 71600,
            "release_date": "2017-05-25",
            "vote_average": 6.091
        },
        {
            "movie_id": 335983,
            "language": "en",
            "title": "Venom",
            "genre": [
                "Science Fiction",
                "Action"
            ],
            "description": "Investigative journalist Eddie Brock attempts a comeback following a scandal, but accidentally becomes the host of Venom, a violent, super powerful alien symbiote. Soon, he must rely on his newfound powers to protect the world from a shadowy organization looking for a symbiote of their own.",
            "poster": "/2uNW4WbgBXL25BAbXGLnLqX71Sw.jpg",
            "director": 91268,
            "release_date": "2018-09-28",
            "vote_average": 6.828
        },
        {
            "movie_id": 439079,
            "language": "en",
            "title": "The Nun",
            "genre": [
                "Horror"
            ],
            "description": "A priest with a haunted past and a novice on the threshold of her final vows are sent by the Vatican to investigate the death of a young nun in Romania and confront a malevolent force in the form of a demonic nun.",
            "poster": "/sFC1ElvoKGdHJIWRpNB3xWJ9lJA.jpg",
            "director": 1401474,
            "release_date": "2018-09-05",
            "vote_average": 5.891
        },
        {
            "movie_id": 807,
            "language": "en",
            "title": "Se7en",
            "genre": [
                "Crime",
                "Mystery",
                "Thriller"
            ],
            "description": "Two homicide detectives are on a desperate hunt for a serial killer whose crimes are based on the \"seven deadly sins\" in this dark and haunting film that takes viewers from the tortured remains of one victim to the next. The seasoned Det. Sommerset researches each sin in an effort to get inside the killer's mind, while his novice partner, Mills, scoffs at his efforts to unravel the case.",
            "poster": "/6yoghtyTpznpBik8EngEmJskVUO.jpg",
            "director": 7467,
            "release_date": "1995-09-22",
            "vote_average": 8.373
        },
        {
            "movie_id": 635,
            "language": "en",
            "title": "Angel Heart",
            "genre": [
                "Horror",
                "Mystery"
            ],
            "description": "Harry Angel, a down-and-out Brooklyn detective, is hired to track down a singer on an odyssey that will take him through the desperate streets of Harlem, the smoke-filled jazz clubs of New Orleans, and the swamps of Louisiana and its seedy underworld of voodoo.",
            "poster": "/h5v3wjJQNB7q2RntEnKDLhKtTFE.jpg",
            "director": 9168,
            "release_date": "1987-03-06",
            "vote_average": 7.128
        }
    ],
    "persons": [
        {
            "id": 9340,
            "name": "Lana Wachowski",
            "image": "/4nE4ttPQBuw1virOz0LYT08c1Vm.jpg",
            "birth_date": "1965-06-21",
            "biography": "Lana Wachowski (born June 21, 1965) is known as one of the Wachowski sisters — a directing, writing and producing duo most famous for creating The Matrix series."
        },
        {
            "id": 6384,
            "name": "Keanu Reeves",
            "image": "/4D0PpNI0kmP58hgrwGC3wCjxhnm.jpg",
            "birth_date": "1964-09-02",
            "biography": "Keanu Charles Reeves is a Canadian actor. Reeves is known for his roles in Bill & Ted's Excellent Adventure, Speed, Point Break, and The Matrix franchise as Neo.\n\nHe has collaborated with major directors such as Stephen Frears (in the 1988 period drama Dangerous Liaisons); Gus Van Sant (in the 1991 independent film My Own Private Idaho); and Bernardo Bertolucci (in the 1993 film Little Buddha). Referring to his 1991 film releases, The New York Times' critic, Janet Maslin, praised Reeves' versatility, saying that he \"displays considerable discipline and range. He moves easily between the buttoned-down demeanor that suits a police procedural story and the loose-jointed manner of his comic roles.\" A repeated theme in roles he has portrayed is that of saving the world, including the characters of Ted Logan, Buddha, Neo, Johnny Mnemonic, John Constantine and Klaatu."
        },
        {
            "id": 2975,
            "name": "Laurence Fishburne",
            "image": "/iwx7h0AfWMm9K4sMmhru3ShSra.jpg",
            "birth_date": "1961-07-30",
            "biography": "Laurence John Fishburne III (born July 30, 1961) is an American actor and producer. He has been critically hailed for his forceful, militant, and authoritative characters in his films. He is known for playing Morpheus in the first three films of The Matrix series (1999–2003), Jason \"Furious\" Styles in the John Singleton drama film Boyz n the Hood (1991), Tyrone \"Mr. Clean\" Miller in Francis Ford Coppola's war film Apocalypse Now (1979), and \"The Bowery King\" in the John Wick film series (2017–present).\n\nFor his portrayal of Ike Turner in What's Love Got to Do With It (1993), Fishburne was nominated for an Academy Award for Best Actor. He won a Tony Award for Best Featured Actor in a Play for his performance in Two Trains Running (1992), and an Emmy Award for Outstanding Guest Actor in a Drama Series for his performance in TriBeCa (1993). Fishburne became the first African American to portray Othello in a motion picture by a major studio when he appeared in Oliver Parker's 1995 film adaptation of the Shakespeare play.\n\nOther film credits of Fishburne include The Color Purple (1985), School Daze (1988), King of New York (1990), Deep Cover (1992), Searching for Bobby Fischer (1993), Event Horizon (1997), Mystic River (2003), Akeelah and the Bee (2006), Contagion (2011), Man of Steel (2013), Batman v Superman: Dawn of Justice (2016), and Ant-Man and the Wasp (2018). On television, he starred as Dr. Raymond Langston on the CBS crime drama CSI: Crime Scene Investigation (2008–2011), as Special Agent Jack Crawford in the NBC thriller series Hannibal (2013–2015), and as Earl \"Pops\" Johnson in the ABC sitcom Black-ish (2014–present)."
        },
        {
            "id": 530,
            "name": "Carrie-Anne Moss",
            "image": "/xD4jTA3KmVp5Rq3aHcymL9DUGjD.jpg",
            "birth_date": "1967-08-21",
            "biography": "Carrie-Anne Moss (born August 21, 1967) is a Canadian actress. After early roles on television, she rose to international prominence for her role of Trinity in The Matrix franchise. She has starred in Memento (2000) for which she won the Independent Spirit Award for Best Supporting Female, Red Planet (2000), Chocolat (2000), Fido (2006), Snow Cake (2006) for which she won the Genie Award for Best Performance by an Actress in a Supporting Role, Disturbia (2007), Unthinkable (2010), Silent Hill: Revelation (2012), and Pompeii (2014). She also portrayed Jeri Hogarth in several television series produced by Marvel Television for Netflix, most notably Jessica Jones (2015–2019)."
        },
        {
            "id": 1331,
            "name": "Hugo Weaving",
            "image": "/t4ScpYIHlXVD41scEyiGdQDYflX.jpg",
            "birth_date": "1960-04-04",
            "biography": "Hugo Wallace Weaving AO (born April 4, 1960) is an English actor. Born in Colonial Nigeria to English parents, he has resided in Australia for the entirety of his career. He is the recipient of six Australian Academy of Cinema and Television Arts Awards (AACTA) and has also been recognised as an Honorary Officer of the Order of Australia.\n\nWeaving landed his first major role as English cricket captain Douglas Jardine on the Australian television series Bodyline (1984). Continuing to act in Australia, he rose to prominence with his appearances in the films Proof (1991) and The Adventures of Priscilla, Queen of the Desert (1994), winning his first AACTA Award for Best Actor in a Leading Role with the former. By the turn of the millennium, Weaving achieved international recognition through appearances in mainstream American productions. His most notable film roles include Agent Smith in the first three The Matrix films (1999–2003), Elrond in The Lord of the Rings (2001–2003) and The Hobbit (2012–2014) trilogies, the title character in V for Vendetta (2005), and Johann Schmidt / Red Skull in the Marvel Cinematic Universe (MCU) film Captain America: The First Avenger (2011).\n\nIn addition to his live action appearances, Weaving has had several voice over roles, including in the films Babe (1995), Happy Feet (2006) and Happy Feet Two (2011), and the Transformers series as Megatron (2007–2011). He also reprised his roles of Agent Smith and Elrond in Matrix and Lord of the Rings video game adaptations.\n\nDescription above is from the Wikipedia article Hugo Weaving, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 9364,
            "name": "Gloria Foster",
            "image": "/AriGXtC9fjBOia9Zr8CZjn4o3rx.jpg",
            "birth_date": "1933-11-15",
            "biography": "Gloria Foster (November 15, 1933 – September 29, 2001) was an American actress, most known for her stage performances both on and off Broadway, including her acclaimed roles in plays In White America and Having Our Say, winning three Obie Awards during her career.\n\nIn films, she was perhaps best known as the Oracle in The Matrix (1999) and The Matrix Reloaded (2003), the latter film being her last. Gloria Foster also played the role of the mother of Yusef Bell in the mini series The Atlanta Child Murders which aired in 1985."
        },
        {
            "id": 532,
            "name": "Joe Pantoliano",
            "image": "/3OHUI3nX4SYGGItDk3xqeIvWtIf.jpg",
            "birth_date": "1951-09-12",
            "biography": "An American film and television actor. He played the character of Ralph Cifaretto on The Sopranos, Bob Keane in La Bamba, Cypher in The Matrix, Teddy in Memento, Francis Fratelli in The Goonies, Guido \"the Killer Pimp\" in Risky Business, and Jennifer Tilly's violent mobster boyfriend, Caesar, in Bound. He also played US Marshall Renfro in both The Fugitive and U.S. Marshals. He is often referred to as \"Joey Pants\", due to the difficulty some have pronouncing his Italian surname.\n\n​From Wikipedia, the free encyclopedia"
        },
        {
            "id": 57130,
            "name": "Todd Phillips",
            "image": "/A6FPht87DiqXzp456WjakLi2AtP.jpg",
            "birth_date": "1970-12-20",
            "biography": "American screenwriter and film director Todd Phillips made his first while a junior at NYU and it went on to become one of the biggest grossing student films at the time, even getting a limited theatrical release.; the feature-length documentary “Hated: GG Allin and the Murder Junkies” He is best known for directing the comedy films Road Trip, Old School, The Hangover, and Due Date.\n\nPhillips directed and produced the highest grossing R-Rated Comedy of all time “The Hangover” (2009), Its worldwide gross currently stands at $480 million dollars. The film won the Golden Globe for Best Picture as well as Best Comedy at the 2009 Broadcast Film Critics’ Awards. "
        },
        {
            "id": 73421,
            "name": "Joaquin Phoenix",
            "image": "/ls72wfQl8AhRVFeBnotmnAdy3JR.jpg",
            "birth_date": "1974-10-28",
            "biography": "Joaquin Rafael Phoenix (born October 28, 1974) is an American actor, producer, and animal rights activist. Known for playing dark and unconventional characters in independent film, he is the recipient of various accolades, including an Academy Award, a British Academy Film Award, a Grammy Award, and two Golden Globe Awards. In 2020, he was ranked 12th on the list of the 25 Greatest Actors of the 21st Century by The New York Times.\n\nBorn in Puerto Rico and raised in Los Angeles and Florida, Phoenix began his career by appearing in television series in the early 1980s with his brother River. His first major film roles were in SpaceCamp (1986) and Parenthood (1989). During this period, he was credited as Leaf Phoenix, a name he gave himself. He took back his birth first name in the early 1990s and received critical acclaim for his supporting roles in the comedy-drama film To Die For (1995) and the period film Quills (2000). Phoenix received further critical acclaim and first Academy Award and Golden Globe Award nominations for Best Actor in a Supporting Role for his portrayal of the evil emperor Commodus in the historical drama film Gladiator (2000). He had success with the horror films Signs (2002) and The Village (2004), the historical drama Hotel Rwanda (2004) and won a Grammy, a Golden Globe and a nomination for the Academy Award for Best Actor for his portrayal of musician Johnny Cash in the biopic Walk the Line (2005). He continued to receive acclaim in two features with his frequent director James Gray; the action thriller We Own the Night (2007) and the romantic drama Two Lovers (2008), before taking a break from acting.\n\nIn the 2010s, Phoenix returned to acting to critical acclaim. He starred in the psychological drama The Master (2012), winning the Volpi Cup for Best Actor and earning his third Academy Award nomination. He received Golden Globe nominations for his roles in the romantic drama Her (2013) and the crime satire Inherent Vice (2014) and won the Cannes Film Festival Award for Best Actor for his performance in the psychological thriller You Were Never Really Here (2017). Phoenix achieved international stardom and won an Academy Award, a British Academy Film Award, a Screen Actors Guild Award and a second Golden Globe Award for his portrayal of the title character in Joker (2019).\n\nPhoenix is an animal rights activist. He has been vegan since the age of three and regularly supports charitable causes and has produced several documentaries on global meat consumption and its impact on the environment. He is in a relationship with actress Rooney Mara, with whom he has a son."
        },
        {
            "id": 380,
            "name": "Robert De Niro",
            "image": "/cT8htcckIuyI1Lqwt1CvD02ynTh.jpg",
            "birth_date": "1943-08-17",
            "biography": "Robert Anthony De Niro (born August 17, 1943) is an American actor. Known for his collaborations with Martin Scorsese, he is considered to be one of the best actors of his generation. De Niro is the recipient of various accolades, including two Academy Awards, a Golden Globe Award, the Cecil B. DeMille Award, and a Screen Actors Guild Life Achievement Award. In 2009, De Niro received the Kennedy Center Honor, and earned a Presidential Medal of Freedom from U.S. President Barack Obama in 2016.\n\nDe Niro studied acting at HB Studio, Stella Adler Conservatory, and Lee Strasberg's Actors Studio. His first collaboration with Scorsese was with the 1973 film Mean Streets. De Niro earned two Academy Awards, one for Best Supporting Actor for his role as Vito Corleone in Francis Ford Coppola's The Godfather Part II (1974) and the other for Best Actor portraying Jake LaMotta in Scorsese's drama Raging Bull (1980). His other Oscar-nominated roles were for Taxi Driver (1976), The Deer Hunter (1978), Awakenings (1990), Cape Fear (1991), and Silver Linings Playbook (2012).\n\nOther notable roles include in 1900 (1976), The King of Comedy (1982), Once Upon a Time in America (1984), Brazil (1985), The Mission (1986), Goodfellas (1990), This Boy's Life (1993), Mary Shelley’s Frankenstein (1994), Heat (1995), Casino (1995), Jackie Brown (1997), The Good Shepherd (2006), Joker (2019), and The Irishman (2019). He made his directorial film debut with A Bronx Tale (1993). His comedic roles include Midnight Run (1988), Wag the Dog (1997), Analyze This (1999), the Meet the Parents films (2000-2010), and The Intern (2015).\n\nAlso known for his television roles, De Niro portrayed Bernie Madoff in the HBO film The Wizard of Lies (2017), earning a Primetime Emmy Award for Outstanding Lead Actor in a Limited Series or Movie nomination. He received further Emmy Award nominations for producing the Netflix limited series When They See Us (2019), and for portraying Robert Mueller on Saturday Night Live.[1]\n\nDe Niro and producer Jane Rosenthal founded the film and television production company TriBeCa Productions in 1989, which has produced several films alongside his own. Also with Rosenthal, he founded the Tribeca Film Festival in 2002. Six of De Niro's films have been inducted into the United States National Film Registry by the Library of Congress as \"culturally, historically, or aesthetically significant\"."
        },
        {
            "id": 1545693,
            "name": "Zazie Beetz",
            "image": "/sgxzT54GnvgeMnOZgpQQx9csAdd.jpg",
            "birth_date": "1991-06-01",
            "biography": "Zazie Olivia Beetz (born June 1, 1991) is a German-American actress. She stars in the FX comedy-drama series Atlanta (2016–2022), for which she received a nomination for the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series. She also appeared in the Netflix anthology series Easy (2016–19) and voices Amber Bennett in Amazon's animated superhero action series Invincible.\n\nIn film, Beetz has appeared in the disaster film Geostorm (2017) and has played the Marvel Comics character Domino in the superhero film Deadpool 2 (2018) and Arthur Fleck/Joker's neighbor Sophie in the psychological thriller Joker (2019)."
        },
        {
            "id": 4432,
            "name": "Frances Conroy",
            "image": "/aJRQAkO24L6bH8qkkE5Iv1nA3gf.jpg",
            "birth_date": "1953-03-15",
            "biography": "Frances Conroy (born March 15, 1953) is an American actress. She is most widely known for playing the matriarch Ruth O'Connor Fisher Sibley on the HBO funeral drama series Six Feet Under, which earned her a Golden Globe in 2004."
        },
        {
            "id": 16841,
            "name": "Brett Cullen",
            "image": "/4P6TsRcnr9MRbXlCdHitulGM5LT.jpg",
            "birth_date": "1956-08-26",
            "biography": "Peter Brett Cullen (born August 26, 1956) is an American actor who has appeared in numerous motion pictures and television programs. Early in 2007, he was cast as the role of an estranged father to one of the American football players, Tim Riggins (played by actor Taylor Kitsch), in the NBC drama series Friday Night Lights.\n\nCullen was born in Houston, Texas, the son of Lucien Hugh Cullen, an oil industry executive, and Catherine Cullen. He graduated from Madison High School in Houston in 1974. Cullen graduated from the University of Houston, giving great credit to his highly acclaimed acting mentor and University of Houston professor, Cecil Pickett, who also mentored such Houston born actors as Dennis Quaid, Randy Quaid, & Brent Spiner among others. Cullen and Dennis Quaid's close friendship to this day dates back to the 1970s and it is Cullen who introduced Dennis Quaid to his current wife, Kimberly Buffington at a dinner in Austin, Texas.\n\nCullen played Dan Fixx in the 1980s CBS drama Falcon Crest for two seasons (1986–1988) and Marshal Sam Cain in the ABC western series The Young Riders for one season (1989–1990). In 1980, he appeared as the second Gideon Chisholm in the last nine episodes of the CBS western miniseries The Chisholms. In the four earlier episodes, the Gideon Chisholm role was played by Brian Kerwin. Cullen was the lead actor as Ned Logan in the short-lived Legacy, which lasted for just one season (1998–1999). On the series The West Wing Cullen played Ray Sullivan, a fictional governor of West Virginia and the Republican nominee for Vice President.\n\nHis guest appearances on TV include: The Incredible Hulk, Tales from the Crypt, MAS*H, V, Matlock, Star Trek: Deep Space Nine, Ally McBeal, Walker, Texas Ranger, Once and Again, Without a Trace, Cold Case, The Mountain, Monk, CSI: Miami, NCIS, Desperate Housewives, Pepper Dennis, Lost, Ghost Whisperer, Private Practice, Ugly Betty, and Friday Night Lights. In 2009, he had a recurring role in the ABC Family television series Make It or Break It.\n\nHe has played two real-life astronauts, Jack Lousma in Apollo 13 (Brett is the CapCom at the time of the explosion; at that shift Lousma was the CapCom in real life) and David Scott in the HBO mini-series From the Earth to the Moon.\n\nHis most recent appearance was in the role of Barton Blaze in the movie Ghost Rider. Other movie credits include Wyatt Earp (with Kevin Costner), Gambler V: Playing for Keeps (with Kenny Rogers and Bruce Boxleitner), Something to Talk About (with Julia Roberts and Dennis Quaid), The Replacements (with Gene Hackman), On Golden Pond (with Julie Andrews and Christopher Plummer), Nancy Drew, and Gridiron Gang. He also played Bob Cleary in the 1983 mini-series The Thorn Birds.\n\nCullen was recently cast in the up-coming femme comedy Monte Carlo alongside Selena Gomez, Andie MacDowell and Leighton Meester and is playing the role of Tom Eckert in the upcoming war film Red Dawn.\n\nOn February 8, 2011, Brett was named the official spokesman for Houston Works which helps Houston residents with job training and placement, scholarships, consulting, technical initiatives focusing on science, technology, engineering and mathematics and summer job programs along with Youth Summits.\n\n​From Wikipedia, the free encyclopedia"
        },
        {
            "id": 74242,
            "name": "Shea Whigham",
            "image": "/d3caK3l4UfbnzOxv95wLoFLZzMO.jpg",
            "birth_date": "1969-01-05",
            "biography": "Franklin Shea Whigham Jr. (born January 5, 1969) is an American actor. He portrayed Elias \"Eli\" Thompson in the HBO drama series Boardwalk Empire, and had notable supporting roles in films Kong: Skull Island, Death Note, Take Shelter, and the first season of True Detective, the third season of Fargo, and Joker. He appeared as Agent Michael Stasiak in Fast & Furious and Fast & Furious 6.  In 2020 he was cast as Pete Strickland on HBO's reimagining of Perry Mason, a role for which he received attention for his moustache."
        },
        {
            "id": 578,
            "name": "Ridley Scott",
            "image": "/zABJmN9opmqD4orWl3KSdCaSo7Q.jpg",
            "birth_date": "1937-11-30",
            "biography": "Sir Ridley Scott (born November 30, 1937) is an English filmmaker. He was raised in an Army family, meaning that for most of his early life, his father — an officer in the Royal Engineers — was absent. Ridley's older brother, Frank, joined the Merchant Navy when he was still young and the pair had little contact. During this time the family moved around, living in (among other areas) Cumbria, Wales and Germany. He has a younger brother, Tony, also a film director. After the Second World War, the Scott family moved back to their native north-east England, eventually settling in Teesside (whose industrial landscape would later inspire similar scenes in Blade Runner). He enjoyed watching films, and his favourites include Lawrence of Arabia, Citizen Kane and Seven Samurai. Scott studied in Teesside from 1954 to 1958, at Grangefield Grammar School and later in West Hartlepool College of Art, graduating with a Diploma in Design. He progressed to an M.A. in graphic design at the Royal College of Art from 1960 to 1962.\n\nAt the RCA he contributed to the college magazine, ARK and helped to establish its film department. For his final show, he made a black and white short film, Boy and Bicycle, starring his younger brother, Tony Scott, and his father. The film's main visual elements would become features of Scott's later work; it was issued on the 'Extras' section of The Duellists DVD. After graduation in 1963, he secured a job as a trainee set designer with the BBC, leading to work on the popular television police series Z-Cars and the science fiction series Out of the Unknown. Scott was an admirer of Stanley Kubrick early in his development as a director. For his entry to the BBC traineeship, Scott remade Paths of Glory as a short film.\n\nHe was assigned to design the second Doctor Who serial, The Daleks, which would have entailed realising the famous alien creatures. However, shortly before Scott was due to start work, a schedule conflict meant that he was replaced on the serial by Raymond Cusick.\n\nAt the BBC, Scott was placed into a director training programme and, before he left the corporation, had directed episodes of Z-Cars, its spin-off, Softly, Softly, and adventure series Adam Adamant Lives!\n\nIn 1968, Ridley and Tony Scott founded Ridley Scott Associates (RSA), a film and commercial production company.Five members of the Scott family are directors, all working for RSA. Brother Tony has been a successful film director for more than two decades; sons, Jake and Luke are both acclaimed commercials directors as is his daughter, Jordan Scott. Jake and Jordan both work from Los Angeles and Luke is based in London.\n\nIn 1995, Shepperton Studios was purchased by a consortium headed by Ridley and Tony Scott, which extensively renovated the studios while also expanding and improving its grounds.  "
        },
        {
            "id": 4139,
            "name": "Tom Skerritt",
            "image": "/8iTZjd5W1EFKg3NRNsKht0akdGB.jpg",
            "birth_date": "1933-08-25",
            "biography": "Thomas Roy Skerritt (born August 25, 1933) is an American actor who has appeared in more than forty films and more than two hundred television episodes since 1962. He is known for his film roles in M*A*S*H, Alien, The Dead Zone, Top Gun, A River Runs Through It, Up in Smoke, and the television series Picket Fences. Skerritt has earned several nominations and awards, including a Primetime Emmy Award for Outstanding Lead Actor in a Drama Series in 1993 for Picket Fences.  Description above from the Wikipedia article Tom Skerritt, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 10205,
            "name": "Sigourney Weaver",
            "image": "/wTSnfktNBLd6kwQxgvkqYw6vEon.jpg",
            "birth_date": "1949-10-08",
            "biography": "Susan Alexandra \"Sigourney\" Weaver (born October 8, 1949) is an American actress. Weaver is considered to be a pioneer of action heroines in science fiction films. She is known for her role as Ellen Ripley in the Alien franchise, which earned her an Academy Award nomination in 1986 and is often regarded as one of the most significant female protagonists in cinema history.\n\nA seven-time Golden Globe Award nominee, Weaver won both Best Actress in Drama and Best Supporting Actress in 1988 for her work in the films Gorillas in the Mist and Working Girl, becoming the first person to win two acting Golden Globes in the same year. She also received Academy Award nominations for both films. For her role in the film The Ice Storm (1997), she won the BAFTA Award for Best Actress ina Supporting Role. She also received a Tony Award nomination for her work in the 1984 Broadway play Hurlyburly.\n\nWeaver's other film roles include Ghostbusters (1984), Ghostbusters II (1989), Dave (1993), Galaxy Quest (1999), Holes (2003), WALL-E (2008), Avatar (2009), Prayers for Bobby (2009), Paul (2011), The Cabin in the Woods (2012), and A Monster Calls (2016); and the television miniseries Political Animals (2012) and The Defenders (2017).\n\nDescription above from the Wikipedia article Sigourney Weaver, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 5047,
            "name": "Veronica Cartwright",
            "image": "/4qudrTfSzPOWoZMA3IfkjrNoI6c.jpg",
            "birth_date": "1949-04-20",
            "biography": "Veronica Cartwright (born April 20, 1949) is a British-born American actress. She is known for appearing in science fiction and horror films, and has earned numerous accolades, including three Primetime Emmy Award nominations. Her younger sister is actress Angela Cartwright.\n\nAs a child actress, Cartwright appeared in supporting roles in The Children's Hour and The Birds, the latter of which was her first commercial success. She made her transition into mainstream, mature roles with 1978's Invasion of the Body Snatchers. The following year, she played Lambert in the science-fiction horror film Alien, which earned her recognition and a Saturn Award for Best Supporting Actress. She additionally appeared in the films The Right Stuff and The Witches of Eastwick which earned her praise, and in the 1990s, received three nominations for the Primetime Emmy Award for Outstanding Guest Actress in a Drama Series, one of which was for her role on ER and two of which were for her role in The X-Files.\n\nFrom Wikipedia, the free encyclopedia"
        },
        {
            "id": 5048,
            "name": "Harry Dean Stanton",
            "image": "/197UiLVdxPOv8196sqmUpJzOQB5.jpg",
            "birth_date": "1926-07-14",
            "biography": "Harry Dean Stanton (July 14, 1926 – September 15, 2017) was an American actor. In a career that spanned more than six decades, Stanton played supporting roles in films including Cool Hand Luke (1967), Kelly's Heroes (1970), Dillinger (1973), The Godfather Part II (1974), Alien (1979), Escape from New York (1981), Christine (1983), Repo Man (1984), One Magic Christmas (1985), Pretty in Pink (1986), The Last Temptation of Christ (1988), Wild at Heart (1990), The Straight Story (1999), The Green Mile (1999), The Man Who Cried (2000), Alpha Dog (2006), and Inland Empire (2006). He had rare lead roles in Paris, Texas (1984) and in Lucky (2017).\n\nDescription above from the Wikipedia article Harry Dean Stanton, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 5049,
            "name": "John Hurt",
            "image": "/kFNlnnjCm7MsRNJ5yzZEH2YJIPC.jpg",
            "birth_date": "1940-01-22",
            "biography": "Sir John Vincent Hurt (January 22, 1940 – January 25, 2017) was an English actor whose career spanned over five decades. He came to prominence for his role as Richard Rich in the film A Man for All Seasons (1966) and gained BAFTA Award nominations for his portrayals of Timothy Evans in 10 Rillington Place (1971) and Quentin Crisp in television film The Naked Civil Servant (1975) – winning his first BAFTA for the latter. He played Caligula in the BBC TV series I, Claudius (1976). Hurt's performance in the prison drama Midnight Express (1978) brought him international renown and earned Golden Globe and BAFTA Awards, along with an Academy Award nomination. His BAFTA-nominated portrayal of astronaut Kane, in the science-fiction horror film Alien (1979), notably included a scene where an alien creature burst out of his chest, named by several publications as one of the most memorable moments in cinema history.\n\nHurt earned his third competitive BAFTA, along with his second Oscar and Golden Globe nominations, as Joseph Merrick in David Lynch's biopic The Elephant Man (1980). Other significant roles during the 1980s included Bob Champion in biopic Champions (1984), Mr. Braddock in the Stephen Frears drama The Hit (1984), Winston Smith in Nineteen Eighty-Four (1984) and Stephen Ward in the drama depicting the Profumo affair, Scandal (1989). Hurt was again BAFTA-nominated for his work in Irish drama The Field (1990) and played the primary villain, James Graham, in the epic adventure Rob Roy (1995). His later films include the Harry Potter film series (2001–11), the Hellboy films (2004 and 2008), supernatural thriller The Skeleton Key (2005), western The Proposition (2005), political thriller V for Vendetta (2005), action adventure Indiana Jones and the Kingdom of the Crystal Skull (2008), sci-fi action Outlander (2008) and the Cold War espionage film Tinker Tailor Soldier Spy (2011). Hurt reprised his role as Quentin Crisp in An Englishman in New York (2009), which brought his seventh BAFTA nomination. He portrayed the War Doctor in the BBC TV series Doctor Who's 50th anniversary special, \"The Day of the Doctor\", in 2013.\n\nHurt was regarded as one of Britain's finest actors; director David Lynch described him as \"simply the greatest actor in the world\". He possessed what was described as the \"most distinctive voice in Britain\", likened by The Observer to \"nicotine sieved through dirty, moonlit gravel\". His voice acting career encompassed films such as Watership Down (1978), The Lord of the Rings (1978), The Plague Dogs (1982), The Black Cauldron (1985), Dogville (2003) and Planet Dinosaur (2011) as well as BBC TV series Merlin (2008–2012). In 2012, he was honoured with the Lifetime Achievement BAFTA Award, in recognition of his \"outstanding contribution to cinema\". He was knighted in 2015 for his services to drama."
        },
        {
            "id": 65,
            "name": "Ian Holm",
            "image": "/tz81JSiPdcLM7b624W1BcYdxd4D.jpg",
            "birth_date": "1931-09-12",
            "biography": "Sir Ian Holm Cuthbert CBE (12 September 1931 – 19 June 2020) was an English actor. After beginning his career on the British stage as a leading member of the Royal Shakespeare Company, he became a successful and prolific performer on television and in films. He received numerous accolades including two BAFTA Awards and a Tony Award, along with nominations for an Academy Award and two Emmy Awards. He was made a Commander of the Order of the British Empire (CBE) in 1989 by Queen Elizabeth II.\n\nHolm won the 1967 Tony Award for Best Featured Actor for his performance as Lenny in the Harold Pinter play The Homecoming. He won the Laurence Olivier Award for Best Actor for his performance in the title role in the 1998 West End production of King Lear. For his television roles he received two Primetime Emmy Award nominations for King Lear (1998), and the HBO film The Last of the Blonde Bombshells (2003).\n\nHe gained acclaim for his role in The Bofors Gun (1968) winning the BAFTA Award for Best Actor in a Supporting Role. He was nominated for an Academy Award for Best Supporting Actor and a BAFTA Award win for his role as athletics trainer Sam Mussabini in Chariots of Fire (1981). Other notable films he appeared in include Alien (1979), Brazil (1985), Henry V (1989), The Madness of King George (1994), The Fifth Element (1997), The Sweet Hereafter (1997), and The Aviator (2004). He gained wider appreciation for his role as the elderly Bilbo Baggins in Peter Jackson's The Lord of the Rings and The Hobbit trilogies. He also voiced Chef Skinner in the Pixar animated film Ratatouille (2007).\n\nDescription above from the Wikipedia article Ian Holm, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 366,
            "name": "James Mangold",
            "image": "/pk0GDjn99crNwR4qgCCEokDYd71.jpg",
            "birth_date": "1963-12-16",
            "biography": "James Allen Mangold (born December 16, 1963) is an American film director, producer and screenwriter. Noted for his versatility in tackling a range of genres, Mangold made his debut as a film director with Heavy (1995), and is best known for the films Cop Land (1997), Girl, Interrupted (1999), Identity (2003), Walk the Line (2005), 3:10 to Yuma (2007), and two films in the X-Men franchise with The Wolverine (2013) and Logan (2017), the latter of which earned him a nomination for the Academy Award for Best Adapted Screenplay. He then directed the sports drama film Ford v Ferrari (2019), which earned him a nomination for the Academy Award for Best Picture, and directed and co-wrote Indiana Jones and the Dial of Destiny (2023), the fifth and final installment in the Indiana Jones series."
        },
        {
            "id": 6968,
            "name": "Hugh Jackman",
            "image": "/4Xujtewxqt6aU0Y81tsS9gkjizk.jpg",
            "birth_date": "1968-10-12",
            "biography": "Hugh Michael Jackman (born 12 October 1968) is an Australian actor. Beginning in theatre and television, he landed his breakthrough role as Wolverine / Logan in the X-Men film series (2000–2017), a tenure that earned him the Guinness World Record for \"longest career as a live-action Marvel superhero\". Jackman has received a Grammy Award, a Primetime Emmy Award, and two Tony Awards. During his career, Jackman has headlined films in various genres, including the romantic comedy Kate & Leopold (2001), the action-horror Van Helsing (2004), the drama The Prestige (2006), the period romance Australia (2008), the epic musical Les Misérables (2012), the thriller Prisoners (2013), the musical The Greatest Showman (2017), the political drama The Front Runner (2018), and the crime thriller Bad Education (2019). For his role as Jean Valjean in Les Misérables, Jackman was nominated for the Academy Award for Best Actor and won the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy, and for The Greatest Showman, he received a Grammy Award for Best Soundtrack Album. He also provided voice roles in the animated films Flushed Away (2006), Rise of the Guardians (2012), and Missing Link (2019). Jackman is also known for his early theatre roles in Oklahoma! in 1998 and Carousel in 2002. On Broadway, Jackman won the 2004 Tony Award for Best Actor in a Musical for his role in The Boy from Oz. In 2021 he returned to the theatre as Harold Hill in the Broadway revival of The Music Man. A four-time host of the Tony Awards, he won an Emmy Award for hosting the 2005 ceremony. He also hosted the 81st Academy Awards in 2009. Jackman was appointed a Companion of the Order of Australia in the 2019 Queen's Birthday Honours for services to performing arts and to the global community."
        },
        {
            "id": 1464650,
            "name": "Dafne Keen",
            "image": "/vohccdHmJHNZX9UIcRlmZ4Qwkj.jpg",
            "birth_date": "2005-01-04",
            "biography": "Dafne María Keen Fernández (born 4 January 2005) is a British-Spanish actress. She made her debut starring as Ana \"Ani\" Cruz Oliver on the television series The Refugees from 2014 to 2015, before her breakthrough starring as Laura in the 2017 superhero film Logan, in which she received widespread critical acclaim for her acting. She received several awards, including an Empire Award for Best Newcomer, and nominations for a Critics' Choice Award and a Saturn Award. In 2019, she began starring as Lyra Belacqua in the television series His Dark Materials, for which she was nominated for a BAFTA Cymru."
        },
        {
            "id": 2387,
            "name": "Patrick Stewart",
            "image": "/3yExCGqCMfSOVVHdEYTJhXaTtFZ.jpg",
            "birth_date": "1940-07-13",
            "biography": "An English film, television and stage actor. He has had a distinguished career in theatre and television for around half a century. He is most widely known for his television and film roles, as Captain Jean-Luc Picard in Star Trek: The Next Generation and as Professor Charles Xavier in the X-Men films. Stewart was born in Mirfield near Dewsbury in the West Riding of Yorkshire, England, the son of Gladys, a weaver and textile worker, and Alfred Stewart, a Regimental Sergeant Major in the British Army who served with the King's Own Yorkshire Light Infantry and previously worked as a general labourer and as a postman. Stewart and his first wife, Sheila Falconer, have two children: Daniel Freedom and Sophie Alexandra. Stewart and Falconer divorced in 1990. In 1997, he became engaged to Wendy Neuss, one of the producers of Star Trek: The Next Generation, and they married on 25 August 2000, divorcing three years later. Four months prior to his divorce from Neuss, Stewart played opposite actress Lisa Dillon in a production of The Master Builder. The two dated for four years, but are no longer together. He is now seeing Sunny Ozell; at 31, she is younger than his daughter. \"I just don't meet women of my age,\" he explains. Stewart has been a prolific actor in performances by the Royal Shakespeare Company, appearing in over 60 productions."
        },
        {
            "id": 65421,
            "name": "Elizabeth Rodriguez",
            "image": "/oHmuDi1zl92wiups2IPfMeBp3a2.jpg",
            "birth_date": "1980-12-27",
            "biography": "Elizabeth Rodriguez is an American actress, best known for her role as Aleida Diaz in the Netflix comedy-drama series Orange Is the New Black.\n\nAfter graduation from Lehman College, Rodriguez studied for two years under acclaimed acting teacher Maggie Flanigan at William Esper Studios in NYC. While still at the studio, she began working professionally with appearances in feature films including Fresh, Dead Presidents, and I Think I Do, as well as in TV shows such as Law & Order, and recurring roles on both OZ and New York Undercover.\n\nRodriguez has since appeared in numerous shows, including a recurring role as Aleida Diaz on the Netflix Original series Orange Is The New Black. Other TV credits include roles as series regulars on both NBC's Prime Suspect, opposite Maria Bello, and ABC's All My Children, in addition to recurring roles on The Shield and ER. Other credits include Six Feet Under, FlashForward, Cold Case, Just Shoot Me, NYPD Blue and Law & Order: SVU.\n\nHer made-for-TV movies include Inflammable and The Eddie Matos Story, written by Oscar nominated writer Jose Rivera. Some of her feature films include Return to Paradise, Four Lane Highway, Acts of Worship, Blow, All Things Fall Apart, Pound Of Flesh, Tonight at Noon, A Line in the Sand, Jack Goes Boating directed by Philip Seymour Hoffman, and Michael Mann's Miami Vice, opposite Colin Farrell and Jamie Foxx, Tio Papi, Glass Chin, and Animal Rescue with Tom Hardy and James Gandolfini.\n\nIn addition to her work on screen, Rodriguez remains extremely active in the theater. She has starred in Beauty of the Father (Manhattan Theatre Club), The Last Days of Judas Iscariot (NY's Public Theater), Roger and Vanessa (Actors' Gang), Den of Thieves (Black Dahlia), Robbers (American Place Theater), A View From 151st Street (NY's Public Theater) and Unconditional (NY's Public Theater). Rodriguez is a longtime member of NY's acclaimed Labyrinth Theater Company."
        },
        {
            "id": 467645,
            "name": "Boyd Holbrook",
            "image": "/fQkDOLXx15ekg9LP5Qhlikqq0wp.jpg",
            "birth_date": "1981-09-01",
            "biography": "Robert Boyd Holbrook (born September 1, 1981) is an American actor. He has starred in the Netflix series Narcos (2015–2016) as DEA agent Steve Murphy and The Sandman (2022–) as the Corinthian, as well as in the History miniseries Hatfields & McCoys as \"Cap\" Hatfield. He starred as Billy in The Skeleton Twins (2014), Peter Kristo in A Walk Among the Tombstones (2014), Donald Pierce in Logan (2017), Quinn McKenna in The Predator (2018), Thomas Lockhart in In the Shadow of the Moon (2019), Ty Shaw in Vengeance (2022), and Klaber in the adventure film Indiana Jones and the Dial of Destiny (2023)."
        },
        {
            "id": 39189,
            "name": "Stephen Merchant",
            "image": "/6WM2rK6390Nwk398syJbGcPvRct.jpg",
            "birth_date": "1974-11-24",
            "biography": "Stephen Merchant is a British writer, director, radio presenter, stand-up comedian, and actor, best known for his work on The Office, Extras, and The Ricky Gervais Show."
        },
        {
            "id": 53068,
            "name": "Ryan Fleck",
            "image": "/28EMTivPGStNxDivgUP8PSpOrof.jpg",
            "birth_date": "1976-09-20",
            "biography": "Ryan K. Fleck (born September 20, 1976) is an American film director, cinematographer, editor, and screenwriter best known for directing and writing the 2006 film Half Nelson and the 2008 film Sugar. He is known for his collaborations with fellow filmmaker Anna Boden.\n\nDescription above from the Wikipedia article Ryan Fleck, licensed under CC-BY-SA, full list of contributors on Wikipedia.​"
        },
        {
            "id": 60073,
            "name": "Brie Larson",
            "image": "/nOoqQouupZaaa959wLZR01n2xmW.jpg",
            "birth_date": "1989-10-01",
            "biography": "Brie Larson (born Brianne Sidonie Desaulniers; October 1, 1989), is an American actress and filmmaker. She's best known for her role as Carol Danvers / Captain Marvel in Captain Marvel (2019) and reprise her role in other MCU films and series. She's also known for her roles as Elizabeth Zott in the miniseries Lessons in Chemistry (which she also executive produced), Tess in Fast X, Eva Ansley in Just Mercy, Jeannette Walls in The Glass Castle, Mason Weaver in Kong: Skull Island, Joy \"Ma\" Newsome in Room, Kim Townsend in Trainwreck, Amy Phillips in The Gambler, Monica Martello in Don Jon, Cassidy Roy in The Spectacular Now, Molly Tracey in 21 Jump Street, Helen in Rampart, Envy Adams in Scott Pilgrim vs. the World, Kate Gregson on Showtime's United States of Tara, Beatrice \"The Bear\" Leep in Hoot, and Emily Stewart on WB's sitcom Raising Dad.\n\nShe appeared as a regular in the 2001 sitcom Raising Dad and briefly dabbled with a music career, releasing the album Finally Out of P.E. in 2005. She played supporting roles in the comedy films 13 Going on 30 (2004), Hoot (2006), Scott Pilgrim vs. the World (2010), and 21 Jump Street (2012), and appeared as a sardonic teenager in the television series United States of Tara (2009–2011).\n\nHer breakthrough came with a leading role in the acclaimed independent drama Short Term 12 (2013), and she continued to take on supporting parts in the romance The Spectacular Now (2013) and the comedy Trainwreck (2015). For playing a kidnapping victim in the drama Room (2015), she won the Academy Award for Best Actress.\n\nThe 2017 adventure film Kong: Skull Island marked her first big-budget release, followed by Free Fire, The Glass Castle, Unicorn Store, and Basmati Blues, the same year. She then starred as Carol Danvers / Captain Marvel in the 2019 Marvel Cinematic Universe superhero film Captain Marvel. She reprised her role in other MCU films including Avengers: Endgame, Shang-Chi and the Legend of the Ten Rings, Avengers: Quantum Encounter, and The Marvels, as well as in the series Ms. Marvel. She then starred in and executive produced the comedy-drama Apple TV+ miniseries Lessons in Chemistry (2023). She also starred in Fast X (2023).\n\nShe has co-written and co-directed two short films, and made her feature film directorial debut with the independent comedy-drama Unicorn Store (2017). For producing the virtual reality series The Messy Truth VR Experience (2020), she won a Primetime Emmy Award."
        },
        {
            "id": 2231,
            "name": "Samuel L. Jackson",
            "image": "/nCJJ3NVksYNxIzEHcyC1XziwPVj.jpg",
            "birth_date": "1948-12-21",
            "biography": "Samuel Leroy Jackson (born December 21, 1948) is an American actor and producer. One of the most widely recognized actors of his generation, the films in which he has appeared have collectively grossed over $27 billion worldwide, making him the second highest-grossing actor of all time. The Academy of Motion Picture Arts and Sciences gave him an Academy Honorary Award in 2022 as \"A cultural icon whose dynamic work has resonated across genres and generations and audiences worldwide\".\n\nJackson started his career on stage making his professional theatre debut in Mother Courage and her Children in 1980 at The Public Theatre. From 1981 to 1983 he originated the role of Private Louis Henderson in A Soldier's Play Off-Broadway. He also originated the role of Boy Willie in August Wilson's The Piano Lesson in 1987 at the Yale Repertory Theatre. He returned to the play in the 2022 Broadway revival playing Doaker Charles. Jackson early film roles include Coming to America (1988), Goodfellas (1990), Patriot Games (1992), Juice (1992), True Romance (1993), and Jurassic Park (1993), Menace II Society (1993), and Fresh (1994). His collaborations with Spike Lee led to greater prominence with films such as School Daze (1988), Do the Right Thing (1989), Mo' Better Blues (1990), Jungle Fever (1991), Oldboy (2013), and Chi-Raq (2015).\n\nJackson's breakout role was in Quentin Tarantino's Pulp Fiction (1994) which earned him a BAFTA Award win and a nomination for the Academy Award for Best Supporting Actor. He further collaborated with Tarantino, acting in Jackie Brown (1997), Django Unchained (2012), and The Hateful Eight (2015). He's known for having appeared in a number of big-budget films, including Die Hard with a Vengeance (1995), A Time to Kill (1996), The Long Kiss Goodnight (1996), The Negotiator (1997), Deep Blue Sea (1999), Unbreakable (2000), Shaft (2000) and its reboot (2019), XXX (2002), S.W.A.T. (2003), Coach Carter (2005), Snakes on a Plane (2006), Kingsman: The Secret Service (2014), Kong: Skull Island (2017), and Glass (2019).\n\nHe also gained widespread recognition as the Jedi Mace Windu in the Star Wars prequel trilogy (1999–2005), later voicing the role in the animated film Star Wars: The Clone Wars (2008) and the video game Lego Star Wars: The Clone Wars (2011). With his permission, his likeness was used for the Ultimate version of the Marvel Comics character Nick Fury; he subsequently played Fury in 11 Marvel Cinematic Universe films, beginning with a cameo appearance in Iron Man (2008), as well as guest-starring in the television series Agents of S.H.I.E.L.D. He will reprise this role in the upcoming Disney+ series Secret Invasion, which is set to premiere on June 21, 2023. Jackson has provided his voice for several animated films, documentaries, television series, and video games, including Lucius Best / Frozone in the Pixar films The Incredibles (2004) and Incredibles 2 (2018)."
        },
        {
            "id": 77335,
            "name": "Ben Mendelsohn",
            "image": "/pA9mu9D2IolVA0v2Yo0tJm6uUyI.jpg",
            "birth_date": "1969-04-03",
            "biography": "Paul Benjamin Mendelsohn (born April 3, 1969) is an Australian actor. He first rose to prominence in Australia for his breakout role in The Year My Voice Broke (1987) and since then he has had roles in films such as Animal Kingdom (2010), The Dark Knight Rises (2012), Starred Up (2013), Mississippi Grind (2015), Rogue One (2016), Darkest Hour (2017) and Steven Spielberg's Ready Player One (2018). In 2017, he joined the Marvel Cinematic Universe as Talos in Captain Marvel (2019) and Spider-Man: Far From Home (2019). He reprised his role as Talos in the Disney+ series Secret Invasion (2023) for 4 episodes.\n\nMendelsohn starred in the Netflix original series Bloodline (2015–2017), for which he won the Primetime Emmy Award for Outstanding Supporting Actor in a Drama Series in 2016. In 2020, Mendelsohn starred in the HBO crime miniseries The Outsider."
        },
        {
            "id": 9642,
            "name": "Jude Law",
            "image": "/6E8ixknAt2RD6ZmdZVNY8w6oRqJ.jpg",
            "birth_date": "1972-12-29",
            "biography": "David Jude Heyworth Law (born December 29, 1972) is an English actor. He has received multiple awards including a BAFTA Film Award as well as nominations for two Academy Awards and two Tony Awards. In 2007, he received an Honorary César and was named a knight of the Order of Arts and Letters by the French government.\n\nBorn and raised in London, Law started acting in theatre. After finding small roles in feature films, Law gained recognition for his role in Anthony Minghella's The Talented Mr. Ripley (1999), for which he won the BAFTA Award for Best Actor in a Supporting Role and was nominated for an Academy Award. He found further critical and commercial success in Enemy at the Gates (2001), Steven Spielberg's A.I. Artificial Intelligence (2001) and Sam Mendes' Road to Perdition (2002). He continued to gain praise for starring in the war film Cold Mountain (2003), the drama Closer (2004), and the romantic comedy The Holiday (2006), gaining Academy Award and BAFTA nominations for the first of these.\n\nLaw played Dr. Watson in Sherlock Holmes (2009) and Sherlock Holmes: A Game of Shadows (2011), a younger Albus Dumbledore in Fantastic Beasts: The Crimes of Grindelwald (2018), and Yon-Rogg in Captain Marvel (2019); all of which rank among his highest-grossing releases. His other notable roles were in Contagion (2011), Hugo (2011), Side Effects (2013), The Grand Budapest Hotel (2014), and Spy (2015); and the television series The Young Pope (2016) and The New Pope (2020).\n\nLaw has also had an accomplished career on stage, performing in several West End and Broadway productions such as Les Parents terribles in 1994, Hamlet in 2010, and Anna Christie in 2011. He received Tony Award nominations for the first and second of these.\n\nLaw's Riff Raff Entertainment, founded with business partner Ben Jackson, inked a first-look deal for both feature films and television production with New Republic Pictures on April 13, 2021."
        },
        {
            "id": 516,
            "name": "Annette Bening",
            "image": "/sBiiRwAVXd0FCRZ87m0I89qGBvy.jpg",
            "birth_date": "1958-05-29",
            "biography": "Annette Carol Bening (born May 29, 1958) is an American actress. In a career spanning more than four decades, she has received many accolades, including a BAFTA Award and two Golden Globes as well as nominations for a Primetime Emmy Award, two Tony Awards, and five Academy Awards.\n\nBening began her career on stage with the Colorado Shakespeare Festival company in 1980, and played Lady Macbeth in 1984 at the American Conservatory Theater. She made her Broadway debut in the Tina Howe play Coastal Disturbances (1987) for which she received a nomination for the Tony Award for Best Featured Actress in a Play. She played the title role in a Geffen Playhouse production of Hedda Gabler (1999). She returned to Broadway in the revival of Arthur Miller's All My Sons (2019) earning another Tony nomination for Best Actress in a Play.\n\nBening won the BAFTA Award for Best Actress in a Leading Role for playing a materialistic wife in American Beauty (1999), and received nominations for five Academy Awards for her roles in The Grifters (1990), American Beauty, Being Julia (2004), The Kids Are All Right (2010), and Nyad (2023). She was nominated for a Primetime Emmy Award for playing the title role in the television film Mrs. Harris (2005). Her other notable films include Postcards from the Edge (1990), Bugsy (1991), Richard III (1995), The American President (1995), 20th Century Women (2016), Film Stars Don't Die in Liverpool (2017), The Seagull (2018), The Report (2019), Captain Marvel (2019), and Death on the Nile (2022).\n\nDescription above from the Wikipedia article Annette Bening, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 938,
            "name": "Djimon Hounsou",
            "image": "/8BpM0SSdRJdMMl3vRqrk2LUICxH.jpg",
            "birth_date": "1964-04-24",
            "biography": "Djimon Gaston Hounsou (born April 24, 1964) is a Beninese-American actor and model. He began his career appearing in music videos, made his film debut in Without You I'm Nothing and earned widespread recognition for his role as Cinqué in the Steven Spielberg film Amistad. As an actor, Hounsou has been nominated for two Academy Awards.\n\nHounsou became a naturalized American citizen in 2007. He was reluctant to renounce his Beninese citizenship and therefore opted to become a dual citizen of both Benin and the United States, effectively rendering him a Beninese-American.\n\nDjimon Hounsou was born in Cotonou, Benin, in 1964, to lbertine and Pierre Hounsou. He immigrated to Lyon in France at the age of thirteen with his brother, Edmond. In 1987, he became a model and established a career in Paris. He moved to the U.S. in 1990. One year before obtaining his college degree, he dropped out of school.\n\nIn 1989, he appeared in a music video of Straight Up by Paula Abdul. Hounsou's film debut was in the 1990 Sandra Bernhard film Without You I’m Nothing, and he has had television roles on Beverly Hills, 90210 and ER and a guest starring role on Alias, but received a larger role in the science fiction film Stargate. His first on-screen appearance was in the 1990 Janet Jackson video “Love Will Never Do (Without You).” He also starred in a 2002 Gap commercial directed by Peter Lindbergh, dancing to a rendition of John Lee Hooker's \"Boom Boom\" by Arrested Development's Baba Oje.\n\nHe received wide critical acclaim and a Golden Globe Award nomination for his role as Cinqué in the 1997 Steven Spielberg film Amistad. He gained further notice as Juba, in the 2000 film Gladiator. He was nominated for the Academy Award for Best Supporting Actor, for In America, in 2004, becoming the fourth African male to be nominated for an Oscar (along with Basil Rathbone, Cecil Kellaway and Omar Sharif). In 2006, he won the National Board of Review Award for Best Supporting Actor for his performance in Blood Diamond; he received Broadcast Film Critics Association, Screen Actors Guild Award, and Academy Award nominations for this performance.\n\nIn 2007, Hounsou began dating model/CEO of Baby Phat, Kimora Lee Simmons. In 2008 Hounsou and Simmons visited Hounsou's family and while there, the two participated in a traditional commitment ceremony. On May 30, 2009, Simmons gave birth to their son, Kenzo Lee Hounsou, reportedly named because Kenzo means 3 (Kimora's third child)."
        },
        {
            "id": 11092,
            "name": "Simon Kinberg",
            "image": "/3xvTvkIaKfU276cpajiAoGjvaaO.jpg",
            "birth_date": "1973-08-02",
            "biography": "Simon David Kinberg (born August 2, 1973) is a British-born American filmmaker. He wrote or produced a number of films in the 20th Century Fox X-Men film franchise,and has also written such films as Mr. & Mrs. Smith and Sherlock Holmes. He has served as a producer on others including Cinderella and The Martian, the latter which was nominated for the Academy Award for Best Picture. His production company Genre Films had a first-look deal with 20th Century Fox. Kinberg made his directorial debut in the 2019 X-Men film Dark Phoenix from a script he also wrote."
        },
        {
            "id": 1001657,
            "name": "Sophie Turner",
            "image": "/8ur4aHFakVCinWk0cvrGO8qAUhv.jpg",
            "birth_date": "1996-02-21",
            "biography": "Sophie Belinda Jonas (née Turner; born 21 February 1996) is an English actress. She made her acting debut as Sansa Stark on the HBO epic fantasy television series Game of Thrones (2011–2019), for which she received a Primetime Emmy Award nomination for the Outstanding Supporting Actress in a Drama Series in 2019.\n\nTurner appeared in the television film The Thirteenth Tale (2013) and made her feature film debut in Another Me (2013). She appeared in the action comedy Barely Lethal (2015) and portrayed a young Jean Grey / Phoenix in the X-Men film series (2016–2019)."
        },
        {
            "id": 5530,
            "name": "James McAvoy",
            "image": "/vB6qYlFXgONGVwwxWXE4gf0F8SQ.jpg",
            "birth_date": "1979-04-21",
            "biography": "James McAvoy (born 21 April 1979) is a Scottish actor. He made his acting debut as a teen in The Near Room (1995) and appeared mostly on television until 2003, when his feature film career began. His notable television work includes the thriller State of Play, science fiction miniseries Frank Herbert's Children of Dune and the channel 4s BAFTA award-winning series Shameless (British TV series)\n\nHe has performed in several West End productions and has received four nominations for the Laurence Olivier Award for Best Actor, and has also done voice work for animated films including Gnomeo & Juliet, its sequel Sherlock Gnomes, and Arthur Christmas.\n\nIn 2003, McAvoy appeared in a lead role in Bollywood Queen, then in another lead role as Rory in Inside I'm Dancing in 2004. This was followed by a supporting role, as the faun Mr. Tumnus, in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005). His performance in Kevin Macdonald's drama The Last King of Scotland (2006) garnered him several award nominations, including the BAFTA Award for Best Supporting Actor. The critically acclaimed romantic drama war film Atonement (2007) earned him a Golden Globe Award nomination and his second BAFTA nomination. He later appeared as a newly trained assassin in the action thriller Wanted (2008).\n\nIn 2011, McAvoy portrayed Professor Charles Xavier in the superhero film X-Men: First Class, a role he reprised in X-Men: Days of Future Past (2014), X-Men: Apocalypse (2016), Deadpool 2 (2018), and Dark Phoenix (2019). McAvoy starred in the crime comedy-drama film Filth (2013), for which he won Best Actor in the British Independent Film Awards. In 2016, he portrayed Kevin Wendell Crumb, a man with 23 alternate personalities, in M. Night Shyamalan's Split, for which he received critical acclaim, and later reprised the role for the sequel Glass (2019). Since 2019, he has portrayed Lord Asriel Belacqua in the BBC/HBO fantasy series His Dark Materials."
        },
        {
            "id": 3292,
            "name": "Nicholas Hoult",
            "image": "/laeAYQVBV9U3DkJ1B4Cn1XhpT8P.jpg",
            "birth_date": "1989-12-07",
            "biography": "Nicholas Caradoc Hoult (born December 7, 1989) is an English actor. His body of work includes supporting work in big-budget mainstream productions and starring roles in independent projects in both the American and the British film industries. He has been nominated for awards such as a British Academy Film Award, a Golden Globe Award, and a Screen Actors Guild Award.\n\nBorn and raised in Wokingham, Berkshire, Hoult was drawn to acting from a young age and appeared in local theatre productions as a child. He made his screen debut at age seven in the 1996 film Intimate Relations, and appeared in several television programmes between 1998 and 2001. Hoult's breakthrough role came when he played Marcus Brewer in the 2002 comedy-drama film About a Boy, for which he was nominated for the Critics' Choice Movie Award for Best Young Performer. He achieved wider recognition and praise for his performance as Tony Stonem in the E4 teen comedy-drama series Skins (2007–2008). His transition to adult roles began with the 2009 drama film A Single Man, for which he earned a BAFTA Rising Star Award nomination, and the fantasy film Clash of the Titans (2010). He was cast as the mutant Hank McCoy in Matthew Vaughn's 2011 superhero film X-Men: First Class, a role he reprised in later instalments of the series.\n\nIn 2013, Hoult played the lead title role in the fantasy adaptation Jack the Giant Slayer and starred as a zombie in romantic comedy Warm Bodies. Following a supporting role in Mad Max: Fury Road (2015), Hoult starred in a number of independent films before portraying various real-life figures such as Robert Harley, Earl of Oxford in the historical black comedy The Favourite (2018), writer J. R. R. Tolkien in Tolkien (2019), and Peter III in the Hulu comedy-drama series The Great (2020–present). In 2021, he starred in the survival thriller Those Who Wish Me Dead."
        },
        {
            "id": 1034681,
            "name": "Tye Sheridan",
            "image": "/A2QZhszh0o9lDygHE3mphhgyVxI.jpg",
            "birth_date": "1996-11-11",
            "biography": "Tye Kayle Sheridan (born November 11, 1996) is an American actor and producer. He is best known for playing the young Scott Summers / Cyclops in the reboot X-Men film series (2016–2019), as well as Wade Watts in Ready Player One (2018) and Ben Goudy in Scouts Guide to the Zombie Apocalypse (2015). Sheridan made his feature film debut in Terrence Malick's experimental drama film The Tree of Life (2011) and had his first leading role in Jeff Nichols's film Mud (2012). He also co-starred in David Gordon Green's drama Joe (2013) and the period thriller The Stanford Prison Experiment (2015). In 2020 he co-founded AI production tools company Wonder Dynamics with visual effects artist Nikola Todorovic."
        },
        {
            "id": 17288,
            "name": "Michael Fassbender",
            "image": "/xvbnUiB2ZBR3QIt595OzNy657Vw.jpg",
            "birth_date": "1977-04-02",
            "biography": "Michael Fassbender (born 2 April 1977) is an Irish actor. He is the recipient of various accolades, including a Screen Actors Guild Award, a Critics' Choice Movie Award, and nominations for two Academy Awards, four British Academy Film Awards and three Golden Globe Awards.\n\nBorn in Heidelberg and raised in Killarney, Fassbender made his feature film debut as a Spartan warrior in the fantasy war epic 300 (2006). His earlier roles included various stage productions, as well as starring roles on television such as in the HBO miniseries Band of Brothers (2001) and the Sky One fantasy drama Hex (2004–05). He first came to prominence for his role as IRA volunteer Bobby Sands in Hunger (2008), for which he won a British Independent Film Award. Subsequent roles include the independent film Fish Tank (2009), as a Royal Marines lieutenant in Inglourious Basterds (2009), as Edward Rochester in the 2011 film adaptation of Jane Eyre, as Carl Jung in A Dangerous Method (2011), as the sentient android, David 8, in Ridley Scott's Prometheus (2012) and its sequel, Alien: Covenant (2017), and in the musical comedy drama Frank (2014) as an eccentric musician loosely inspired by Frank Sidebottom.\n\nThe actor’s former girlfriend, Sunawin “Leasi” Andrews, says she was the victim of domestic abuse at the hands of Fassbender in 2009. Andrews filed a restraining order in March 2010, requesting Fassbender stay at least 100 yards away from her and her two children. She also sought $24,000 to pay for medical bills that were the result of the injuries she says she suffered after Fassbender abused her on multiple occasions.\n\nOne instance of abuse allegedly occurred after Fassbender and Andrews were having dinner with friends at a restaurant. The court filings say Fassbender became angry with Andrews after one of her ex-boyfriends came over to their table to say hello. The actor’s anger carried over to the car ride home.\n\n“I went to the hospital and had a twisted left ankle, blown out left knee cap and a bursted ovarian cyst,” Andrews’ filing reads. “Lots of internal bleeding.”\n\nA second instance of abuse reportedly occurred at a July 2009 film festival. Fassbender had been partying late and came back to his hotel room with a friend and the two tried to get into bed with Andrews. She says she ended up checking into another room so she could avoid the two men. The next morning Andrews found Fassbender “sleeping in urine” and when she tried to wake him up, he allegedly threw her over a chair and broke her nose."
        },
        {
            "id": 1253199,
            "name": "Alexandra Shipp",
            "image": "/98AfO5NSqWnlhIxjSg08gGYdxUG.jpg",
            "birth_date": "1991-07-16",
            "biography": "Alexandra Ruth Shipp (born July 16, 1991) is an American actress and singer who rose to prominence for portraying singer Aaliyah in the Lifetime television film Aaliyah: The Princess of R&B (2014) and Kimberly Woodruff in the Oscar-nominated film Straight Outta Compton (2015).\n\nShipp is best known for playing Storm in the X-Men franchise, starting with X-Men: Apocalypse, Abby Suso in the 2018 romantic comedy Love, Simon, and Susan Wilson in Lin-Manuel Miranda's musical drama Tick, Tick... Boom!."
        },
        {
            "id": 240,
            "name": "Stanley Kubrick",
            "image": "/yFT0VyIelI9aegZrsAwOG5iVP4v.jpg",
            "birth_date": "1928-07-26",
            "biography": "Stanley Kubrick (July 26, 1928 – March 7, 1999) was an American film director, writer, producer, and photographer who lived in England during most of the last four decades of his career. Kubrick was noted for the scrupulous care with which he chose his subjects, his slow method of working, the variety of genres he worked in, his technical perfectionism, and his reclusiveness about his films and personal life. He maintained almost complete artistic control, making movies according to his own whims and time constraints, but with the rare advantage of big-studio financial support for all his endeavors. Kubrick's films are characterized by a formal visual style and meticulous attention to detail—his later films often have elements of surrealism and expressionism that eschews structured linear narrative. His films are repeatedly described as slow and methodical, and are often perceived as a reflection of his obsessive and perfectionist nature. A recurring theme in his films is man's inhumanity to man. While often viewed as expressing an ironic pessimism, a few critics feel his films contain a cautious optimism when viewed more carefully.\n\nThe film that first brought him attention to many critics was Paths of Glory (1957), the first of three films of his about the dehumanizing effects of war. Many of his films at first got a lukewarm reception, only to be years later acclaimed as masterpieces that had a seminal influence on many later generations of film-makers. Considered especially groundbreaking was 2001: A Space Odyssey (1968) noted for being both one of the most scientifically realistic and visually innovative science-fiction films ever made while maintaining an enigmatic non-linear storyline. He voluntarily withdrew his film A Clockwork Orange (1971) from England, after it was accused of inspiring copycat crimes which in turn resulted in threats against Kubrick's family. His films were largely successful at the box-office, although Barry Lyndon (1975) performed poorly in the United States. Living authors Anthony Burgess and Stephen King were both unhappy with Kubrick's adaptations of their novels A Clockwork Orange and The Shining (1980) respectively, and both authors were engaged with subsequent adaptations. All of Kubrick's films from the mid-1950s to his death except for The Shining were nominated for Oscars, Golden Globes, or BAFTAs. Although he was nominated for an Academy Award as a screenwriter and director on several occasions, his only personal win was for the special effects in 2001: A Space Odyssey.\n\nEven though all of his films, apart from the first two, were adapted from novels or short stories, his works have been described by Jason Ankeny and others as \"original and visionary\". Although some critics, notably Andrew Sarris and Pauline Kael, frequently disparaged Kubrick's work, Ankeny describes Kubrick as one of the most \"universally acclaimed and influential directors of the postwar era\" with a \"standing unique among the filmmakers of his day.\""
        },
        {
            "id": 245,
            "name": "Keir Dullea",
            "image": "/dL9i0nCk2fCgInZNaYVjGck2IBp.jpg",
            "birth_date": "1936-05-30",
            "biography": "Keir Dullea (born May 30, 1936) is an American actor best known for the character of astronaut David Bowman, whom he portrayed in the 1968 film 2001: A Space Odyssey and in 1984's 2010: The Year We Make Contact, as well as his roles in the films Bunny Lake is Missing (1965) and Black Christmas (1974)."
        },
        {
            "id": 246,
            "name": "Gary Lockwood",
            "image": "/lQBqZKpMxGslopZRvFanIWL4pSl.jpg",
            "birth_date": "1937-02-21",
            "biography": "Gary Lockwood (born February 21, 1937) is an American actor perhaps best known for his iconic 1968 role as the astronaut Dr. Frank Poole in 2001: A Space Odyssey. He is father of the actress Samantha Lockwood. Both currently live in Los Angeles."
        },
        {
            "id": 247,
            "name": "William Sylvester",
            "image": "/gDzQVVDyzTMLuyK3iSrorDt1Utf.jpg",
            "birth_date": "1922-01-31",
            "biography": "William Sylvester (January 31, 1922 – January 25, 1995) was an American TV and film actor. His most famous film credit was Dr. Heywood Floyd in Stanley Kubrick's 2001 A Space Odyssey (1968). Born in Oakland, California and married at one time to the British actress Veronica Hurst, he moved to England after the Second World War and became a staple of British B films at a time when American and Canadian actors were much in demand in order to give indigenous films some appeal in the US.\n\nAs a result, he gained top billing in one of his very first films, House of Blackmail (1953), directed by the veteran filmmaker Maurice Elvey, for whom he also made What Every Woman Wants the following year. He also starred in such minor films as The Stranger Came Home (1954, for Hammer), Dublin Nightmare (1958), Offbeat (1960), Information Received (1961), Incident at Midnight, Ring of Spies and Blind Corner (all 1963). There were also lead roles in four British horror films: Gorgo (1960), Devil Doll (1963), Devils of Darkness (1964) and The Hand of Night (1966). Among his many TV credits were a 1959 BBC version of Shakespeare's Julius Caesar (playing Mark Antony), The Saint, The Baron, The High Chaparral, Harry O and The Six Million Dollar Man.\n\nHis later films included You Only Live Twice (1967) and, back in the USA after his prominent role for Kubrick, Busting (1973), The Hindenburg (1975) and Heaven Can Wait (1978). He died in Sacramento, California in 1995, aged 72."
        },
        {
            "id": 253,
            "name": "Douglas Rain",
            "image": "/blDCxSTUP5U9EdKOmhGtRvhby2c.jpg",
            "birth_date": "1928-03-13",
            "biography": "Douglas Rain (March 13, 1928 - November 11, 2018) was a Canadian actor and narrator. He was primarily a stage actor, but his best known film role was as the voice of the HAL 9000 computer in 2001: A Space Odyssey (1968) and its sequel 2010 (1984).\n\nRain was born in Winnipeg, Manitoba. He studied acting at the Banff School of Fine Arts in Banff, Alberta as well as in London at the Old Vic School. As a stage actor, his long association with the Stratford Festival of Canada that spans more than four decades. He has performed in many diverse roles on stage, most notably recognized for his performance at Stratford, Ontario in Henry V which was made into a television production in 1966.\n\nRain was also nominated for Broadway's 1972 Tony Award as Best Supporting or Featured Actor (Dramatic) for his performance in Vivat! Vivat Regina!"
        },
        {
            "id": 248,
            "name": "Daniel Richter",
            "image": "/cq8Fprv33RgYPwu39cGx6fxk5Qp.jpg",
            "birth_date": "1939-06-15",
            "biography": ""
        },
        {
            "id": 249,
            "name": "Leonard Rossiter",
            "image": "/qXjGUJ2TjO3ltiEYMEJ658VeqkA.jpg",
            "birth_date": "1926-10-21",
            "biography": "From Wikipedia, the free encyclopedia.  Leonard Rossiter (21 October 1926 – 5 October 1984) was an English actor known for his roles as Rupert Rigsby, in the British comedy television series Rising Damp (1974–78), and Reginald Iolanthe Perrin, in The Fall and Rise of Reginald Perrin (1976–79). He also had a long and distinguished career in the theatre and gained some notoriety for a series of Cinzano commercials (1978–1983), with Joan Collins.\n\nDescription above from the Wikipedia article Leonard Rossiter, licensed under CC-BY-SA,full list of contributors on Wikipedia."
        },
        {
            "id": 1150,
            "name": "Brian De Palma",
            "image": "/t29YojZlOEqNSWvfmY0DDYh3vnb.jpg",
            "birth_date": "1940-09-11",
            "biography": "Brian Russell De Palma (born September 11, 1940) is an American film director and writer. In a career spanning over 40 years, he is probably best known for his suspense and crime thriller films. De Palma was a leading member of the New Hollywood generation of film directors. His direction often makes use of quotations from other films or cinematic styles, and bears the influence of filmmakers such as Alfred Hitchcock, Jean-Luc Godard, and Michelangelo Antonioni. His work has been criticized for its violence and sexual content but has also been championed by American critics such as Roger Ebert and Pauline Kael."
        },
        {
            "id": 1158,
            "name": "Al Pacino",
            "image": "/2dGBb1fOcNdZjtQToVPFxXjm4ke.jpg",
            "birth_date": "1940-04-25",
            "biography": "Alfredo James Pacino (born April 25, 1940) is an American actor and filmmaker. In a career spanning over five decades, he has received many awards and nominations, including an Academy Award, two Tony Awards, and two Primetime Emmy Awards. He is one of the few performers to have received the Triple Crown of Acting. He has also been honored with the AFI Life Achievement Award, the Cecil B. DeMille Award, and the National Medal of Arts.\n\nA method actor and former student of the HB Studio and the Actors Studio, where he was taught by Charlie Laughton and Lee Strasberg, Pacino's film debut came at the age of 29 with a minor role in Me, Natalie (1969). He gained favorable notice for his first lead role as a heroin addict in The Panic in Needle Park (1971). Wide acclaim and recognition came with his breakthrough role as Michael Corleone in Francis Ford Coppola's The Godfather (1972), for which he received his first Oscar nomination, and he would reprise the role in the sequels The Godfather Part II (1974) and The Godfather Part III (1990).\n\nHis portrayal of Michael Corleone is regarded as one of the greatest in film history. Pacino received nominations for the Academy Award for Best Actor for Serpico (1973), The Godfather Part II, Dog Day Afternoon (1975), and ...And Justice for All (1979), ultimately winning it for playing a blind military veteran in Scent of a Woman (1992). For his performances in The Godfather, Dick Tracy (1990), Glengarry Glen Ross (1992), and The Irishman (2019), he earned Best Supporting Actor Oscar nominations.\n\nOther notable portrayals include Tony Montana in Scarface (1983), Carlito Brigante in Carlito's Way (1993), Benjamin Ruggiero in Donnie Brasco (1997), and Lowell Bergman in The Insider (1999). He has also starred in the thrillers Heat (1995), The Devil's Advocate (1997), Insomnia (2002), and appeared in Once Upon a Time in Hollywood (2019). On television, Pacino has acted in several productions for HBO, including Angels in America (2003) and the Jack Kevorkian biopic You Don't Know Jack (2010), winning a Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie for each. Pacino currently stars in the Amazon Video web television series Hunters (2020–present).\n\nHe has also had an extensive career on stage. He is a two-time Tony Award winner, in 1969 and 1977, for his performances in Does a Tiger Wear a Necktie? and The Basic Training of Pavlo Hummel. Pacino made his filmmaking debut with Looking for Richard (1996), directing and starring in this documentary about Richard III; Pacino had played the lead role on stage in 1977. He has also acted as Shylock in a 2004 feature film adaptation and 2010 stage production of The Merchant of Venice. Pacino directed and starred in Chinese Coffee (2000), Wilde Salomé (2011), and Salomé (2013). Since 1994, he has been the joint president of the Actors Studio.​\n\nFrom Wikipedia, the free encyclopedia"
        },
        {
            "id": 1159,
            "name": "Steven Bauer",
            "image": "/eMSeKPgfilE2v5VcmwSt5pxbp0x.jpg",
            "birth_date": "1956-12-02",
            "biography": "Steven Bauer (born December 2, 1956) is a Cuban-American actor. He is known for his role as Manny Ribera in the 1983 film Scarface, and his role on the bilingual PBS show Que Pasa, USA."
        },
        {
            "id": 1160,
            "name": "Michelle Pfeiffer",
            "image": "/oGUmQBU87QXAsnaGleYaAjAXSlj.jpg",
            "birth_date": "1958-04-29",
            "biography": "Michelle Marie Pfeiffer (born April 29, 1958) is an American actress and producer. She has received many accolades, including a Golden Globe Award, and three nominations for Academy Award.\n\nPfeiffer began to pursue an acting career in 1978 and had her first leading role in the musical film Grease 2 (1982). Frustrated with being typecast as the token pretty girl, she actively pursued more serious material and had her breakthrough role as gangster moll Elvira Hancock in the crime film Scarface (1983). Further success came with leading roles in the fantasy feature The Witches of Eastwick (1987) and the comedy Married to the Mob (1988). Her roles in Dangerous Liaisons (1988) and The Fabulous Baker Boys (1989) garnered her two consecutive Academy Award nominations, for Best Supporting Actress and Best Actress, respectively; her portrayal of lounge singer Susie Diamond in the latter is one of the most acclaimed of her career.\n\nPfeiffer went on to star as Catwoman / Selina Kyle in Tim Burton's superhero film Batman Returns (1992), following which she won the Silver Bear for Best Actress and earned a third Academy Award nomination for playing a troubled housewife in Love Field (1992). She continued to gain praise for her performances in the dramas The Age of Innocence (1993) and White Oleander (2002), and the horror films Wolf (1994) and What Lies Beneath (2000). During this time, she also produced a series of films under her production company Via Rosa Productions. After a hiatus from acting in 2002, she returned with the musical Hairspray (2007). She received her first Emmy Award nomination for portraying Ruth Madoff in the HBO television film The Wizard of Lies (2017), she went on to feature in the ensemble films Murder on the Orient Express (2017) and debuted in the Marvel Cinematic Universe as Janet Van Dyne in Ant-Man and the Wasp (2018). Since then, she has reprised her role in Avengers: Endgame (2019) and Ant-Man and the Wasp: Quantumania (2023).\n\nDescription above from the Wikipedia article Michelle Pfeiffer, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 1161,
            "name": "Mary Elizabeth Mastrantonio",
            "image": "/vbZ1E557K5oj34xLHR5ErO8wPCi.jpg",
            "birth_date": "1958-11-17",
            "biography": "Mary Elizabeth Mastrantonio (born November 17, 1958) is an American actress and singer known for her role in The Color of Money, The Abyss, Scarface, and Robin Hood: Prince of Thieves."
        },
        {
            "id": 1162,
            "name": "Robert Loggia",
            "image": "/mRSUgJnfprCNw83pyVfpfW7ryfK.jpg",
            "birth_date": "1930-01-03",
            "biography": "Salvatore \"Robert\" Loggia (January 3, 1930 – December 4, 2015) was an American actor. He was nominated for the Academy Award for Best Supporting Actor for Jagged Edge (1985) and won the Saturn Award for Best Supporting Actor for Big (1988).\n\nIn a career spanning over sixty years, Loggia performed in many films, including The Greatest Story Ever Told (1965), three Pink Panther films, An Officer and a Gentleman (1982), Scarface (1982), Prizzi's Honor (1985), Oliver & Company (1988), Innocent Blood (1992), Independence Day (1996), Lost Highway (1997), Return to Me (2000), and Tim and Eric's Billion Dollar Movie (2012).\n\nDescription above from the Wikipedia article Robert Loggia, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 1163,
            "name": "Miriam Colon",
            "image": "/oW8N63FyKbcOK4eWbnpXPjcTzk4.jpg",
            "birth_date": "1936-08-20",
            "biography": "From Wikipedia, the free encyclopedia\n\nMíriam Colón (born August 20, 1936) is a Puerto Rican actress and the founder and director of the Puerto Rican Traveling Theater in New York City.\n\nDescription above from the Wikipedia article Míriam Colón, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 55499,
            "name": "Scott Derrickson",
            "image": "/nOQkRTC6OPkUHebBfjIgtiZ0hvE.jpg",
            "birth_date": "1966-07-16",
            "biography": "Scott Derrickson is an American filmmaker who is known for directing horror films such as Deliver Us from Evil, Hellraiser: Inferno, Sinister and The Black Phone. He also directed the superhero film Doctor Strange starring Benedict Cumberbatch. In March 2022, Derrickson was set to direct The Gorge for Skydance. Apple TV+ acquried the right of the film."
        },
        {
            "id": 71580,
            "name": "Benedict Cumberbatch",
            "image": "/wz3MRiMmoz6b5X3oSzMRC9nLxY1.jpg",
            "birth_date": "1976-07-19",
            "biography": "Benedict Timothy Carlton Cumberbatch (born 19 July 1976) is an English actor. Known for his roles on the screen and stage, he has received various accolades throughout his career, including a Primetime Emmy Award, a British Academy Television Award, and a Laurence Olivier Award. Cumberbatch won the Laurence Olivier Award for Best Actor in a Leading Role in a Play for Frankenstein and a Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or Movie for Sherlock. His performances in the dramas The Imitation Game (2014) and The Power of the Dog (2021) earned him nominations for an Academy Award, a BAFTA Award, a Screen Actors Guild Award, and a Golden Globe Award, all for Best Actor in a Leading Role. For playing the title role in five-part drama miniseries Patrick Melrose, he won a BAFTA TV Award for Best Actor in a Leading Role.\n\nIn 2014 Time magazine included him in its annual list of the 100 most influential people in the world, and in 2015 he was appointed a CBE by Queen Elizabeth II in the 2015 Birthday Honours for services to the performing arts and to charity. A graduate of the Victoria University of Manchester, Cumberbatch continued his training at the London Academy of Music and Dramatic Art, obtaining a Master of Arts in Classical Acting. He first performed at the Open Air Theatre, Regent's Park in Shakespearean productions and made his West End debut in Richard Eyre's revival of Hedda Gabler in 2005. Since then, he has starred in the Royal National Theatre productions After the Dance (2010) and Frankenstein (2011). In 2015, he played the title role in Hamlet at the Barbican Theatre.\n\nCumberbatch's television work includes his performance as Stephen Hawking in the television film Hawking in 2004. He gained worldwide recognition for his performance as Sherlock Holmes in the BBC series Sherlock from 2010 to 2017. He has also headlined Tom Stoppard's adaptation of Parade's End (2012), The Hollow Crown: The Wars of the Roses (2016), Patrick Melrose (2018), and Brexit: The Uncivil War (2019). In films, Cumberbatch has starred in Amazing Grace (2006) as William Pitt the Younger, Star Trek Into Darkness (2013) as Khan, 12 Years a Slave (2013) as William Prince Ford, The Fifth Estate (2013) as Julian Assange, and The Imitation Game (2014) as Alan Turing. He also acted in the historical dramas The Current War (2017), 1917 (2019) and The Courier (2020), and received critical acclaim for his performance in Jane Campion's Western drama The Power of the Dog (2021). From 2012 to 2014, through voice and motion capture, he played the characters of Smaug and Sauron in The Hobbit film series. Cumberbatch portrays Dr. Stephen Strange in the Marvel Cinematic Universe films, beginning with Doctor Strange (2016), and also voiced the character in the animated series What If...? (2021)."
        },
        {
            "id": 5294,
            "name": "Chiwetel Ejiofor",
            "image": "/kq5DDnqqofoRI0t6ddtRlsJnNPT.jpg",
            "birth_date": "1977-07-10",
            "biography": "Chiwetelu Umeadi \"Chiwetel\" Ejiofor (born on July 10, 1977) is an English actor. He attended London Academy of Music and Dramatic Art, but had to leave after a year after receiving the roll of Ens, in Steven Spielberg's historical drama, \"Amistad\". For his first leading film role in Dirty Pretty Things, he won a British Independent Film Award for best actor. He has portrayed Othello in numerous stage productions including Bloomsbury Theatre, Theatre Royal in Glasgow and Donmar Warehouse. He made his directorial debut in the short film Slapper, which he also wrote. He soon became well known after moving on to bigger roles in \"Inside Man\" (2005), \"American Gangster\" (2007), \"Children of Men\" and Steve McQueen's \"12 Years a Slave\" (2012)."
        },
        {
            "id": 53714,
            "name": "Rachel McAdams",
            "image": "/2zyOjda95OfAAsJvuwTV0UaznPZ.jpg",
            "birth_date": "1978-11-17",
            "biography": "Rachel Anne McAdams (born November 17, 1978) is a Canadian actress. After graduating from a theatre degree program at York University in 2001, she worked in Canadian television and film productions, such as the drama film Perfect Pie (2002), for which she received a Genie Award nomination, the comedy film My Name Is Tanino (2002), and the comedy series Slings and Arrows (2003–2005), for which she won a Gemini Award.\n\nIn 2002, she made her Hollywood film debut in the comedy The Hot Chick. She rose to fame in 2004 with the comedy Mean Girls and the romantic drama The Notebook. In 2005, she starred in the romantic comedy Wedding Crashers, the psychological thriller Red Eye, and the comedy-drama The Family Stone. She was hailed by the media as Hollywood's new \"it girl\", and received a BAFTA Award nomination for Best Rising Star.\n\nAfter a brief sabbatical, she returned to prominence in 2009, by appearing in the political thriller State of Play, the romance The Time Traveler's Wife, and the 2009 mystery film Sherlock Holmes. In 2010, McAdams appeared in the star vehicle comedy film Morning Glory, and went on to star in the films Midnight in Paris (2011), The Vow (2012), and About Time (2013). In 2015, she starred in the second season of the HBO anthology crime drama series True Detective, and portrayed the journalist Sacha Pfeiffer in the drama Spotlight. For the latter, she was nominated for the Academy Award for Best Supporting Actress. This was followed by roles in the superhero film Doctor Strange (2016), the romantic drama Disobedience (2017), the comedies Game Night (2018) and Eurovision Song Contest: The Story of Fire Saga (2020), the superhero sequel Doctor Strange in the Multiverse of Madness (2022) and the coming-of-age drama Are You There God? It’s Me, Margaret (2023)."
        },
        {
            "id": 30082,
            "name": "Benedict Wong",
            "image": "/yYfLyrC2CE6vBWSJfkpuVKL2POM.jpg",
            "birth_date": "1971-06-03",
            "biography": "Benedict Wong was born in 1970 in Manchester, England. He is an actor and writer, best known for his role as Wong in the Marvel Cinematic Universe titles Doctor Strange (2016), Avengers: Infinity War (2018), Avengers: Endgame (2019), Shang-Chi and the Legend of the Ten Rings (2021), Spider-Man: No Way Home (2021), Doctor Strange in the Multiverse of Madness (2022) and the Disney+ series, She-Hulk: Attorney at Law (2022). He has also appeared in The Martian (2015) and Prometheus (2012)."
        },
        {
            "id": 1019,
            "name": "Mads Mikkelsen",
            "image": "/pfZaC3X9kWBFkEVkwAhDBjCRO2.jpg",
            "birth_date": "1965-11-22",
            "biography": "Mads Dittmann Mikkelsen (born November 22, 1965) is a Danish actor. Originally a gymnast and dancer, he rose to fame in Denmark as an actor for his roles such as Tonny in the first two films of the Pusher film trilogy (1996, 2004), Detective Sergeant Allan Fischer in the television series Rejseholdet (2000–2004), Niels in Open Hearts (2002), Svend in The Green Butchers (2003), Ivan in Adam's Apples (2005) and Jacob Petersen in After the Wedding (2006).\n\nMikkelsen achieved worldwide recognition for playing the main antagonist Le Chiffre in the twenty-first James Bond film, Casino Royale (2006). His other roles include Igor Stravinsky in Coco Chanel & Igor Stravinsky (2008), Johann Friedrich Struensee in A Royal Affair (2012), his Cannes Film Festival Best Actor Award-winning performance as Lucas in the Danish film The Hunt (2012), Dr. Hannibal Lecter in the television series Hannibal (2013–2015), Kaecilius in Marvel's Doctor Strange (2016), Galen Erso in Lucasfilm's Rogue One (2016), Cliff Unger in Hideo Kojima's video game Death Stranding (2019), his BAFTA-nominated role as Martin in Another Round (2020) and Gellert Grindelwald in Fantastic Beasts: The Secrets of Dumbledore (2022).\n\nA. O. Scott of The New York Times remarked that in the Hollywood scene, Mikkelsen has \"become a reliable character actor with an intriguing mug\" but stated that on the domestic front \"he is something else: a star, an axiom, a face of the resurgent Danish cinema\"."
        },
        {
            "id": 3063,
            "name": "Tilda Swinton",
            "image": "/gWbX3a7V2MgRMRzekfITNcb27xV.jpg",
            "birth_date": "1960-11-05",
            "biography": "Katherine Matilda Swinton (born 5 November 1960) is a British actress. Known for her roles in independent films and blockbusters, she has received various accolades throughout her career, including an Academy Award and a British Academy Film Award, in addition to nominations for three Golden Globe Awards and five Screen Actors Guild Awards.\n\nSwinton began her career by appearing in experimental films starting with Caravaggio (1986), followed by The Last of England (1988), War Requiem (1989), and The Garden (1990). She won the Volpi Cup for Best Actress at the Venice Film Festival for her portrayal of Isabella of France in Edward II (1991). She next starred in Sally Potter's Orlando (1992), for which she received a nomination for the European Film Award for Best Actress. She was nominated for a Golden Globe Award for her performance in The Deep End (2001), and followed this with appearances in Vanilla Sky (2001), Adaptation (2002), Constantine (2005), Julia (2008), and I Am Love (2009).\n\nFor the film Young Adam (2003), she won the British Academy Scotland Award for Best Actress. Her performance in Michael Clayton (2007) won her the Academy Award for Best Supporting Actress and the BAFTA Award for Best Actress in a Supporting Role. Additionally, she won the European Film Award for Best Actress and received a nomination for the BAFTA Award for Best Actress in a Leading Role for the psychological thriller We Need to Talk About Kevin (2011). Swinton has also played the White Witch in The Chronicles of Narnia series (2005–2010) and the Ancient One in the Marvel Cinematic Universe franchise.\n\nSwinton was awarded the Richard Harris Award by the British Independent Film Awards in recognition of her contributions to the British film industry. In 2013, she was given a special tribute by the Museum of Modern Art. In 2020, Swinton was awarded the British Film Institute Fellowship, the highest honour presented by the institution, for her \"daringly eclectic and striking talents as a performer and filmmaker and recognises her great contribution to film culture, independent film exhibition and philanthropy.\" That same year, The New York Times ranked her thirteenth on its list of the greatest actors of the 21st century up to that point."
        },
        {
            "id": 7396,
            "name": "Peter Farrelly",
            "image": "/3PDYOFfk5NLmNcEz6SFZmdmqVZr.jpg",
            "birth_date": "1956-12-17",
            "biography": "Peter John Farrelly (born December 17, 1956) is an American film director, screenwriter, producer, and novelist, known for his work in the comedy genre with his younger brother Bobby, writing and directing films such as \"Dumb and Dumber\" (1994), \"There's Something About Mary\" (1998), and \"Me, Myself & Irene\" (2000). After a twenty-year run of collaborations that culminated in the sequel \"Dumb and Dumber To\" (2014), the Farrelly brothers embarked on solo careers. Peter made his solo directorial debut with the period drama \"Green Book\" (2018), which went on to win Best Picture at the Academy Awards in 2019."
        },
        {
            "id": 110,
            "name": "Viggo Mortensen",
            "image": "/vH5gVSpHAMhDaFWfh0Q7BG61O1y.jpg",
            "birth_date": "1958-10-20",
            "biography": "Viggo Peter Mortensen, Jr. (born October 20, 1958) is an American actor, writer, director, producer, musician, and multimedia artist. Born and raised in the state of New York to a Danish father and American mother, he also lived in Argentina during his childhood. He is the recipient of various accolades including a Screen Actors Guild Award and has been nominated for three Academy Awards, three BAFTA Awards, and four Golden Globe Awards."
        },
        {
            "id": 932967,
            "name": "Mahershala Ali",
            "image": "/9ZmSejm5lnUVY5IJ1iNx2QEjnHb.jpg",
            "birth_date": "1974-02-16",
            "biography": "Mahershalalhashbaz \"Mahershala\" Ali (born Mahershalalhashbaz Gilmore; February 16, 1974) is an American actor. Ali began his career as a regular on series such as Crossing Jordan and Threat Matrix before his breakthrough role as Richard Tyler in the science-fiction series The 4400. His first major film release was in the 2008 David Fincher-directed romantic fantasy drama film The Curious Case of Benjamin Button, and he gained wider attention for supporting roles in the final two films of the original The Hunger Games film series, and in House of Cards, for which he received a Primetime Emmy Award nomination.\n\nAli won the Academy Award for Best Supporting Actor for his performances in Moonlight (2016) and Green Book (2018). He is the first Muslim actor to win an Oscar, the first Black actor to win two Academy Awards in the same category, and the second Black actor to win multiple acting Oscars."
        },
        {
            "id": 1817,
            "name": "Linda Cardellini",
            "image": "/bcycvynDprC1rrhBNrnBjn5uOUd.jpg",
            "birth_date": "1975-06-25",
            "biography": "Linda Edna Cardellini (born June 25, 1975) is an American actress. In television, she is known for her leading roles in the teen drama Freaks and Geeks (1999–2000), the medical drama ER (2003–09), the drama thriller Bloodline (2015–17), and the tragicomedy Dead to Me (2019–present), the latter of which earned her a nomination for the Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series. She also guest starred in the period drama Mad Men (2013–15), for which she received a Primetime Emmy Award nomination. Her voice work includes the animated series Scooby-Doo! Mystery Incorporated (2010–13), Regular Show (2012–15), Gravity Falls (2012–16), and Sanjay and Craig (2013–16).\n\nIn film, Cardellini is best known for her portrayal of Velma Dinkley in Scooby-Doo (2002) and its sequel Scooby-Doo 2: Monsters Unleashed (2004), and her supporting roles in Legally Blonde (2001), Brokeback Mountain (2005), Grandma’s Boy (2006), Kill the Irishman (2011), Avengers: Age of Ultron (2015), The Founder (2016), Green Book, A Simple Favor (both 2018), and Avengers: Endgame (2019). She also starred in the drama Return (2011), earning an Independent Spirit Award for Best Female Lead nomination, the comedies Daddy's Home (2015) and Daddy's Home 2 (2017), and the horror film The Curse of La Llorona (2019).\n\nDescription above from the Wikipedia article Linda Cardellini, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 299743,
            "name": "Sebastian Maniscalco",
            "image": "/8TvA9HEwURJmY9MkkUruB4Sl0lR.jpg",
            "birth_date": "1973-07-08",
            "biography": "Sebastian Maniscalco (/mænɪˈskælkoʊ/; Italian: [mani'skalko]; born July 8, 1973) is an American stand-up comedian and actor. He has since released five comedy specials. Maniscalco has also had supporting acting roles in the films Green Book (2018) and The Irishman (2019), playing mobster Joe Gallo in the latter."
        },
        {
            "id": 1613744,
            "name": "Dimiter D. Marinov",
            "image": "/lZwHZ27xqsPsuswcxyx6uWSh5VP.jpg",
            "birth_date": "1964-10-06",
            "biography": ""
        },
        {
            "id": 1211946,
            "name": "P.J. Byrne",
            "image": "/shniQxLvKNvANyJy3hLG8Oo7fW7.jpg",
            "birth_date": "1974-12-15",
            "biography": "Paul Jeffrey Byrne (born December 15, 1974) is an American film and television actor. He is best known for his roles as Nicky \"Rugrat\" Koskoff in the Martin Scorsese film The Wolf of Wall Street (2013) and Bolin on Nickelodeon's animated series The Legend of Korra (2012–2014)."
        },
        {
            "id": 1577,
            "name": "Richard Kelly",
            "image": "/l0rWmZW2tBBwjBedjzAH23eagZ3.jpg",
            "birth_date": "1975-03-28",
            "biography": "James Richard Kelly (born 1975) is an American writer-director, best known for his debut feature, the science-fiction cult classic \"Donnie Darko\"(2001).\n\nKelly was born in Newport News, Virginia, the son of Lane and Ennis Kelly. He won a scholarship to the University of Southern California to study at the USC School of Cinema-Television. He made two short films at USC, \"The Goodbye Place\" and \"Visceral Matter\", before graduating in 1997.\n\n\"Donnie Darko\" was his first feature and was nominated for 21 awards, winning 11 of them, including a nomination for a Saturn Award. The film later ended up #2 on Empire magazine's list of 50 greatest independent films of all time, behind Quentin Tarantino's \"Reservoir Dogs\".\n\nKelly wrote the screenplay for Tony Scott's biographical crime thriller \"Domino\" (2005), and went on to write and direct the postmodern L.A. satire \"Southland Tales\" (2006) and the science-fiction mystery \"The Box\" (2009), inspired by \"The Twilight Zone\" episode \"Button, Button\". Although his three films differ considerably in setting and characters, they share similar themes of time travel, existentialism, and spirituality.\n\nKelly's particular filmmaking sensibilities can be traced back to his viewing of Terry Giliam's \"Brazil\" (1985), as told to author Robert K. Elder in an interview for his book \"The Film That Changed My Life\" (2011).\n\nThe commercial underperformance of Kelly's films has made it difficult for him to secure financing for other projects, and as such he has not directed a film since 2009. In 2016, filmmaker Kevin Smith said of Kelly: \"He is insanely creative and is not unlike Christopher Nolan. But Nolan wound up in the Warner Bros. system where he got special handling, and he got a lot of money to make huge art films like \"Inception\". Richard can be one of our greatest filmmakers. He is right now, but just a lot of people don't realize it. He's still a kid, and someone needs to Nolan that kid.\""
        },
        {
            "id": 131,
            "name": "Jake Gyllenhaal",
            "image": "/btORQRDyGCF0KNweGGYpmQXZK3P.jpg",
            "birth_date": "1980-12-19",
            "biography": "Jacob Benjamin Gyllenhaal (born December 19, 1980) is an American actor and producer. Born into the Gyllenhaal family, he is the son of director Stephen Gyllenhaal and screenwriter Naomi Foner; his older sister is actress Maggie Gyllenhaal.\n\nHe began acting as a child, making his acting debut in City Slickers (1991), followed by roles in his father's films A Dangerous Woman (1993) and Homegrown (1998). His breakthrough roles were as Homer Hickam in October Sky (1999) and as a psychologically troubled teenager in Donnie Darko (2001).  In 2004, Gyllenhaal starred in the science fiction disaster film The Day After Tomorrow. In 2005, he played Jack Twist in Ang Lee's romantic drama Brokeback Mountain, for which Gyllenhaal won a BAFTA Award and was nominated for an Academy Award. His career progressed with starring roles in the thriller Zodiac (2007), the romantic comedy Love & Other Drugs (2010), and the science fiction film Source Code (2011). Further acclaim came with his roles in Denis Villeneuve's thrillers Prisoners (2013) and Enemy (2013), and he received nominations for the BAFTA Award for Best Actor in a Leading Role for his performances as a manipulative journalist in Nightcrawler (2014) and a troubled writer in Nocturnal Animals (2016).  His highest-grossing release came with the Marvel Cinematic Universe superhero film Spider-Man: Far From Home (2019), in which he portrayed Quentin Beck / Mysterio. Gyllenhaal has also performed on stage, starring in Broadway productions of the musical Sunday in the Park with George as well as the plays Constellations and Sea Wall/A Life, the lattermost of which earned him a Tony Award nomination. Aside from acting, he is vocal about political and social issues.  Description above from the Wikipedia article Jake Gyllenhaal, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 20089,
            "name": "Jena Malone",
            "image": "/1qmkanVCFr3ZaXcxSXVDO8andb0.jpg",
            "birth_date": "1984-11-21",
            "biography": "Jena Malone (born November 21, 1984) is an American actress, musician, and photographer. She made her film debut in Bastard Out of Carolina (1996) and has appeared in films including Ellen Foster (1997), Contact (1997), Stepmom (1998), For Love of the Game (1999), Donnie Darko (2001), Life as a House (2001), Saved! (2004), Pride & Prejudice (2005), Into the Wild (2007), The Ruins (2008), Sucker Punch (2011), The Hunger Games film series (2013–15), The Neon Demon (2016), Nocturnal Animals (2016), and Antebellum (2020).\n\nMalone is also an indie pop musician who has released music both under her own name (as \"Jena Malone and Her Bloodstains\") and as one-half of the duo The Shoe."
        },
        {
            "id": 1582,
            "name": "James Duval",
            "image": "/vvasxKKPnxv2qOoXTnaXW3ecGLO.jpg",
            "birth_date": "1972-09-10",
            "biography": "James \"Jimmy\" Edward Duval (born September 10, 1972) is an American actor, who is most famous for his roles in the Gregg Araki \"Teenage Apocalypse\" trilogy in addition to Frank in Donnie Darko, Miguel in Independence Day, and Singh in Go."
        },
        {
            "id": 69597,
            "name": "Drew Barrymore",
            "image": "/mVQdb6w6gXmLZ6nZ3K9Fw3vzawM.jpg",
            "birth_date": "1975-02-22",
            "biography": "Drew Blythe Barrymore (born February 22, 1975) is an American actress, director, producer, businesswoman, and talk show host who is the recipient of numerous accolades, including a Golden Globe and a Screen Actors Guild Award, as well as five Emmy Award nominations and a BAFTA nomination. She is a member of the Barrymore family of actors and the granddaughter of John Barrymore.\n\nBarrymore achieved fame as a child actress with her role in E.T. the Extra-Terrestrial. Following a highly publicized childhood marked by drug and alcohol abuse, she released an autobiography Little Girl Lost. She starred in a string of successful films during the 1990s and 2000s, including Charlie's Angels, Never Been Kissed, Poison Ivy, Boys on the Side, Mad Love, Batman Forever, Scream and Ever After. Barrymore starred with Adam Sandler in several films, including The Wedding Singer, 50 First Dates and Blended.\n\nHer other films include Firestarter, Donnie Darko, Riding in Cars with Boys, Confessions of a Dangerous Mind, Charlie's Angels: Full Throttle, Fever Pitch, Music and Lyrics, Going the Distance, Big Miracle and Miss You Already. She also starred in her directorial debut film Whip It. She won a SAG Award and a Golden Globe for her role in Grey Gardens. She starred in the Netflix series Santa Clarita Diet and currently hosts her syndicated talk show The Drew Barrymore Show.\n\nBarrymore is the founder of the production company Flower Films. It produced several projects in which she has starred. She launched a range of cosmetics under the Flower banner in 2013, which has grown to include lines in make-up, perfume and eyewear. Her other business ventures include a range of wines and a clothing line. E. P. Dutton published a collection of Barrymore's autobiographical essays in a book titled Wildflower in 2015. Barrymore received a star on the Hollywood Walk of Fame in 2004."
        },
        {
            "id": 5151,
            "name": "Beth Grant",
            "image": "/6THLoPYhIu422TqUmQDgnQRfYxA.jpg",
            "birth_date": "1949-09-18",
            "biography": "Beth Grant (born September 18, 1949) is an American actress. She is known for often playing characters who are conservatives, religious zealots or sticklers for rules.\n\nShe has appeared in dozens of films, including Rain Man, Speed; To Wong Foo, Thanks for Everything! Julie Newmar; Love Field; Donnie Darko; A Time to Kill; Little Miss Sunshine; Child's Play 2; Daltry Calhoun; City Slickers 2; Don't Tell Her It's Me; Matchstick Men; Factory Girl; The Wizard; Sordid Lives; The Rookie; All About Steve; No Country for Old Men, Crazy Heart, and Rango.\n\nGrant has also appeared in many TV shows, including Everwood; Delta; The Golden Girls; Malcolm in the Middle; The X-Files; Friends; CSI; Six Feet Under; Wonderfalls; My Name Is Earl; Yes, Dear; King of the Hill; The Office; Angel; Judging Amy; Jericho; Sordid Lives: The Series; Criminal Minds, Sabrina The Teenage Witch; True Blood; How I Met Your Mother; and The Mentalist.\n\nGrant was born in Gadsden, Alabama, and is an alumna of East Carolina University. She is married to actor Michael Chieffo with whom she has one child.\n\nGrant played the same character, Marianne Marie Beetle, in the short-lived show Wonderfalls and Pushing Daisies, both created by Bryan Fuller.\n\nDescription above from the Wikipedia article Beth Grant, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 1579,
            "name": "Maggie Gyllenhaal",
            "image": "/qxgM5LzzG4uWTprCL3gBVVJ2Q1K.jpg",
            "birth_date": "1977-11-16",
            "biography": "Margalit \"Maggie\" Ruth Gyllenhaal (born November 16, 1977) is an American actress and filmmaker. Part of the Gyllenhaal family, she is the daughter of filmmakers Stephen Gyllenhaal and Naomi Achs, and the older sister of actor Jake Gyllenhaal.\n\nGyllenhaal began her career as a teenager with small roles in several of her father's films, and appeared with her brother in the cult favorite Donnie Darko (2001). She then appeared in Adaptation, Confessions of a Dangerous Mind (both 2002), and Mona Lisa Smile (2003). Gyllenhaal received critical acclaim for her leading performances in the erotic romantic comedy drama Secretary (2002) and the drama Sherrybaby (2006), each of which earned her a Golden Globe Award nomination. After several commercially successful films in 2006, including World Trade Center, she received wider recognition for playing Rachel Dawes in the superhero film The Dark Knight (2008).\n\nFor her performance as a single mother in Crazy Heart (2009), she received a nomination for Academy Award for Best Supporting Actress. She subsequently starred in the comedies and dramas: Nanny McPhee and the Big Bang (2010), Hysteria (2011), and Won't Back Down (2012). Her other roles include a Secret Service agent in the action-thriller White House Down (2013), a musician in Frank (2014), and the title role in the drama The Kindergarten Teacher (2018). In 2021, Gyllenhaal made her writing and directing debut with the psychological drama The Lost Daughter, for which she won the Venice International Film Festival's Best Screenplay Award and was nominated for the Academy Award for Best Adapted Screenplay.\n\nGyllenhaal has also appeared in five stage productions since 2000, including making her Broadway debut in a revival of The Real Thing. She has starred in several television series, including the BBC political-thriller miniseries The Honourable Woman. For her performance, she won a Golden Globe award for Best Actress, and was nominated for a Primetime Emmy Award. She also produced and starred in the HBO period drama series The Deuce (2017–19). Gyllenhaal has been married to actor Peter Sarsgaard since 2009 and they have two children together."
        },
        {
            "id": 40684,
            "name": "David Leitch",
            "image": "/htO4qu7yMUfZzJR9DF9iXch8ina.jpg",
            "birth_date": "1975-11-16",
            "biography": "David Leitch (born November 16, 1975) is an American filmmaker, actor, stunt performer and stunt coordinator who made his directorial debut on the 2014 action film John Wick with Chad Stahelski, though only Stahelski was credited. Leitch then directed the 2017 thriller film Atomic Blonde, starring Charlize Theron, and 2018's Deadpool 2, the sequel to the 2016 film. In 2019, he directed Hobbs & Shaw, a spin-off of the Fast & Furious franchise."
        },
        {
            "id": 10859,
            "name": "Ryan Reynolds",
            "image": "/so89QyuxAZY8IOpNTweCekhxsvO.jpg",
            "birth_date": "1976-10-23",
            "biography": "Ryan Rodney Reynolds (born October 23, 1976) is a Canadian actor and film producer. He began his career starring in the Canadian teen soap opera Hillside (1991–1993), and had minor roles before landing the lead role on the sitcom Two Guys and a Girl between 1998 and 2001. Reynolds then starred in a range of films, including comedies such as National Lampoon's Van Wilder (2002), Waiting... (2005), and The Proposal (2009). He also performed in dramatic roles in Buried (2010), Woman in Gold (2015), and Life (2017), starred in action films such as Blade: Trinity (2004), Green Lantern (2011), 6 Underground (2019) and Free Guy (2021), and provided voice acting in the animated features The Croods (2013), Turbo (2013), Pokémon: Detective Pikachu (2019) and The Croods: A New Age (2020).\n\nReynolds' biggest commercial success came with the superhero films Deadpool (2016) and Deadpool 2 (2018), in which he played the title character. The former set numerous records at the time of its release for an R-rated comedy and his performance earned him nominations at the Critics' Choice Movie Awards and the Golden Globe Awards."
        },
        {
            "id": 16851,
            "name": "Josh Brolin",
            "image": "/sX2etBbIkxRaCsATyw5ZpOVMPTD.jpg",
            "birth_date": "1968-02-12",
            "biography": "Josh James Brolin (born February 12, 1968) is an American actor. A son of actor James Brolin, he gained fame in his youth for his role in the adventure film The Goonies (1985). After years of decline, Brolin had a resurgence with his starring role in the crime film No Country for Old Men (2007). Brolin received a nomination for the Academy Award for Best Supporting Actor for portraying Dan White in the biopic Milk (2008).\n\nBrolin gained wider recognition for playing Thanos in the Marvel Cinematic Universe, including in the films Avengers: Infinity War (2018) and Avengers: Endgame (2019), as well as Cable in Deadpool 2 (2018). His other notable films include W. (2008), True Grit (2010), Wall Street: Money Never Sleeps (2010), Men in Black 3 (2012), Oldboy (2013), Inherent Vice (2014), Everest (2015), Sicario (2015), Hail, Caesar! (2016), Only the Brave (2017), Dune (2021), and Dune: Part Two (2024).\n\nDescription above from the Wikipedia article Josh Brolin, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 54882,
            "name": "Morena Baccarin",
            "image": "/kBSKKaOtsqIzZPhtEeHfCBmhWl9.jpg",
            "birth_date": "1979-06-02",
            "biography": "Morena Baccarin (born June 2, 1979) is a Brazilian-born American actress most widely known for roles in several American science fiction television shows: as Inara Serra in the series Firefly; as Adria in the series Stargate SG-1; and as Anna in the 2009 version of the series V.\n\nBaccarin was born in Rio de Janeiro, Brazil. Her mother is Brazilian stage and TV actress Vera Setta, and her father is Italian journalist Fernando Baccarin. When she was 7, Baccarin moved with her family to Greenwich Village, New York, as her father was transferred to Globo TV's headquarters in the United States, working as editor. Baccarin attended Public School 41 and New York City Lab School for Collaborative Studies, where she and Claire Danes were classmates. She later attended the Fiorello H. LaGuardia High School of Music & Art and Performing Arts before she entered the theater program at Juilliard. Baccarin landed her first movie role in the improvised fashion world comedy Perfume (2001)."
        },
        {
            "id": 1139349,
            "name": "Julian Dennison",
            "image": "/jp1phhrj8lT4NWQpztqi0FmM94i.jpg",
            "birth_date": "2002-10-26",
            "biography": "Julian Dennison is a film child actor from New Zealand, best known for his roles as Ricky Baker in Hunt for the Wilderpeople, the highest-grossing New Zealand film in history, and as Russell Collins a.k.a. \"Firefist\" in Deadpool 2."
        },
        {
            "id": 1545693,
            "name": "Zazie Beetz",
            "image": "/sgxzT54GnvgeMnOZgpQQx9csAdd.jpg",
            "birth_date": "1991-06-01",
            "biography": "Zazie Olivia Beetz (born June 1, 1991) is a German-American actress. She stars in the FX comedy-drama series Atlanta (2016–2022), for which she received a nomination for the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series. She also appeared in the Netflix anthology series Easy (2016–19) and voices Amber Bennett in Amazon's animated superhero action series Invincible.\n\nIn film, Beetz has appeared in the disaster film Geostorm (2017) and has played the Marvel Comics character Domino in the superhero film Deadpool 2 (2018) and Arthur Fleck/Joker's neighbor Sophie in the psychological thriller Joker (2019)."
        },
        {
            "id": 51990,
            "name": "T.J. Miller",
            "image": "/rRrVvBxOkyYM5XdLXimShHR1Itn.jpg",
            "birth_date": "1981-06-04",
            "biography": "Todd Joseph \"T.J.\" Miller (born June 4, 1981) is an American actor and stand-up comedian.\n\nAfter college, Miller moved to Chicago and began to perform improv and stand-up comedy. He toured with The Second City for two years. In 2008, he was named one of Variety's \"10 Comics To Watch.\"\n\nHe portrayed Marmaduke Brooker in Carpoolers on ABC (2007–2008).\n\nIn 2008, he made his film acting debut in Cloverfield in which he only appeared onscreen for a few minutes, but his voice was heard in almost every scene as the person who videotaped most of the events depicted. In 2009, he played Cessna Jim in The Goods: Live Hard, Sell Hard and the grindcore musician Rory in Mike Judge's comedy Extract. In 2010, he co-starred in She's Out of My League as Stainer, played Brian the Concierge in Get Him to the Greek and had a supporting role in Unstoppable. From 2010 to 2014, he voiced Tuffnut Thorston in the first three How to Train Your Dragon films.\n\nIn 2010, he played Ranger Jones in the live-action animated film Yogi Bear, and he also played Dan in Gulliver's Travels. In 2011, he appeared in the film Our Idiot Brother and, in 2012, he had a cameo as administrative personnel for Rolling Stone in the musical film Rock of Ages.\n\nOn 12/13/2010, 10/28/2011, and 6/14/2012, he performed stand-up on Conan. On November 15, 2011, his stand-up special No Real Reason premiered on Comedy Central. In 2011, he hosted a special called Mash Up, which was picked up in 2012 for a full season by Comedy Central. He also appeared frequently as a member of the \"round table\" on Chelsea Lately.\n\nIn 2012, he voiced Robbie Valentino on the Disney channel cartoon Gravity Falls. He also voiced Gorburger, a giant blue monster talk show host, on The Gorburger Show, which originally aired on Funny or Die and YouTube for 2 seasons in 2012–13, then on Comedy Central for a 3rd season in 2017.  In 2013, he co-starred in the Fox TV series The Goodwin Games as Jimmy Goodwin. In 2014, he was in Transformers: Age of Extinction and he voiced the character of Fred in the superhero CGI film Big Hero 6. He voiced Augie in the 2015 animated film Hell and Back. In 2015, he was part of Funny or Die's Oddball Comedy and Curiosity Festival, a touring show which included Amy Schumer, Aziz Ansari, and other comics.\n\nFrom 2014 to 2017, he starred as Erlich Bachman in the HBO sitcom Silicon Valley for which he won the Critics' Choice Television Award for Best Supporting Actor in a Comedy Series in 2015. In 2016, he starred in the movie Search Party with Adam Pally and the movie Office Christmas Party.\n\nOn June 17, 2017, HBO premiered his hour-long stand-up special, T.J. Miller: Meticulously Ridiculous, which was filmed in Miller's native Denver at the end of his 2016 Meticulously Ridiculous Tour. In October 2017, Miller began his \"Touring In Perpetuity Tour\", a self described \"One Man Philosophy Circus.\"\n\nIn 2018, he played the role of I-R0K in the film Ready Player One, directed by Steven Spielberg. As a commercial actor, he voiced a talking ball of mucus in commercials for Mucinex and starred as Greg the Genie in a promo campaign for Slim Jim meat snacks.\n\nHe hosted a podcast with friend and fellow comedian Cash Levy, titled Cashing in With TJ Miller, which began airing in March 2012 on the Nerdist Network. He is also a frequent guest on Doug Benson's podcast Doug Loves Movies."
        },
        {
            "id": 11614,
            "name": "M. Night Shyamalan",
            "image": "/tOhFWjauKvJgjCVLJFnhbBCZuxZ.jpg",
            "birth_date": "1970-08-06",
            "biography": "Manoj Nelliyattu \"M. Night\" Shyamalan, born August 6, 1970, is an American filmmaker and actor. He is known for making original films with contemporary supernatural plots and twist endings. He was born in Mahé, India, and raised in Penn Valley, Pennsylvania. The cumulative gross of his films exceeds $3 billion globally.\n\nHe made his directorial debut in 1992 with his first movie Praying with Anger. His second movie was the comedy-drama film Wide Awake (1998). His most well-received films include the supernatural thriller The Sixth Sense (1999), the superhero thriller Unbreakable (2000), and the science fiction thriller Signs (2002). For The Sixth Sense, Shyamalan received nominations for the Academy Award for Best Director and the Academy Award for Best Original Screenplay. Afterward, Shyamalan released a series of poorly received but sometimes financially successful movies, including the period-piece thriller The Village (2004), the dark fantasy Lady in the Water (2006), the eco-thriller The Happening (2008), The Last Airbender (2010) (an adaptation based on the first season of the Nickelodeon animated television series Avatar: The Last Airbender), and the science fiction film After Earth (2013). Following the financial failure of After Earth, Shyamalan's career was revived with the release of the found-footage horror film The Visit (2015), the psychological thriller Split (2016), and the superhero thriller Glass (2019). With a total budget of $34 million between them, these three films earned a combined box office of $625 million. Glass is the third and final chapter of his Unbreakable film series, which commenced in 2000.\n\nIn addition to his directorial work, Shyamalan was a story creator and a producer for the horror film Devil (2010). Shyamalan was also called in for an uncredited rewrite for the teen film She's All That (1999) and also served as a writer for the film Stuart Little (1999). He is also one of the executive producers and occasional director of Wayward Pines and the critically acclaimed series Servant.\n\nShyamalan is also known for filming and setting his films in and around Philadelphia, Pennsylvania. Most of his commercially successful films were co-produced and released by Walt Disney Studios' Touchstone and Hollywood Pictures and Universal imprints. In 2008, Shyamalan was awarded the Padma Shri by the government of India."
        },
        {
            "id": 5530,
            "name": "James McAvoy",
            "image": "/vB6qYlFXgONGVwwxWXE4gf0F8SQ.jpg",
            "birth_date": "1979-04-21",
            "biography": "James McAvoy (born 21 April 1979) is a Scottish actor. He made his acting debut as a teen in The Near Room (1995) and appeared mostly on television until 2003, when his feature film career began. His notable television work includes the thriller State of Play, science fiction miniseries Frank Herbert's Children of Dune and the channel 4s BAFTA award-winning series Shameless (British TV series)\n\nHe has performed in several West End productions and has received four nominations for the Laurence Olivier Award for Best Actor, and has also done voice work for animated films including Gnomeo & Juliet, its sequel Sherlock Gnomes, and Arthur Christmas.\n\nIn 2003, McAvoy appeared in a lead role in Bollywood Queen, then in another lead role as Rory in Inside I'm Dancing in 2004. This was followed by a supporting role, as the faun Mr. Tumnus, in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005). His performance in Kevin Macdonald's drama The Last King of Scotland (2006) garnered him several award nominations, including the BAFTA Award for Best Supporting Actor. The critically acclaimed romantic drama war film Atonement (2007) earned him a Golden Globe Award nomination and his second BAFTA nomination. He later appeared as a newly trained assassin in the action thriller Wanted (2008).\n\nIn 2011, McAvoy portrayed Professor Charles Xavier in the superhero film X-Men: First Class, a role he reprised in X-Men: Days of Future Past (2014), X-Men: Apocalypse (2016), Deadpool 2 (2018), and Dark Phoenix (2019). McAvoy starred in the crime comedy-drama film Filth (2013), for which he won Best Actor in the British Independent Film Awards. In 2016, he portrayed Kevin Wendell Crumb, a man with 23 alternate personalities, in M. Night Shyamalan's Split, for which he received critical acclaim, and later reprised the role for the sequel Glass (2019). Since 2019, he has portrayed Lord Asriel Belacqua in the BBC/HBO fantasy series His Dark Materials."
        },
        {
            "id": 1397778,
            "name": "Anya Taylor-Joy",
            "image": "/qYNofOjlRke2MlJVihmJmEdQI4v.jpg",
            "birth_date": "1996-04-16",
            "biography": "Anya-Josephine Marie Taylor-Joy (born 16 April 1996) is a British-American actress and model. She left school at age sixteen and began to pursue an acting career. After small television roles, she made her film debut with the lead role of Thomasin in the horror film The Witch (2015). She went on to star in the horror film Split and the black comedy Thoroughbreds (both 2017). She also appeared in the drama miniseries The Miniaturist (2017), the fifth and sixth series of Peaky Blinders (2019–2022) and The Dark Crystal: Age of Resistance (2019), and the superhero film Glass (2019), reprising her role from Split. Taylor-Joy will voice Princess Peach in the upcoming Mario film (2022) and portray the title character in Furiosa (2024)."
        },
        {
            "id": 52462,
            "name": "Betty Buckley",
            "image": "/szxY6tMCiSnKqH5bQg49ZcdukIM.jpg",
            "birth_date": "1947-07-03",
            "biography": "Betty Lynn Buckley is a Tony-winning American actress and singer who has worked extensively in film, television and theatre. She possesses a singing of voice of great power and beauty and has achieved great success in cabaret and concerts. Betty has also sustained a successful recording career with numerous cast albums and 18 solo albums to her credit, for which she has been nominated for two Grammys.\n\nBuckley is widely known for the 1977–81 TV series Eight Is Enough. She joined the show in its second season when the original star, Diana Hyland, died after the first four episodes of season one, and her character Joan Bradford died as well. Buckley was cast as the central character's new romantic interest, Sandra Sue \"Abby\" Abbott, who became stepmother of the eight children to which the series' title refers.  Betty later received two Daytime Emmy Award nominations for Outstanding Performer in a Children's Program/Special, for NBC Special Treat - Bobby and Sarah (1984) and ABC Afterschool Special - Taking a Stand (1989).\n\nFrom 2001 to 2003, Betty Buckley played a role in seasons 4–6 of the HBO series Oz. She also has guest-starred in a number of television series, including Without a Trace, Law & Order: Special Victims Unit, and Monk. Betty also guest-starred in a Christmas special of the TV series Remember WENN, in which she sang \"You Make It Christmas\".\n\nOn film, Buckley appeared in the original movie version of Carrie in 1976, playing Miss Collins, Carrie's gym teacher. She went on to appear as Margaret White in the notorious 1987 musical adaptation of the film on Broadway; an expensive and creatively disastrous flop in which she nevertheless scored a personal triumph.  In 1977, she recorded an uncredited solo on the song \"Walking in Space\", in the movie Hair.\n\nHer screen roles during the 1980s include Bruce Beresford's film Tender Mercies, where she played a country music singer and sang the Academy Award-nominated song \"Over You\". She also appeared in the Woody Allen film Another Woman (1988), Roman Polanski's Frantic (1988) and Lawrence's Kasden's Wyatt Earp (1994). In 2008, Buckley played Mrs. Jones in M. Night Shyamalan's The Happening. In 2017, Buckley was one of the stars of M. Night Shyamalan's Split, a major success which was the number-one film at the box office for three weeks running.\n\nBuckley has worked regularly in the theatre throughout her career. In 1969, she made her Broadway debut as Martha Washington in the original company of Tony winner 1776; a role she famously won on her first day in New York. That same year, she made her West End debut in the original London cast of Promises, Promises.\n\nIn 1982, Buckley starred as Grizabella in the original Broadway production of the musical Cats, which features the song \"Memory\".  For this role, she won the Tony Award for Best Featured Actress in a Musical. In 1985 she played the titular character in another Tony winning musical The Mystery of Edwin Drood. This was the third time Buckley had originated a role in a show that went on to win the Tony for Best Musical.  Buckley starred in both London (1994) and New York (1995) as Norma Desmond in the musical Sunset Boulevard. For her role in the London production, she received an Olivier Award nomination for Best Actress in a Musical."
        },
        {
            "id": 1286328,
            "name": "Haley Lu Richardson",
            "image": "/3jWAFINe8W4KoHInnwxrPAsVc4Q.jpg",
            "birth_date": "1995-03-07",
            "biography": "Haley Lu Richardson (born March 7, 1995) is an American actress. Following early television roles on the Disney Channel sitcom Shake It Up (2013) and the ABC Family supernatural drama Ravenswood (2013–2014), she received recognition for her roles in the critically acclaimed coming-of-age film The Edge of Seventeen (2016) and the psychological horror film Split (2016). She went on to garner a nomination for the Gotham Independent Film Award for Best Actress for her breakthrough role in Columbus (2017), and earned critical praise for her roles as Maci in Support the Girls (2018) and Stella Grant in Five Feet Apart (2019)."
        },
        {
            "id": 1221085,
            "name": "Jessica Sula",
            "image": "/2lLET7EhRy98ad5Mgc9jMk4Sb0S.jpg",
            "birth_date": "1994-05-03",
            "biography": "Jessica Bianca Sula (born May 3, 1994 in Gorseinon, Wales, UK) is a Welsh actress best known for playing the character Grace Blood in the third generation of the British television series Skins."
        },
        {
            "id": 1657685,
            "name": "Izzie Coffey",
            "image": "/firnTXo8waxrkGYb642mLuoMGy6.jpg",
            "birth_date": null,
            "biography": ""
        },
        {
            "id": 2127,
            "name": "James Wan",
            "image": "/bNJccMIKzCtYnndcOKniSKCzo5Y.jpg",
            "birth_date": "1977-02-26",
            "biography": "James Wan (born 26 February 1977) is a Malaysia-born Australian film director, screenwriter, producer, and comic book writer. He has primarily worked in the horror genre as the co-creator of the \"Saw\" and \"Insidious\" franchises and the creator of \"The Conjuring\" universe. Wan is also the founder of Atomic Monster, which has produced film and television projects.\n\nAfter directing the micro-budget film \"Stygian\" (2000), Wan made his professional feature directorial debut with \"Saw\" (2004). The film was a hit and launched a franchise that has grossed more than $1 billion globally. Following a period of setbacks with the underperforming titles \"Dead Silence\" and \"Death Sentence\" (both 2007), Wan returned to commercial success with the PG-13 supernatural horror-fantasy \"Insidious\" (2010), and went on to direct \"Insidious: Part 2\" (2013) and to produce further sequels in the series. In between his two \"Insidious\" projects, Wan directed the more traditional supernatural horror film \"The Conjuring\" (2013), which achieved enormous critical and commercial success and spawned a sprawling set of sequels and spin-offs collectively known as The Conjuring Universe. Wan served as the director of \"The Conjuring 2\" (2016) while producing subsequent films in the franchise such as \"Annabelle\" (2014) and \"The Nun\" (2018). The Conjuring Universe is the second highest-grossing horror franchise at over $2 billion.\n\nOutside of horror, Wan directed \"Furious 7\" (2015), the seventh installment in the \"Fast & Furious\" franchise, and the DC Extended Universe superhero film \"Aquaman\" (2018). Both grossed over $1 billion, making Wan the eighth director with two films to reach the milestone. He is the 20th highest-grossing director of all time as of 2021, with his films having grossed over $3.6 billion worldwide."
        },
        {
            "id": 117642,
            "name": "Jason Momoa",
            "image": "/6dEFBpZH8C8OijsynkSajQT99Pb.jpg",
            "birth_date": "1979-08-01",
            "biography": "Joseph Jason Namakaeha Momoa (born August 1, 1979) is an American actor and filmmaker. He made his acting debut as Jason Ioane on the syndicated action drama series Baywatch: Hawaii (1999–2001), which was followed by his portrayal of Ronon Dex on the Syfy science fiction series Stargate Atlantis (2005–2009), Khal Drogo in the first two seasons of the HBO fantasy drama series Game of Thrones (2011–2012), Declan Harp on the Discovery Channel historical drama series Frontier (2016–2018), and Baba Voss on the Apple TV+ science fiction series See (2019–present). Momoa was featured as the lead of the two lattermost series.\n\nSince 2016, Momoa portrays Arthur Curry / Aquaman in the DC Extended Universe (DCEU), headlining the eponymous 2018 film and its 2023 sequel. Momoa also played Duncan Idaho in the 2021 film adaptation of the science fiction novel Dune.\n\nDescription above from the Wikipedia article Jason Momoa, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 55085,
            "name": "Amber Heard",
            "image": "/Ah08MAZFDM9LecmHxkmy64eKuzJ.jpg",
            "birth_date": "1986-04-22",
            "biography": "Amber Laura Heard (born April 22, 1986) is an American film and television actress. After a series of small roles in film and television, Heard had her first starring role in the horror film All the Boys Love Mandy Lane (2006). She first gained mainstream recognition for supporting roles in the action film Never Back Down (2008) and the comedy Pineapple Express (2008). In the following years, she appeared in films such as The Joneses (2009), The Ward (2010), The Rum Diary (2011), Drive Angry (2011), Machete Kills (2013) and Magic Mike XXL (2015).\n\nIn 2017, Heard joined the DC Extended Universe to play Atlantean queen Mera in superhero films Justice League (2017), Aquaman (2018), and Zack Snyder's Justice League (2021). In addition to acting, Heard has been a global spokesperson for the cosmetics giant L'Oréal Paris since 2018. She also engages in human rights activism."
        },
        {
            "id": 5293,
            "name": "Willem Dafoe",
            "image": "/ui8e4sgZAwMPi3hzEO53jyBJF9B.jpg",
            "birth_date": "1955-07-22",
            "biography": "William James \"Willem\" Dafoe (born July 22, 1955) is an American actor. He is the recipient of various accolades, including the Volpi Cup for Best Actor, in addition to receiving nominations for four Academy Awards, four Screen Actors Guild Awards, three Golden Globe Awards, and a British Academy Film Award. He frequently collaborates with filmmakers Paul Schrader, Abel Ferrara, Lars von Trier, Julian Schnabel,  Wes Anderson, and Robert Eggers.\n\nDafoe was an early member of experimental theater company The Wooster Group. He made his film debut in Heaven's Gate (1980), but was fired during production. He had his first leading role in the outlaw biker film The Loveless (1982) and then played the main antagonist in Streets of Fire (1984) and To Live and Die in L.A. (1985). He received his first Academy Award nomination (as Best Supporting Actor) for his role as Sergeant Elias Grodin in Oliver Stone's war film Platoon (1986). In 1988, Dafoe played Jesus in Martin Scorsese's The Last Temptation of Christ and costarred in Mississippi Burning, both of which were controversial.\n\nAfter receiving his second Academy Award nomination (as Best Supporting Actor) for portraying Max Schreck in Shadow of the Vampire (2000), Dafoe portrayed the supervillain Norman Osborn / Green Goblin in the superhero film Spider-Man (2002), a role he reprised in its sequels Spider-Man 2 (2004) and Spider-Man 3 (2007), and the Marvel Cinematic Universe film Spider-Man: No Way Home (2021) earning him the Guinness World Record for the \"longest career as a live-action Marvel character\". He also portrayed the villains in Once Upon a Time in Mexico (2003) and XXX: State of the Union (2005), as well as Carson Clay in the film Mr. Bean's Holiday (2007). In 2009, he starred in the experimental film Antichrist, one of his three films with Lars von Trier. Dafoe then appeared in The Fault in Our Stars, John Wick, The Grand Budapest Hotel (all 2014), The Great Wall (2016), Murder on the Orient Express (2017), The Florida Project (2017) (for which he received his third Academy Award nomination in the Best Supporting Actor category), The Lighthouse (2019), The French Dispatch, and Nightmare Alley (both 2021). He portrayed Nuidis Vulko in the DC Extended Universe films Aquaman (2018), Zack Snyder's Justice League (2021) and Aquaman and the Lost Kingdom (2022).\n\nDafoe has portrayed several real-life figures, including T. S. Eliot in Tom & Viv (1994), Pier Paolo Pasolini in Pasolini (2014), Vincent van Gogh in At Eternity's Gate (2018) (for which he received an Academy Award for Best Actor nomination, his first in that category), and Leonhard Seppala in Togo (2019)."
        },
        {
            "id": 17178,
            "name": "Patrick Wilson",
            "image": "/tc1ezEfIY8BhCy85svOUDtpBFPt.jpg",
            "birth_date": "1973-07-03",
            "biography": "Patrick Joseph Wilson (born July 3, 1973) is an American actor, director, and singer. He began his career in 1995, starring in Broadway musicals. He is a two-time Tony Award nominee for his roles in The Full Monty (2000–2001) and Oklahoma! (2002). He co-starred in the acclaimed HBO miniseries Angels in America (2003), for which he was nominated for both the Golden Globe Award and Primetime Emmy Award for Outstanding Supporting Actor in a Miniseries or a Movie.\n\nWilson has also appeared in films such as The Phantom of the Opera (2004), Hard Candy (2005), Little Children (2006), Watchmen (2009), Insidious (2010), The A-Team (2010), Insidious: Chapter 2 (2013), and as demonologist Ed Warren in the Conjuring Universe (2013–present). He has earned a reputation as a \"scream king\" due to his frequent casting in horror films.\n\nOn television, Wilson starred in the CBS drama series A Gifted Man (2011–2012) and as Lou Solverson in the second season of FX's anthology series Fargo (2015), for which he received a second Golden Globe Award nomination. In the DC Extended Universe, he portrayed Orm Marius / Ocean Master in the superhero film Aquaman (2018) and voiced the U.S. President in Batman v Superman: Dawn of Justice (2016).\n\nDescription above from the Wikipedia article Patrick Wilson (American actor), licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 2227,
            "name": "Nicole Kidman",
            "image": "/5Yn5GAxJavlxW05nPwvYFvRnwQ7.jpg",
            "birth_date": "1967-06-20",
            "biography": "Nicole Mary Kidman AC (born June 20, 1967) is an American-Australian actress and producer. Known for her work across various film and television productions from several genres, she has consistently ranked among the world's highest-paid actresses. She is the recipient of numerous accolades, including an Academy Award, a British Academy Film Award, two Primetime Emmy Awards and six Golden Globe Awards.\n\nKidman began her acting career in Australia with the 1983 films Bush Christmas and BMX Bandits. Her breakthrough came in 1989 with the thriller film Dead Calm and the miniseries Bangkok Hilton. In 1990, she achieved international success with the action film Days of Thunder. She received greater recognition with lead roles in Far and Away (1992), Batman Forever (1995), To Die For (1995) and Eyes Wide Shut (1999). For her portrayal of writer Virginia Woolf in the drama The Hours (2002), Kidman won the Academy Award for Best Actress. She received additional Academy Award nominations for her roles in the musical Moulin Rouge! (2001) and the dramas Rabbit Hole (2010), Lion (2016) and Being the Ricardos (2021).\n\nKidman's television roles include Hemingway & Gellhorn (2012), Big Little Lies (2017–2019), Top of the Lake: China Girl (2017), The Undoing (2020) and Nine Perfect Strangers (2021). For Big Little Lies, she received two Primetime Emmy Awards, one for Outstanding Lead Actress and the other for Outstanding Limited Series as an executive producer.\n\nKidman has served as a Goodwill Ambassador for UNICEF since 1994 and for UNIFEM since 2006. In 2006, she was appointed Companion of the Order of Australia. She was married to actor Tom Cruise from 1990 to 2001 and has been married to country music singer Keith Urban since 2006. In 2010, she founded the production company Blossom Films. In 2004 and 2018, Time magazine included her on its list of the 100 most influential people in the world, and in 2020, The New York Times named her one of the greatest actors of the 21st century.\n\nDescription above from the Wikipedia article Nicole Kidman, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 16644,
            "name": "Dolph Lundgren",
            "image": "/3MqLWHnFFNGLEOQFlGrIE3rra85.jpg",
            "birth_date": "1957-11-03",
            "biography": "Hans Lundgren (born 3 November 1957), better known as Dolph Lundgren, is a Swedish actor, filmmaker, and martial artist. Lundgren's breakthrough came in 1985, when he starred in Rocky IV as the imposing Soviet boxer Ivan Drago. Since then, he has starred in more than 69 films, almost all of them in the action genre.\n\nLundgren received a degree in chemical engineering from the Royal Institute of Technology in the early 1980s and a master's degree in chemical engineering from the University of Sydney in 1982. He holds the rank of 4th dan black belt in Kyokushin karate and was European champion in 1980–81. While in Sydney, he became a bodyguard for Jamaican singer Grace Jones and began a relationship with her. He received a Fulbright scholarship to MIT and moved to Boston. Jones convinced him to leave the university and move to New York City to be with her and begin acting, where, after a short stint as a model and bouncer at the Manhattan nightclub The Limelight, Lundgren got a small debut role as a KGB henchman in the James Bond film A View to a Kill.\n\nAfter appearing in Rocky IV, Lundgren portrayed He-Man in the 1987 science fantasy film Masters of the Universe, Lt. Rachenko in Red Scorpion (1988) and Frank Castle in the 1989 film The Punisher. Throughout the 1990s he appeared in films such as I Come in Peace (1990), Cover Up (1991), Showdown in Little Tokyo (1991), Universal Soldier film series (1992, 2009, 2012), Joshua Tree (1993), Pentathlon (1994), Men of War (1994), Johnny Mnemonic (1995), The Shooter (1995), Silent Trigger (1996), The Peacekeeper (1997), and Blackjack (1998). In 2004 he directed his first film, The Defender, and subsequently directed The Mechanik (2005), Missionary Man (2007), Command Performance (2009), and Icarus (2010), also starring in all of them.\n\nAfter a long spell performing in direct-to-video films since 1995, Lundgren returned to Hollywood in 2010 with the role of Gunnar Jensen in The Expendables, alongside Sylvester Stallone and an all-action star cast. He reprised his role in The Expendables 2 (2012) and The Expendables 3 (2014). Also in 2014, he co-starred in Skin Trade, an action thriller about human trafficking he co-wrote and produced. He reprised his role of Ivan Drago in Creed II (2018), and is due to reprise his role as Gunner Jensen in The Expendables 4. He appears in Sharknado 5: Global Swarming (2017), playing the protagonist's son Gil as an adult, and in Aquaman (2018), playing the father of Mera. He also had a recurring role in the fifth season of Arrow."
        },
        {
            "id": 64141,
            "name": "David Gordon Green",
            "image": "/fJqIVaVwLeFBlZKQTDbzbcvV4XZ.jpg",
            "birth_date": "1975-04-09",
            "biography": "David Gordon Green is an American filmmaker. He has directed dramas such as George Washington, All the Real Girls, and Snow Angels, as well as the thriller Undertow, all of which he wrote or co-wrote. In 2008, he transitioned into comedy, directing the films Pineapple Express, Your Highness, and The Sitter, as well as episodes of the HBO comedy Eastbound & Down. In 2013, he returned to his more dramatic roots with the independent films Prince Avalanche and Joe. Since then, he has directed the films Manglehorn, Our Brand Is Crisis, Stronger, and episodes of the television comedy-drama Red Oaks, on which he also serves as executive producer. Green directed the eleventh installment in the Halloween franchise, which he co-wrote with frequent collaborator Danny McBride."
        },
        {
            "id": 8944,
            "name": "Jamie Lee Curtis",
            "image": "/9KWvPVeiLOXlOGl0XVyHZtJWQtx.jpg",
            "birth_date": "1958-11-22",
            "biography": "Jamie Lee Curtis (born November 22, 1958) is an American actress, producer, and children's author. Known for her performances in the horror and slasher genres, she is regarded as a scream queen, in addition to roles in comedies. Curtis has received multiple accolades, including an Academy Award, a BAFTA, two Golden Globes, and two Screen Actors Guild Awards, as well as nominations for an Emmy and a Grammy.\n\nCurtis came to prominence with the ABC sitcom Operation Petticoat (1977–1978). She made her feature film debut playing Laurie Strode in John Carpenter's slasher film Halloween (1978), which established her as a scream queen and led to a string of parts in horror films such as The Fog, Prom Night, Terror Train (all 1980), and Roadgames (1981). She reprised the role of Laurie in the Halloween franchise, until 2022.\n\nCurtis's film work spans many genres outside of horror, including the comedies Trading Places (1983), for which she won a BAFTA for Best Supporting Actress, and A Fish Called Wanda (1988), for which she received a nomination for the BAFTA for Best Actress. Her role as a workout instructor in the film Perfect (1985) earned her a reputation as a sex symbol. She won a Golden Globe Award for her portrayal of Helen Tasker in James Cameron's True Lies (1994). Her other notable film credits include Freaky Friday (2003) and Knives Out (2019). Her performance in Everything Everywhere All at Once (2022) won her the Academy Award for Best Supporting Actress. She received a star on the Hollywood Walk of Fame in 1998. As of 2021, her films have grossed over $2.3 billion at the box office.\n\nCurtis received a Golden Globe and a People's Choice Award for her portrayal of Hannah Miller on ABC's Anything But Love (1989–1992), and earned a Primetime Emmy nomination for the television film Nicholas' Gift (1998). She also starred as Cathy Munsch on the Fox series Scream Queens (2015–16), for which she received her seventh Golden Globe nomination. Curtis has written numerous children's books, including Today I Feel Silly, and Other Moods That Make My Day (1998), which made The New York Times's best-seller list. Curtis is a daughter of actors Janet Leigh and Tony Curtis. She is married to British-American filmmaker Christopher Guest, with whom she has two adopted children.\n\nHer marriage to Guest, who holds the British title of 5th Baron Haden-Guest, makes her a baroness who is entitled to use the name \"The Right Honourable The Lady Haden-Guest\", though she opts not to use it."
        },
        {
            "id": 20750,
            "name": "Judy Greer",
            "image": "/qiwvGgbbgwiE8gA4oBQpFnTNzl2.jpg",
            "birth_date": "1975-07-20",
            "biography": "Judith Therese Evans (born July 20, 1975), known professionally as Judy Greer, is an American actress. She is primarily known as a character actress, who has appeared in a wide variety of films. She first rose to prominence in the late 1990s to early 2000s, appearing in the films Jawbreaker (1999), What Women Want (2000), 13 Going on 30 (2004), 27 Dresses (2008), and Love & Other Drugs (2010). Greer also expanded into other genres, with roles in such films as Adaptation (2002), The Village (2004), The Descendants (2011), Carrie (2013), Dawn of the Planet of the Apes (2014), Jurassic World (2015), Ant-Man (2015), War for the Planet of the Apes (2017), Ant-Man and the Wasp (2018), Halloween (2018), and Halloween Kills (2021). She made her directorial debut with the comedy-drama film A Happening of Monumental Proportions (2017). On television, Greer is best known for her starring voice role as Cheryl Tunt in the FXX animated comedy series Archer (2009–present). She also had roles in the comedy series The Big Bang Theory (2007–2019), Arrested Development (2003–2006, 2013-2019), Two and a Half Men (2003–2015), Married (2014–2015), and Kidding (2018–2020).\n\nDescription above from the Wikipedia article Judy Greer, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 1511997,
            "name": "Andi Matichak",
            "image": "/8XGIcVo5flyPKIbaEQiw8cMXgBj.jpg",
            "birth_date": "1994-05-03",
            "biography": "Andi Matichak is an American actress. She has appeared in such television series as 666 Park Avenue, Orange Is the New Black and Blue Bloods. She stars as Allyson Nelson in the horror film Halloween, a direct sequel to the 1978 original film of the same name."
        },
        {
            "id": 883,
            "name": "Will Patton",
            "image": "/2vr8aJacajXz7m4lMc2WdVniCRZ.jpg",
            "birth_date": "1954-06-14",
            "biography": "William Rankin Patton (born June 14, 1954) is an American actor and audiobook narrator. He starred as Colonel Dan Weaver in the TNT science fiction series Falling Skies. He also appeared in the films Remember the Titans, Armageddon, Gone in 60 Seconds and The Punisher. He appeared opposite Kevin Costner in two films: No Way Out (1987) and The Postman (1997). He won two Obie Awards for best actor in Sam Shepard's play Fool for Love and the Public Theater production of What Did He See?."
        },
        {
            "id": 1279279,
            "name": "Virginia Gardner",
            "image": "/ltAmh88GkDs2E4tXErFhFAPmv9X.jpg",
            "birth_date": "1995-04-18",
            "biography": "Virginia Gardner (born April 18, 1995) is an American actress from Sacramento, California. She is best known for playing Christina Raskin in the found footage film Project Almanac and Karolina Dean in the web television series Marvel's Runaways."
        },
        {
            "id": 14692,
            "name": "Nick Castle",
            "image": "/bKJuXeKR8GZLyiutiDSCwwCzZ7n.jpg",
            "birth_date": "1947-09-21",
            "biography": "​From Wikipedia, the free encyclopedia.  \n\nNick Castle (born September 21, 1947) is an American actor, screenwriter and film director, best known for his role as Michael Myers in Halloween. He also co-wrote Escape from New York with his friend, John Carpenter.\n\nDescription above from the Wikipedia article Nick Castle, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 71600,
            "name": "Seth Gordon",
            "image": "/3V2gHFkbez8iGTdlYyS9NxMujfw.jpg",
            "birth_date": "1974-07-20",
            "biography": "Seth Gordon has produced and edited the critically lauded films NEW YORK DOLL and CRY WOLF, which grossed $10m at the US box office, and was the cinematographer on the Oscar-nominated SHUT UP AND SING.\n\nMost recently, Seth directed the critically acclaimed THE KING OF KONG: A FISTFUL OF QUARTERS. The film was noted on a host of critics; and publicationsʼ Best of the Year lists. He is currently set to direct HORRIBLE BOSSES starring Jennifer Aniston, Jason Bateman and Kevin Spacey. Seth is an honors graduate of Yale University, winner of an Oxford University writing fellowship and alumni of Harvard’s Graduate School of Design. He has also produced documentaries for PBS, the Gates Foundation and the UN.  "
        },
        {
            "id": 18918,
            "name": "Dwayne Johnson",
            "image": "/kuqFzlYMc2IrsOyPznMd1FroeGq.jpg",
            "birth_date": "1972-05-02",
            "biography": "An American and Canadian actor, producer and semi-retired professional wrestler, signed with WWE.  Johnson is half-Black and half-Samoan. His father, Rocky Johnson, is a Black Canadian, from Nova Scotia, and part of the first Black tag team champions in WWE history back when it was known as the WWF along with Tony Atlas. His mother is Samoan and the daughter of Peter Maivia, who was also a pro wrestler. Maivia's wife, Lia Maivia, was one of wrestling's few female promoters, taking over Polynesian Pacific Pro Wrestling after her husband's death in 1982, until 1988. Through his mother, he is considered a non-blood relative of the Anoa'i wrestling family. On March 29, 2008, The Rock inducted his father and his grandfather into the WWE Hall of Fame.\n\nAs of 2014, Johnson has a home in Southwest Ranches, Florida as well as Los Angeles, California. He also owns a farm in Virginia. In 2009, Johnson gained citizenship in Canada in honor of his father's background. Though Johnson was previously registered as a Republican, he voted for Barack Obama in the 2008 and 2012 United States presidential elections and is now an independent voter. He stated he did not vote in the 2016 U.S. election.\n\nIn recognition of his service to the Samoan people, and because he is a descendant of Samoan chiefs, Johnson had the noble title of Seiuli bestowed upon him by Malietoa Tanumafili II during his visit there in July 2004. He received a partial Samoan pe'a tattoo on his left side in 2003,and, in 2017, had the small \"Brahma bull\" tattoo on his right arm covered with a larger half-sleeve tattoo of a bull's skull.\n\nJohnson married Dany Garcia on May 3, 1997. Their only child together, a daughter named Simone, was born in August 2001. On June 1, 2007, they announced they were splitting up amicably. Johnson then began dating Lauren Hashian, daughter of Boston drummer Sib Hashian. They first met in 2006 while Johnson was filming The Game Plan. Their first child together, a daughter, was born in December 2015. Their second child, another daughter, was born in April 2018.\n\nJohnson attended the 2000 Democratic National Convention as part of WWE's non-partisan \"Smackdown Your Vote\" campaign, which aimed to influence young people to vote. He also had a speaking role at the 2000 Republican National Convention that same year.\n\nIn 2006, Johnson founded the Dwayne Johnson Rock Foundation, a charity working with at-risk and terminally ill children. On October 2, 2007, he and his ex-wife donated $1 million to the University of Miami to support the renovation of its football facilities; it was noted as the largest donation ever given to the university's athletics department by former students. The University of Miami renamed the Hurricanes' locker room in Johnson's honor. In 2015, Johnson donated $1,500 to a GoFundMe to pay for an abandoned dog's surgery. In 2017, he donated $25,000 to Hurricane Harvey relief efforts. In 2018, Johnson donated a gym to a military base in Oahu, Hawaii. After the 2018 Hawaii floods, he worked with Malama Kauai, a nonprofit organization, to help repair damages caused by the floods."
        },
        {
            "id": 29222,
            "name": "Zac Efron",
            "image": "/6oXNHv7gAyXXYFpF943pKRsTtqQ.jpg",
            "birth_date": "1987-10-18",
            "biography": "Zachary David Alexander Efron (born October 18, 1987) is an American actor. He began acting professionally in the early 2000s and rose to prominence in the late 2000s for his leading role as Troy Bolton in the High School Musical trilogy (2006–2008). During this time, he also starred in the musical film Hairspray (2007) and the comedy film 17 Again (2009). Efron subsequently rose to mainstream prominence with starring roles in the films New Year's Eve (2011), The Lucky One (2012), The Paperboy (2012), Neighbors (2014), Dirty Grandpa (2016), Baywatch (2017), and The Greatest Showman (2017). He played Ted Bundy in Extremely Wicked, Shockingly Evil and Vile (2019). In 2021, he won a Daytime Emmy Award for the Netflix web documentary series Down to Earth with Zac Efron (2020–present)."
        },
        {
            "id": 77234,
            "name": "Priyanka Chopra Jonas",
            "image": "/stEZxIVAWFlrifbWkeULsD4LHnf.jpg",
            "birth_date": "1982-07-18",
            "biography": "Priyanka Chopra Jonas (born 18 July 1982) is an Indian actress and producer. The winner of the Miss World 2000 pageant, Chopra is one of India's highest-paid actresses and has received numerous accolades, including two National Film Award and five Filmfare Awards. In 2016, the Government of India honoured her with the Padma Shri, and Time named her one of the 100 most influential people in the world. In the next two years, Forbes listed her among the World's 100 Most Powerful Women, and in 2022, she was named in the BBC 100 Women list."
        },
        {
            "id": 109513,
            "name": "Alexandra Daddario",
            "image": "/f5DsLRFDm2qLkVT8zmPsZ6d6Ngx.jpg",
            "birth_date": "1986-03-16",
            "biography": "Alexandra Anna Daddario (born March 16, 1986) is an American actress. She had her breakthrough portraying Annabeth Chase in the Percy Jackson film series (2010–2013). She has since starred as Paige in Hall Pass (2011), Heather Miller in Texas Chainsaw 3D (2013), Blake Gaines in San Andreas (2015), Summer Quinn in Baywatch (2017), and Alexis Butler in We Summon the Darkness (2019). She has also guest starred in television series such as White Collar, It's Always Sunny in Philadelphia, True Detective, New Girl, and American Horror Story: Hotel. In 2021, she starred in the first season of the HBO series The White Lotus, for which she received widespread critical acclaim and an Emmy nomination for Outstanding Supporting Actress in a Limited or Anthology Series or Movie in 2022."
        },
        {
            "id": 1461038,
            "name": "Jon Bass",
            "image": "/2eo9pMyPhA9mBaSrNlD6UP3Nkyw.jpg",
            "birth_date": "1989-09-22",
            "biography": "Jon Bass (born September 22, 1989) is an American actor, known for playing Ronnie Greenbaum in the film Baywatch, and Del Plimpton in the comedy series Big Time in Hollywood, FL."
        },
        {
            "id": 500427,
            "name": "Hannibal Buress",
            "image": "/mcw3Orbg4vbALXTVG4hriZjH1sj.jpg",
            "birth_date": "1983-02-04",
            "biography": "Hannibal Buress was born on February 4, 1983 in Chicago, Illinois, USA. He is an actor and writer, known for The Eric Andre Show (2012), The Secret Life of Pets (2016) and Neighbors (2014)."
        },
        {
            "id": 91268,
            "name": "Ruben Fleischer",
            "image": "/3JLxOPFTLigSy8FjFjDyMwD9GIp.jpg",
            "birth_date": "1974-10-31",
            "biography": "Ruben Samuel Fleischer (born October 31, 1974) is an American film director, film producer, television producer, music video director, and commercial director who lives in Los Angeles. He is best known as the director of Zombieland, his first feature film. He followed it by making the films 30 Minutes or Less, Gangster Squad and the 2018 film version of Venom which is based on the Marvel Comics character. Prior to directing feature films, Fleischer was a director of television commercials and music videos, working for such brands as Cisco, Eurostar, ESPN, and Burger King, as well as such artists as M.I.A., Electric Six, DJ Format, and Gold Chains."
        },
        {
            "id": 2524,
            "name": "Tom Hardy",
            "image": "/d81K0RH8UX7tZj49tZaQhZ9ewH.jpg",
            "birth_date": "1977-09-15",
            "biography": "Edward Thomas Hardy CBE (born 15 September 1977) is an English actor, producer, writer and former model. After studying acting at the Drama Centre London, he made his film debut in Ridley Scott's Black Hawk Down (2001). He has since been nominated for the Academy Award for Best Supporting Actor, two Critics' Choice Movie Awards and two British Academy Film Awards, receiving the 2011 BAFTA Rising Star Award.\n\nHardy has also appeared in films such as Star Trek: Nemesis (2002), RocknRolla (2008), Bronson (2008), Warrior (2011), Tinker Tailor Soldier Spy (2011), Lawless (2012), This Means War (2012), Locke (2013), The Drop (2014), and The Revenant (2015), for which he received a nomination for an Academy Award. In 2015, he portrayed \"Mad\" Max Rockatansky in Mad Max: Fury Road and both Kray twins in Legend. He has appeared in three Christopher Nolan films: Inception (2010) as Eames, The Dark Knight Rises (2012) as Bane, and Dunkirk (2017) as an RAF fighter-pilot. He starred as both Eddie Brock and Venom in the 2018 anti-hero film Venom and its sequel Venom: Let There Be Carnage (2021).\n\nHardy's television roles include the HBO war drama mini-series Band of Brothers (2001), the BBC historical drama mini-series The Virgin Queen (2005), Bill Sikes in the BBC's mini-series Oliver Twist (2007), Heathcliff in ITV's Wuthering Heights (2009), the Sky 1 drama series The Take (2009), and as Alfie Solomons in the BBC historical crime drama series Peaky Blinders (2014–present). He created, co-produced, and took the lead in the eight-part historical fiction series Taboo (2017) on BBC One and FX. In 2020, he also contributed narration work to the Amazon docuseries All or Nothing: Tottenham Hotspur.\n\nHardy has performed on both British and American stages. He was nominated for the Laurence Olivier Award for Most Promising Newcomer for his role as Skank in the production of In Arabia We'd All Be Kings (2003), and was awarded the 2003 Evening Standard Theatre Award for Outstanding Newcomer for his performances in both In Arabia We'd All Be Kings and Blood, in which he played Luca. He starred in the production of The Man of Mode (2007) and received positive reviews for his role in the play The Long Red Road (2010). Hardy is active in charity work and is an ambassador for the Prince's Trust. He was appointed a CBE in the 2018 Birthday Honours for services to drama.\n\nDescription above from the Wikipedia article Tom Hardy, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 1812,
            "name": "Michelle Williams",
            "image": "/b6mHfqOsf7zS7HzQL6dOfzbdmy7.jpg",
            "birth_date": "1980-09-09",
            "biography": "Michelle Ingrid Williams (born September 9, 1980) is an American actress. Known primarily for starring in small-scale independent films with dark or tragic themes, she has received various accolades, including two Golden Globe Awards and a Primetime Emmy Award, in addition to nominations for five Academy Awards and a Tony Award.\n\nWilliams, a daughter of politician and trader Larry R. Williams, began her career with television guest appearances and made her film debut in the family film Lassie in 1994. She gained emancipation from her parents at age fifteen, and soon achieved recognition for her leading role in the teen drama television series Dawson's Creek (1998–2003). This was followed by low-profile films, before having her breakthrough with the drama film Brokeback Mountain (2005).\n\nWilliams went on to receive critical acclaim for playing emotionally troubled women coping with loss or loneliness in the independent dramas Wendy and Lucy (2008), Blue Valentine (2010), and Manchester by the Sea (2016). She won two Golden Globes for portraying Marilyn Monroe in the drama My Week with Marilyn (2011) and Gwen Verdon in the miniseries Fosse/Verdon (2019), in addition to a Primetime Emmy Award for the latter. Her highest-grossing releases came with the thriller Shutter Island (2010), the fantasy film Oz the Great and Powerful (2013), the musical The Greatest Showman (2017), and the superhero films Venom (2018) and Venom: Let There Be Carnage (2021). Williams has also led major studio films, such as Ridley Scott's crime thriller All the Money in the World (2017) and Steven Spielberg's drama The Fabelmans (2022).\n\nOn Broadway, Williams starred in revivals of the musical Cabaret in 2014 and the drama Blackbird in 2016, for which she received a nomination for the Tony Award for Best Actress in a Play. She is an advocate for equal pay in the workplace. Consistently private about her personal life, Williams has a daughter from her relationship with actor Heath Ledger and was briefly married to musician Phil Elverum. She has two children with her second husband, theater director Thomas Kail."
        },
        {
            "id": 53240,
            "name": "Riz Ahmed",
            "image": "/1uP9RaX7BGVx7XGTEmwObBJJzsC.jpg",
            "birth_date": "1982-12-01",
            "biography": "Rizwan \"Riz\" Ahmed (born 1 December 1982), also known as Riz MC, is a British actor and rapper. As an actor, he is best known for his roles in Nightcrawler, Sound of Metal, Rogue One, Venom, The Sister Brothers, and the HBO miniseries The Night Of. He has received several awards, including an Academy Award and a Primetime Emmy Award with nominations for two Golden Globe Awards and two British Academy Film Awards."
        },
        {
            "id": 87954,
            "name": "Scott Haze",
            "image": "/6cd3Jt8Vo52j8cRKbNf1j7cERhs.jpg",
            "birth_date": "1993-06-28",
            "biography": "Scott Haze (born June 28, 1983) is an American actor and filmmaker."
        },
        {
            "id": 81316,
            "name": "Reid Scott",
            "image": "/kBAeDUDA7XJRXFLGNALlpE5d3lA.jpg",
            "birth_date": "1977-11-19",
            "biography": "Reid Scott (born November 19, 1977) is an American film and television actor. He is best known for starring in television comedies as Dan Egan in HBO's Veep and Brando Dorff in TBS's My Boys, as well as films such as Venom (2018) and Sister (2014)."
        },
        {
            "id": 213001,
            "name": "Jenny Slate",
            "image": "/iNpXig5Djkh5moYG4TCekIATs5B.jpg",
            "birth_date": "1982-03-25",
            "biography": "Jenny Slate (born March 25, 1982) is an American actress, stand-up comedian, and writer. Following early acting and stand-up roles on television, Slate gained recognition for her live variety shows in New York City and for co-creating, writing, and producing the children's short film and book series Marcel the Shell with Shoes On (2010–present). She became more widely known as a cast member on the 35th season of the NBC sketch comedy series Saturday Night Live between 2009 and 2010, followed by subsequent roles in the comedic series Bob's Burgers (2012–present), Parks and Recreation (2013–2015), House of Lies (2013–2015), and Kroll Show (2013–2015).\n\nSlate's breakout role came with her leading performance in the coming-of-age comedy-drama film Obvious Child (2014), for which she won the Critics' Choice Movie Award for Best Actress in a Comedy and was nominated for an Independent Spirit Award and Gotham Independent Film Award. She lent voice performances to the animated films The Lorax (2012), Zootopia (2016), The Secret Life of Pets film franchise (2016–2019), The Lego Batman Movie, and Despicable Me 3 (both 2017), and she ventured into dramatic roles with her supporting performance as Bonnie in Gifted (2017). She also appeared in the critically acclaimed science-fiction film Everything Everywhere All at Once, winning the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture.\n\nDescription above from the Wikipedia article Jenny Slate, licensed under CC-BY-SA, full list of contributors on Wikipedia.  "
        },
        {
            "id": 1401474,
            "name": "Corin Hardy",
            "image": "/p1ggxloo9MMOS72BLGuM3NOzhxQ.jpg",
            "birth_date": "1975-01-06",
            "biography": "Corin Hardy (born 6 January 1975) is an English director, best known for the supernatural horror films \"The Hallow\" (2015) and \"The Nun\" (2018)."
        },
        {
            "id": 527313,
            "name": "Taissa Farmiga",
            "image": "/kC2Movbs6uEF8DdDhvyHizQHuru.jpg",
            "birth_date": "1994-08-17",
            "biography": "Taissa Farmiga (born August 17, 1994) is an American actress. Born in Whitehouse Station, New Jersey, she is the younger sister of actress Vera Farmiga. Her numerous appearances in horror films have established her as a scream queen.\n\nFarmiga was encouraged to begin acting by her sister, and subsequently made her debut in her sister's film Higher Ground (2011). Thereafter, she rose to prominence for her work on the anthology series American Horror Story, starring in the seasons Murder House (2011), Coven (2013–2014), Roanoke (2016) and Apocalypse (2018). Her early film roles include the romantic comedy At Middleton (2013), the crime drama The Bling Ring (2013) and the psychological thriller Mindscape (2013), the latter of which was her first starring film role.\n\nFarmiga was lauded for her performances in the comedy slasher film The Final Girls (2015), and the drama films 6 Years (2015) and Share (2015), all of which premiered at South by Southwest, which led her to be named one of the breakout stars of the festival. She has also provided the voice of Raven in the DC Animated Movie Universe (2016–2020), starred in the comedy films Rules Don't Apply (2016) and The Long Dumb Road (2018), the drama films In a Valley of Violence (2016) and What They Had (2018) and the supernatural thriller film The Nun (2018). Farmiga headlined the procedural drama series Wicked City (2015), and made her stage debut in the off-Broadway revival of the drama play Buried Child (2016)."
        },
        {
            "id": 76961,
            "name": "Demián Bichir",
            "image": "/sw8TqPQLbMMgLbkNNUIW649THWJ.jpg",
            "birth_date": "1963-08-01",
            "biography": "Demián Bichir Nájera (August 1, 1963, height 5' 10\" (1,78 m)) is a Mexican actor. Both of his parents, Alejandro Bichir and Maricruz Nájera, and brothers Odiseo and Bruno Bichir are actors. He was married to singer Lisset Gutiérrez.\n\nHe started his acting career at the age of 14 in the telenovela Rina with Ofelia Medina. His second acting role was as an adult in Vivir enamorada both telenovelas were during his years with Televisa. The following year he obtained a role in his first movie, the American production Choices of the Heart. He then continued his acting roles in telenovelas with film productions of Mexico, Spain and the United States. His movie Sexo, pudor y lágrimas (1999) broke box-office records in Mexico becoming the #1 movie in the history of Mexican cinema until El crimen del Padre Amaro. The MTV Movie Awards-México created a special category \"Mejor Bichir en una Película\" (\"Best Bichir in a movie\") because of the many films the Bichir siblings act in every year. He earned this award for Bendito infierno, in which he co-stars with Victoria Abril, Penélope Cruz and Gael García Bernal. His American debut occurred when he depicted Fidel Castro in Steven Soderbergh's 2008 biopic Che, on the life of revolutionary Che Guevara.\n\nRecently he has been exposed to a wider American audience with his recurring role as Esteban Reyes, the corrupt mayor of Tijuana and love interest of Nancy Botwin in the fourth, fifth and sixth seasons of the Showtime comedy series Weeds."
        },
        {
            "id": 87287,
            "name": "Bonnie Aarons",
            "image": "/iEtWuoXKx4ZKbIWwJp1V76Heavy.jpg",
            "birth_date": "1960-09-09",
            "biography": "Bonnie Aarons (born September 9, 1960) is an American actress and writer, known for The Conjuring 2 (2016), The Nun (2018)  and The Nun II (2023). She was also in The Fighter (2010),  Mulholland Dr. (1999), The Princess Diaries (2001) and its sequel, The Princess Diaries 2: Royal Engagement (2004)."
        },
        {
            "id": 566080,
            "name": "Jonas Bloquet",
            "image": "/pzQAv6ghx5hc4gSpxHII0oUzqkL.jpg",
            "birth_date": "1992-07-10",
            "biography": "Jonas Bloquet (born 10 July 1992) is a Belgian actor and film director. He made his film debut at the age of 15 in the drama Private Lessons (2008), which earned him a Magritte Award nomination for Most Promising Actor. He has starred in Belgian, French, and American films and is known for his roles such as Vincent Leblanc in the psychological thriller Elle (2016), for which he was nominated for a César Award for Most Promising Actor, and Maurice \"Frenchie\" Theriault in the horror film The Nun (2018) and its sequel The Nun II (2023).\n\nOn television, he has starred in the mystery-science fiction series 1899 (2022), and portrayed Joseph II, Holy Roman Emperor in the historical drama series Marie Antoinette (2023).\n\nDescription above from the Wikipedia article Jonas Bloquet, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 117656,
            "name": "Ingrid Bisu",
            "image": "/q7C8VKaQMOgilncOc2gf1oMGBKE.jpg",
            "birth_date": "1987-09-15",
            "biography": "Ingrid Bisu (born September 15, 1987) is a Romanian actress, producer, and screenwriter, known for her appearance in the dramedy Toni Erdmann (2016), which was nominated for the Palme d'Or at the Cannes Film Festival and also for Best Foreign Film at the Golden Globe Awards and the Academy Awards in 2017. She is also known for co-writing the horror film Malignant (2021)."
        },
        {
            "id": 17178,
            "name": "Patrick Wilson",
            "image": "/tc1ezEfIY8BhCy85svOUDtpBFPt.jpg",
            "birth_date": "1973-07-03",
            "biography": "Patrick Joseph Wilson (born July 3, 1973) is an American actor, director, and singer. He began his career in 1995, starring in Broadway musicals. He is a two-time Tony Award nominee for his roles in The Full Monty (2000–2001) and Oklahoma! (2002). He co-starred in the acclaimed HBO miniseries Angels in America (2003), for which he was nominated for both the Golden Globe Award and Primetime Emmy Award for Outstanding Supporting Actor in a Miniseries or a Movie.\n\nWilson has also appeared in films such as The Phantom of the Opera (2004), Hard Candy (2005), Little Children (2006), Watchmen (2009), Insidious (2010), The A-Team (2010), Insidious: Chapter 2 (2013), and as demonologist Ed Warren in the Conjuring Universe (2013–present). He has earned a reputation as a \"scream king\" due to his frequent casting in horror films.\n\nOn television, Wilson starred in the CBS drama series A Gifted Man (2011–2012) and as Lou Solverson in the second season of FX's anthology series Fargo (2015), for which he received a second Golden Globe Award nomination. In the DC Extended Universe, he portrayed Orm Marius / Ocean Master in the superhero film Aquaman (2018) and voiced the U.S. President in Batman v Superman: Dawn of Justice (2016).\n\nDescription above from the Wikipedia article Patrick Wilson (American actor), licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 7467,
            "name": "David Fincher",
            "image": "/yV36WTsLBAGyYVUQshNdI8hyk9l.jpg",
            "birth_date": "1962-08-28",
            "biography": "David Andrew Leo Fincher (born August 28, 1962) is an American film director. His films, mostly thrillers, have received 40 nominations at the Academy Awards, including three for him as Best Director.\n\nBorn in Denver, Colorado, Fincher was interested in filmmaking at an early age. He directed numerous music videos, most notably Madonna's \"Express Yourself\" in 1989 and \"Vogue\" in 1990, both of which won him the MTV Video Music Award for Best Direction. He made his feature film debut with Alien 3 (1992), which garnered mixed reviews, followed by the thriller Seven (1995), which was better received. Fincher found lukewarm success with The Game (1997) and Fight Club (1999), but the latter eventually became a cult classic. In 2002, he returned to prominence with the thriller Panic Room starring Jodie Foster.\n\nFincher also directed Zodiac (2007), The Social Network (2010), The Girl with the Dragon Tattoo (2011), and Mank (2020). For The Social Network, he won the Golden Globe Award for Best Director and BAFTA Award for Best Direction. His biggest commercial successes are The Curious Case of Benjamin Button (2008) and Gone Girl (2014), both of which grossed more than $300 million worldwide, with the former earning thirteen nominations at the Academy Awards, and eleven at the British Academy Film Awards.\n\nHe also served as an executive producer and director for the Netflix series House of Cards (2013–2018) and Mindhunter (2017–2019), winning the Primetime Emmy Award for Outstanding Directing for a Drama Series for the pilot episode of House of Cards. Fincher was the co-founder of Propaganda Films, a film, and music."
        },
        {
            "id": 192,
            "name": "Morgan Freeman",
            "image": "/jPsLqiYGSofU4s6BjrxnefMfabb.jpg",
            "birth_date": "1937-06-01",
            "biography": "Morgan Freeman (born June 1, 1937) is an American actor, director, and narrator. Noted for his distinctive deep voice, Freeman is known for his various roles in a wide variety of film genres. Throughout his career spanning over five decades, he has received multiple accolades, including an Academy Award, a Screen Actors Guild Award, and a Golden Globe Award.\n\nBorn in Memphis, Tennessee, Freeman was raised in Mississippi where he began acting in school plays. He studied theatre arts in Los Angeles and appeared in stage productions in his early career. He rose to fame in the 1970s for his role in the children's television series The Electric Company. Freeman then appeared in the Shakespearean plays Coriolanus and Julius Caesar, the former of which earned him an Obie Award. His breakout role was in Street Smart (1987), playing a hustler, which earned him an Academy Award nomination for Best Supporting Actor. He achieved further stardom in Glory, the biographical drama Lean on Me, and comedy-drama Driving Miss Daisy (all 1989), the latter of which garnered him his first Academy Award nomination for Best Actor.\n\nIn 1992, Freeman starred alongside Clint Eastwood in the western revenge film Unforgiven; this would be the first of several collaborations with Eastwood. In 1994, he starred in the prison drama The Shawshank Redemption for which he received another Academy Award nomination. Freeman also starred in David Fincher's crime thriller Se7en (1995), and Steven Spielberg's historical drama Amistad (1997). Freeman won the Academy Award for Best Supporting Actor for his performance in Clint Eastwood's 2004 sports drama Million Dollar Baby. In 2009, he received his fifth Oscar nomination for playing former South African President Nelson Mandela in Eastwood's Invictus. Freeman is also known for his performance as Lucius Fox in Christopher Nolan's The Dark Knight Trilogy (2005–2012).\n\nIn addition to acting, Freeman has directed the drama Bopha! (1993). He also founded film production company Revelations Entertainment with business partner Lori McCreary. He is the recipient of the Kennedy Center Honor, the AFI Life Achievement Award, the Cecil B. DeMille Award, and the Screen Actors Guild Life Achievement Award. For his performances in theatrical productions, he has won three Obie Awards, one of the most prestigious honors for recognizing excellence in theatre.\n\nDescription above from the Wikipedia article Morgan Freeman, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 287,
            "name": "Brad Pitt",
            "image": "/eAOtKAc4p2C3DV8TGJQJzw8DeRv.jpg",
            "birth_date": "1963-12-18",
            "biography": "William Bradley Pitt (born December 18, 1963) is an American actor and film producer. He is the recipient of various accolades, including an Academy Award, a British Academy Film Award, and two Golden Globe Awards for his acting, in addition to a second Academy Award, a second British Academy Film Award, a third Golden Globe Award, and a Primetime Emmy Award as a producer under his production company, Plan B Entertainment.\n\nPitt first gained recognition as a cowboy hitchhiker in the road film Thelma & Louise (1991). His first leading roles in big-budget productions came with the drama films A River Runs Through It (1992) and Legends of the Fall (1994), and the horror film Interview with the Vampire (1994). He gave critically acclaimed performances in the crime thriller Seven (1995) and the science fiction film 12 Monkeys (1995), the latter earning him a Golden Globe Award for Best Supporting Actor and an Academy Award nomination.\n\nPitt starred in Fight Club (1999) and the heist film Ocean's Eleven (2001), as well as its sequels, Ocean's Twelve (2004) and Ocean's Thirteen (2007). His greatest commercial successes have been Ocean's Eleven (2001), Troy (2004), Mr. & Mrs. Smith (2005), World War Z (2013), and Once Upon a Time in Hollywood (2019), for which he won a second Golden Globe Award and the Academy Award for Best Supporting Actor. Pitt's other Academy Award nominated performances were in The Curious Case of Benjamin Button (2008) and Moneyball (2011). He produced The Departed (2006) and 12 Years a Slave (2013), both of which won the Academy Award for Best Picture, and also The Tree of Life (2011), Moneyball (2011) and The Big Short (2015), all of which were nominated for Best Picture. Pitt is the second actor to have won Academy Awards for both Best Supporting Actor and Best Picture.\n\nIn a court filing in Los Angeles, filed as part of a legal battle over a winery the prominent Hollywood actors once owned together, lawyers for Ms. Jolie stated that negotiations to sell her share of the business to Mr. Pitt had broken down over his demand that she sign “a nondisclosure agreement that would have contractually prohibited her from speaking outside of court about Pitt’s physical and emotional abuse of her and their children.”\n\nHer filing goes on to describe an extended physical and verbal outburst in September 2016 as Mr. Pitt, Ms. Jolie and their six children flew from France to California. “Pitt choked one of the children and struck another in the face” and “grabbed Jolie by the head and shook her,” the filing states, adding that at one point “he poured beer on Jolie; at another, he poured beer and red wine on the children.”"
        },
        {
            "id": 12052,
            "name": "Gwyneth Paltrow",
            "image": "/slPWN0VvYJtNOEuxlFSsXSNQMaF.jpg",
            "birth_date": "1972-09-27",
            "biography": "Gwyneth Kate Paltrow (born September 27, 1972) is an American actress and businesswoman. She is the recipient of various accolades, including an Academy Award, a Golden Globe Award, and a Primetime Emmy Award.\n\nPaltrow gained notice for her early work in films such as Seven (1995), Emma (1996), Sliding Doors (1998), and A Perfect Murder (1998). She garnered wider acclaim for her performance as Viola de Lesseps in the historical romance Shakespeare in Love (1998) which won her several awards, including the Academy Award for Best Actress. This was followed by roles in The Talented Mr. Ripley (1999), The Royal Tenenbaums (2001), Shallow Hal (2001), and Sky Captain and the World of Tomorrow (2004).\n\nAfter becoming a parent in 2004, Paltrow significantly reduced her acting workload. She made occasional appearances in films, such as the drama Proof (2005), which earned her a nomination for a Golden Globe Award for Best Actress. In 2009, she received a Grammy Award nomination for Best Spoken Word Album for Children for the children's audiobook Brown Bear and Friends. In addition, she won a Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series for her guest role as Holly Holliday on the Fox musical television series Glee in 2011. From 2008 to 2019, she portrayed Pepper Potts in the Marvel Cinematic Universe.\n\nBeginning in 1995, Paltrow has been the face of Estée Lauder's Pleasures perfume; she was previously the face of the American fashion brand Coach. She is the founder and CEO of the lifestyle company Goop, which has been criticized for promoting pseudoscience, and has authored several cookbooks."
        },
        {
            "id": 12055,
            "name": "John Cassini",
            "image": "/kn2Rtn0I8ivCR7ydZTY74XUBh1K.jpg",
            "birth_date": null,
            "biography": "​From Wikipedia, the free encyclopedia.  \n\nJohn Cassini (born at Toronto) is a Canadian actor who played the role of Officer Davis in the 1995 Brad Pitt film, Se7en. He also starred in the 2005 film Cool Money. Cassini starred as Ronnie Delmarco on the CBC series, Intelligence. On March 7, 2008, the CBC announced that Intelligence would be cancelled. Cassini appeared in and is listed as a producer of the film \"Guido Superstar: The Rise of Guido\", starring, produced, and directed by Silvio Pollio, including, Nicholas Lea, Terry Chen, and Michael Eklund. The film screened at the 2010 Vancouver International Film Festival Thursday, Oct. 7 at 9:45 p.m. and Friday, Oct. 8, at 10:45 a.m., both at the Empire Granville 7 in downtown Vancouver, BC.  Cassini is an Italian citizen\n\nDescription above from the Wikipedia article John Cassini,  licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 30487,
            "name": "Peter Crombie",
            "image": "/pMvhE1wwQo3eTSp4vwq8Hb22CwN.jpg",
            "birth_date": "1952-06-26",
            "biography": "Peter B. Crombie (born June 26, 1952 - January 11, 2024) is an American film and television actor."
        },
        {
            "id": 38951,
            "name": "Reg E. Cathey",
            "image": "/cgyJJQUdbK4S7ihkL9hgIIwutk3.jpg",
            "birth_date": "1958-08-18",
            "biography": "Reginald Eurias Cathey (August 18, 1958 – February 9, 2018) was an American character actor. He was best known for his roles as Norman Wilson in The Wire, Martin Querns in Oz, the game show announcer in Square One Television, Dr. Franklin Storm in the 2015 reboot of Fantastic Four, and Freddy Hayes in House of Cards, the last earning him three consecutive Emmy Award nominations for Outstanding Guest Actor in a Drama Series, including a win in 2015.\n\nDescription above from the Wikipedia article Reg E. Cathey, licensed under CC-BY-SA, full list of contributors on Wikipedia."
        },
        {
            "id": 9168,
            "name": "Alan Parker",
            "image": "/pdpFqPNq4HZiPax1WSMbEDpND2I.jpg",
            "birth_date": "1944-02-14",
            "biography": "Sir Alan Parker was a director, writer and producer. His feature films have won nineteen BAFTA awards, ten Golden Globes and ten Oscars. His films include Bugsy Malone, Midnight Express, Mississippi Burning, The Commitments, Evita, Fame, Birdy, Angel Heart and Angela’s Ashes. He was founding chairman of the UK Film Council, a position he held for five years, and prior to that was chairman of the BFI. Sir Alan received the CBE in 1995 and a knighthood in 2002. He was also an Officier Des Arts et Lettres (France)."
        },
        {
            "id": 2295,
            "name": "Mickey Rourke",
            "image": "/i6vXukUwRsJa7S9yhZgoKt9xLDv.jpg",
            "birth_date": "1952-09-16",
            "biography": "Philip Andre \"Mickey\" Rourke Jr. (born September 16, 1952) is an American actor and former boxer who has appeared primarily as a leading man in drama, action, and thriller films.\n\nDuring the star of the 1980s, Rourke played supporting roles in films like Body Heat (1981) and Diner (1982), before portraying leading roles in films like The Motorcycle Boy in Rumble Fish (1983), Charlie Moran in The Pope of Greenwich Village (1984), Captain Stanley White in Year of the Dragon and John Gray in 9½ Weeks (1986). He received critical praise for his work in the Charles Bukowski biopic Barfly and the horror mystery Angel Heart (both 1987). In 1991, following a string of critical and commercial failures, Rourke—who trained as a boxer in his early years—left acting and became a professional boxer for a time.\n\nAfter retiring from boxing in 1994, Rourke returned to acting and had supporting roles in several films such as The Rainmaker (1997), Buffalo '66 (1998), Animal Factory, Get Carter (both 2000), The Pledge (2001), Once Upon a Time in Mexico (2003), Man on Fire (2004) and Domino (2005). In 2005, Rourke made a comeback in mainstream Hollywood circles with a lead role in the neo-noir action thriller Sin City, for which he won awards from the Chicago Film Critics Association, the Irish Film and Television Awards, and the Online Film Critics Society.\n\nThis comeback cumulated in his portraying aging wrestler Randy 'The Ram' Robinson in the sports drama film The Wrestler (2008). For the role, Rourke won the Golden Globe Award and BAFTA Award for Best Actor, and received a nomination for the Academy Award for Best Actor. After this, Rourke appeared in several commercially successful films; Iron Man 2, The Expendables (both 2010) and Immortals (2011), before primarily going on to work in independent and direct-to-video productions."
        },
        {
            "id": 380,
            "name": "Robert De Niro",
            "image": "/cT8htcckIuyI1Lqwt1CvD02ynTh.jpg",
            "birth_date": "1943-08-17",
            "biography": "Robert Anthony De Niro (born August 17, 1943) is an American actor. Known for his collaborations with Martin Scorsese, he is considered to be one of the best actors of his generation. De Niro is the recipient of various accolades, including two Academy Awards, a Golden Globe Award, the Cecil B. DeMille Award, and a Screen Actors Guild Life Achievement Award. In 2009, De Niro received the Kennedy Center Honor, and earned a Presidential Medal of Freedom from U.S. President Barack Obama in 2016.\n\nDe Niro studied acting at HB Studio, Stella Adler Conservatory, and Lee Strasberg's Actors Studio. His first collaboration with Scorsese was with the 1973 film Mean Streets. De Niro earned two Academy Awards, one for Best Supporting Actor for his role as Vito Corleone in Francis Ford Coppola's The Godfather Part II (1974) and the other for Best Actor portraying Jake LaMotta in Scorsese's drama Raging Bull (1980). His other Oscar-nominated roles were for Taxi Driver (1976), The Deer Hunter (1978), Awakenings (1990), Cape Fear (1991), and Silver Linings Playbook (2012).\n\nOther notable roles include in 1900 (1976), The King of Comedy (1982), Once Upon a Time in America (1984), Brazil (1985), The Mission (1986), Goodfellas (1990), This Boy's Life (1993), Mary Shelley’s Frankenstein (1994), Heat (1995), Casino (1995), Jackie Brown (1997), The Good Shepherd (2006), Joker (2019), and The Irishman (2019). He made his directorial film debut with A Bronx Tale (1993). His comedic roles include Midnight Run (1988), Wag the Dog (1997), Analyze This (1999), the Meet the Parents films (2000-2010), and The Intern (2015).\n\nAlso known for his television roles, De Niro portrayed Bernie Madoff in the HBO film The Wizard of Lies (2017), earning a Primetime Emmy Award for Outstanding Lead Actor in a Limited Series or Movie nomination. He received further Emmy Award nominations for producing the Netflix limited series When They See Us (2019), and for portraying Robert Mueller on Saturday Night Live.[1]\n\nDe Niro and producer Jane Rosenthal founded the film and television production company TriBeCa Productions in 1989, which has produced several films alongside his own. Also with Rosenthal, he founded the Tribeca Film Festival in 2002. Six of De Niro's films have been inducted into the United States National Film Registry by the Library of Congress as \"culturally, historically, or aesthetically significant\"."
        },
        {
            "id": 3232,
            "name": "Lisa Bonet",
            "image": "/gzvRPbJxnDarHEa3YltnN35aYRx.jpg",
            "birth_date": "1967-11-16",
            "biography": "Lilakoi Moon (born Lisa Michelle Bonet), known professionally as Lisa Bonet, is an American actress. She is best known for her role as Denise Huxtable on the long-running NBC sitcom The Cosby Show, and originally starring in its spinoff series A Different World. She earned widespread acclaim and several awards for her role, such as a nomination for the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series in 1986.\n\nShe appeared in the psychological horror film Angel Heart (1987), which earned her a nomination for the Saturn Award for Best Supporting Actress. She co-starred in the action thriller film Enemy of the State (1998), the comedy-drama film High Fidelity (2000), the action drama film Biker Boyz (2003), and the thriller film Road to Paloma (2013). She has sporadically worked in TV acting with such roles as Maya Daniels in Life on Mars (2008–2009) and Marisol on Ray Donovan (2016)."
        },
        {
            "id": 44079,
            "name": "Charlotte Rampling",
            "image": "/7fhg5FCcl0VfYERP5D0unpybqgx.jpg",
            "birth_date": "1946-02-05",
            "biography": "Tessa Charlotte Rampling OBE (born 5 February 1946) is an English actress, model and singer, known for her work in European arthouse films in English, French, and Italian. An icon of the Swinging Sixties, she began her career as a model and later became a fashion icon and muse."
        },
        {
            "id": 9170,
            "name": "Stocker Fontelieu",
            "image": "/nz2Qfjk9aMUQPtuzTCVnnNv9TVp.jpg",
            "birth_date": "1923-05-05",
            "biography": "Charles Stocker Fontelieu was an American actor."
        },
        {
            "id": 9171,
            "name": "Brownie McGhee",
            "image": "/laJTFWiQ6vxRFT1jkIuqPXE5mH1.jpg",
            "birth_date": "1915-11-30",
            "biography": "Walter Brown \"Brownie\" McGhee was an American folk music and Piedmont blues singer and guitarist, best known for his collaboration with the harmonica player Sonny Terry."
        }
    ],
    "roles": [
        {
            "603": {
                "6384": "Neo",
                "2975": "Morpheus",
                "530": "Trinity",
                "1331": "Agent Smith",
                "9364": "Oracle",
                "532": "Cypher"
            }
        },
        {
            "475557": {
                "73421": "Arthur Fleck / Joker",
                "380": "Murray Franklin",
                "1545693": "Sophie Dumond",
                "4432": "Penny Fleck",
                "16841": "Thomas Wayne",
                "74242": "Detective Burke"
            }
        },
        {
            "348": {
                "4139": "Dallas",
                "10205": "Ripley",
                "5047": "Lambert",
                "5048": "Brett",
                "5049": "Kane",
                "65": "Ash"
            }
        },
        {
            "263115": {
                "6968": "Logan / Wolverine / X-24",
                "1464650": "Laura / X-23",
                "2387": "Charles Xavier / Professor X",
                "65421": "Gabriela",
                "467645": "Pierce",
                "39189": "Caliban"
            }
        },
        {
            "299537": {
                "60073": "Carol Danvers / Vers / Captain Marvel",
                "2231": "Nick Fury",
                "77335": "Talos / Keller",
                "9642": "Yon-Rogg",
                "516": "Supreme Intelligence / Dr. Wendy Lawson",
                "938": "Korath"
            }
        },
        {
            "320288": {
                "1001657": "Jean Grey / Dark Phoenix",
                "5530": "Charles Xavier / Professor X",
                "3292": "Hank McCoy / Beast",
                "1034681": "Scott Summers / Cyclops",
                "17288": "Erik Lensherr / Magneto",
                "1253199": "Ororo Munroe / Storm"
            }
        },
        {
            "62": {
                "245": "Dr. David Bowman",
                "246": "Dr. Frank Poole",
                "247": "Dr. Heywood Floyd",
                "253": "HAL 9000 (voice)",
                "248": "Moonwatcher",
                "249": "Dr. Andrei Smyslov"
            }
        },
        {
            "111": {
                "1158": "Antonio 'Tony' Montana",
                "1159": "Manolo 'Manny' Ray",
                "1160": "Elvira",
                "1161": "Gina Montana",
                "1162": "Frank Lopez",
                "1163": "Mama Montana"
            }
        },
        {
            "284052": {
                "71580": "Stephen Strange / Doctor Strange",
                "5294": "Karl Mordo",
                "53714": "Dr. Christine Palmer",
                "30082": "Wong",
                "1019": "Kaecilius",
                "3063": "The Ancient One"
            }
        },
        {
            "490132": {
                "110": "Tony Lip",
                "932967": "Dr. Don Shirley",
                "1817": "Dolores",
                "299743": "Johnny Venere",
                "1613744": "Oleg",
                "1211946": "Record Exec"
            }
        },
        {
            "141": {
                "131": "Donnie Darko",
                "20089": "Gretchen Ross",
                "1582": "Frank",
                "69597": "Karen Pomeroy",
                "5151": "Kitty Farmer",
                "1579": "Elizabeth Darko"
            }
        },
        {
            "383498": {
                "10859": "Wade Wilson / Deadpool / Juggernaut (voice) / Ryan Reynolds",
                "16851": "Nathan Summers / Cable",
                "54882": "Vanessa Carlysle",
                "1139349": "Russell Collins / Firefist",
                "1545693": "Neena Thurman / Domino",
                "51990": "Jack Hammer / Weasel"
            }
        },
        {
            "381288": {
                "5530": "Kevin Wendell Crumb",
                "1397778": "Casey Cooke",
                "52462": "Karen Fletcher",
                "1286328": "Claire Benoit",
                "1221085": "Marcia",
                "1657685": "Five-Year-Old Casey"
            }
        },
        {
            "297802": {
                "117642": "Arthur Curry / Aquaman",
                "55085": "Mera",
                "5293": "Nuidis Vulko",
                "17178": "King Orm Marius / Ocean Master",
                "2227": "Atlanna",
                "16644": "King Nereus"
            }
        },
        {
            "424139": {
                "8944": "Laurie Strode",
                "20750": "Karen Nelson",
                "1511997": "Allyson Nelson",
                "883": "Deputy Frank Hawkins",
                "1279279": "Vicky",
                "14692": "Michael Myers / The Shape"
            }
        },
        {
            "339846": {
                "18918": "Mitch Buchanan",
                "29222": "Matt Brody",
                "77234": "Victoria Leeds",
                "109513": "Summer Quinn",
                "1461038": "Ronnie Greenbaum",
                "500427": "Dave the Tech"
            }
        },
        {
            "335983": {
                "2524": "Eddie Brock / Venom",
                "1812": "Anne Weying",
                "53240": "Carlton Drake / Riot",
                "87954": "Security Chief Roland Treece",
                "81316": "Dr. Dan Lewis",
                "213001": "Dr. Dora Skirth"
            }
        },
        {
            "439079": {
                "527313": "Sister Irene",
                "76961": "Father Burke",
                "87287": "The Nun / Valak",
                "566080": "Maurice Theriault",
                "117656": "Sister Oana",
                "17178": "Ed Warren"
            }
        },
        {
            "807": {
                "192": "Detective Lt. William Somerset",
                "287": "Detective David Mills",
                "12052": "Tracy Mills",
                "12055": "Officer Davis",
                "30487": "Dr. O'Neill",
                "38951": "Dr. Santiago"
            }
        },
        {
            "635": {
                "2295": "Harry Angel",
                "380": "Louis Cyphre",
                "3232": "Epiphany Proudfoot",
                "44079": "Margaret Krusemark",
                "9170": "Ethan Krusemark",
                "9171": "Toots Sweet"
            }
        }
    ],
    "directs": [
        {
            "id": 9340,
            "movie": 603
        },
        {
            "id": 57130,
            "movie": 475557
        },
        {
            "id": 578,
            "movie": 348
        },
        {
            "id": 366,
            "movie": 263115
        },
        {
            "id": 53068,
            "movie": 299537
        },
        {
            "id": 11092,
            "movie": 320288
        },
        {
            "id": 240,
            "movie": 62
        },
        {
            "id": 1150,
            "movie": 111
        },
        {
            "id": 55499,
            "movie": 284052
        },
        {
            "id": 7396,
            "movie": 490132
        },
        {
            "id": 1577,
            "movie": 141
        },
        {
            "id": 40684,
            "movie": 383498
        },
        {
            "id": 11614,
            "movie": 381288
        },
        {
            "id": 2127,
            "movie": 297802
        },
        {
            "id": 64141,
            "movie": 424139
        },
        {
            "id": 71600,
            "movie": 339846
        },
        {
            "id": 91268,
            "movie": 335983
        },
        {
            "id": 1401474,
            "movie": 439079
        },
        {
            "id": 7467,
            "movie": 807
        },
        {
            "id": 9168,
            "movie": 635
        }
    ]
}